<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">
  <Namespace id="_1" name="::" members="_3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _70 _71 _72 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102 _103 _104 _105 _106 _107 _108 _109 _110 _111 _112 _113 _114 _115 _116 _117 _118 _119 _121 _122 _124 _125 _126 _127 _128 _129 _130 _131 _132 _133 _134 _135 _136 _137 _138 _139 _140 _2 _141 _142 _143 _144 _145 _146 _147 _148 _149 _150 _151 _152 _153 _154 _155 _156 _157 _158 _159 _160 _161 _162 _163 _164 _165 _166 _167 _168 _169 _170 _171 _172 _173 _174 _175 _176 _177 _178 _179 _180 _181 _182 _183 _184 _185 _186 _187 _188 _189 _190 _191 _192 _193 _194 _195 _196 _197 _198 _199 _200 _201 _202 _203 _204 _205 _206 _207 _208 _209 _210 _211 _212 _213 _214 _215 _216 _217 _218 _219 _220 _221 _222 _223 _224 _225 _226 _227 _228 _229 _230 _231 _232 _233 _234 _235 _236 _237 _238 _239 _240 _241 " mangled="_Z2::" demangled="::"/>
  <Namespace id="_2" name="std" context="_1" members="" mangled="_Z3std" demangled="std"/>
  <Function id="_3" name="__builtin_nans" returns="_242" context="_1" location="f0:21" file="f0" line="21" extern="1" attributes="nothrow const nonnull">

  </Function>
  <Function id="_227" name="id3_field_addstring" returns="_247" context="_1" location="f2:292" file="f2" line="292" extern="1">
    <Argument type="_251" location="f2:292" file="f2" line="292"/>
    <Argument type="_256" location="f2:292" file="f2" line="292"/>
  </Function>
  <Function id="_228" name="id3_file_fdopen" returns="_291" context="_1" location="f2:248" file="f2" line="248" extern="1">
    <Argument type="_247" location="f2:248" file="f2" line="248"/>
    <Argument type="_209" location="f2:248" file="f2" line="248"/>
  </Function>
  <Function id="_229" name="__builtin_isgreater" returns="_246" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Union id="_230" name="id3_field" context="_1" mangled="9id3_field" demangled="id3_field" location="f2:205" file="f2" line="205" artificial="1" size="192" align="64" members="_311 _312 _313 _314 _315 _316 _317 _318 _319 _320 _321 _322 _323 _324 _325 _326 _327 _328 _329 " bases=""/>
  <Function id="_231" name="id3_tag_version" returns="_253" context="_1" location="f2:260" file="f2" line="260" extern="1">
    <Argument type="_285" location="f2:260" file="f2" line="260"/>
  </Function>
  <Function id="_232" name="__builtin_bswap32" returns="_253" context="_1" location="f0:157" file="f0" line="157" extern="1">
    <Argument name="_data" type="_253" location="f0:157" file="f0" line="157"/>
  </Function>
  <Variable id="_233" name="cpp_sym_ID3_FRAME_GENRE" type="_243" init="(const char*)&quot;TCON&quot;" context="_1" location="f1:13" file="f1" line="13"/>
  <Function id="_234" name="__builtin_sinf" returns="_244" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_244" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_235" name="__builtin_sinh" returns="_242" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_242" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_236" name="__builtin_sinl" returns="_245" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_245" location="f0:80" file="f0" line="80"/>
  </Function>
  <Function id="_237" name="id3_file_close" returns="_247" context="_1" location="f2:249" file="f2" line="249" extern="1">
    <Argument type="_291" location="f2:249" file="f2" line="249"/>
  </Function>
  <Function id="_238" name="__builtin_csin" returns="_258" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_258" location="f0:115" file="f0" line="115"/>
  </Function>
  <Function id="_239" name="id3_tag_setlength" returns="_260" context="_1" location="f2:263" file="f2" line="263" extern="1">
    <Argument type="_254" location="f2:263" file="f2" line="263"/>
    <Argument type="_74" location="f2:263" file="f2" line="263"/>
  </Function>
  <Function id="_240" name="id3_field_type" returns="_241" context="_1" location="f2:287" file="f2" line="287" extern="1">
    <Argument type="_257" location="f2:287" file="f2" line="287"/>
  </Function>
  <Enumeration id="_241" name="id3_field_type" context="_1" location="f2:179" file="f2" line="179" artificial="1" size="32" align="32">
    <EnumValue name="ID3_FIELD_TYPE_TEXTENCODING" init="0"/>
    <EnumValue name="ID3_FIELD_TYPE_LATIN1" init="1"/>
    <EnumValue name="ID3_FIELD_TYPE_LATIN1FULL" init="2"/>
    <EnumValue name="ID3_FIELD_TYPE_LATIN1LIST" init="3"/>
    <EnumValue name="ID3_FIELD_TYPE_STRING" init="4"/>
    <EnumValue name="ID3_FIELD_TYPE_STRINGFULL" init="5"/>
    <EnumValue name="ID3_FIELD_TYPE_STRINGLIST" init="6"/>
    <EnumValue name="ID3_FIELD_TYPE_LANGUAGE" init="7"/>
    <EnumValue name="ID3_FIELD_TYPE_FRAMEID" init="8"/>
    <EnumValue name="ID3_FIELD_TYPE_DATE" init="9"/>
    <EnumValue name="ID3_FIELD_TYPE_INT8" init="10"/>
    <EnumValue name="ID3_FIELD_TYPE_INT16" init="11"/>
    <EnumValue name="ID3_FIELD_TYPE_INT24" init="12"/>
    <EnumValue name="ID3_FIELD_TYPE_INT32" init="13"/>
    <EnumValue name="ID3_FIELD_TYPE_INT32PLUS" init="14"/>
    <EnumValue name="ID3_FIELD_TYPE_BINARYDATA" init="15"/>
  </Enumeration>
  <FundamentalType id="_242" name="double" size="64" align="64"/>
  <PointerType id="_243" type="_330c" size="64" align="64"/>
  <FundamentalType id="_244" name="float" size="32" align="32"/>
  <FundamentalType id="_245" name="long double" size="128" align="128"/>
  <FundamentalType id="_246" name="bool" size="8" align="8"/>
  <FundamentalType id="_247" name="int" size="32" align="32"/>
  <FundamentalType id="_248" name="long long int" size="64" align="64"/>
  <FundamentalType id="_249" name="complex float" size="64" align="32"/>
  <FundamentalType id="_250" name="complex long double" size="256" align="128"/>
  <PointerType id="_251" type="_230" size="64" align="64"/>
  <PointerType id="_252" type="_89c" size="64" align="64"/>
  <FundamentalType id="_253" name="unsigned int" size="32" align="32"/>
  <PointerType id="_254" type="_174" size="64" align="64"/>
  <PointerType id="_255" type="_187c" size="64" align="64"/>
  <PointerType id="_256" type="_81c" size="64" align="64"/>
  <PointerType id="_257" type="_230c" size="64" align="64"/>
  <FundamentalType id="_258" name="complex double" size="128" align="64"/>
  <PointerType id="_259" type="_166c" size="64" align="64"/>
  <FundamentalType id="_260" name="void" align="8"/>
  <PointerType id="_261" type="_260" size="64" align="64"/>
  <PointerType id="_262" type="_260c" size="64" align="64"/>
  <CvQualifiedType id="_247c" type="_247" const="1"/>
  <PointerType id="_264" type="_74" size="64" align="64"/>
  <PointerType id="_265" type="_247" size="64" align="64"/>
  <PointerType id="_266" type="_124" size="64" align="64"/>
  <FundamentalType id="_267" name="long int" size="64" align="64"/>
  <Field id="_268" name="id" type="_338" offset="0" context="_89" access="public" location="f2:146" file="f2" line="146"/>
  <Field id="_269" name="description" type="_243" offset="64" context="_89" access="public" location="f2:147" file="f2" line="147"/>
  <Field id="_270" name="refcount" type="_253" offset="128" context="_89" access="public" location="f2:148" file="f2" line="148"/>
  <Field id="_271" name="flags" type="_247" offset="160" context="_89" access="public" location="f2:149" file="f2" line="149"/>
  <Field id="_272" name="group_id" type="_247" offset="192" context="_89" access="public" location="f2:150" file="f2" line="150"/>
  <Field id="_273" name="encryption_method" type="_247" offset="224" context="_89" access="public" location="f2:151" file="f2" line="151"/>
  <Field id="_274" name="encoded" type="_286" offset="256" context="_89" access="public" location="f2:152" file="f2" line="152"/>
  <Field id="_275" name="encoded_length" type="_74" offset="320" context="_89" access="public" location="f2:153" file="f2" line="153"/>
  <Field id="_276" name="decoded_length" type="_74" offset="384" context="_89" access="public" location="f2:154" file="f2" line="154"/>
  <Field id="_277" name="nfields" type="_253" offset="448" context="_89" access="public" location="f2:155" file="f2" line="155"/>
  <Field id="_278" name="fields" type="_251" offset="512" context="_89" access="public" location="f2:156" file="f2" line="156"/>
  <Destructor id="_279" name="id3_frame" artificial="1" throw="" context="_89" access="public" mangled="_ZN9id3_frameD1Ev *INTERNAL* " demangled="id3_frame::~id3_frame()" location="f2:145" file="f2" line="145" endline="145" inline="1">
  </Destructor>
  <OperatorMethod id="_280" name="=" returns="_339" artificial="1" throw="" context="_89" access="public" mangled="_ZN9id3_frameaSERKS_" demangled="id3_frame::operator=(id3_frame const&amp;)" location="f2:145" file="f2" line="145" endline="145" inline="1">
    <Argument type="_340" location="f2:145" file="f2" line="145"/>
  </OperatorMethod>
  <Constructor id="_281" name="id3_frame" artificial="1" throw="" context="_89" access="public" mangled="_ZN9id3_frameC1ERKS_ *INTERNAL* " demangled="id3_frame::id3_frame(id3_frame const&amp;)" location="f2:145" file="f2" line="145" endline="145" inline="1">
    <Argument type="_340" location="f2:145" file="f2" line="145"/>
  </Constructor>
  <Constructor id="_282" name="id3_frame" artificial="1" throw="" context="_89" access="public" mangled="_ZN9id3_frameC1Ev *INTERNAL* " demangled="id3_frame::id3_frame()" location="f2:145" file="f2" line="145" inline="1"/>
  <PointerType id="_283" type="_244" size="64" align="64"/>
  <PointerType id="_284" type="_245" size="64" align="64"/>
  <PointerType id="_285" type="_174c" size="64" align="64"/>
  <PointerType id="_286" type="_166" size="64" align="64"/>
  <PointerType id="_287" type="_121c" size="64" align="64"/>
  <PointerType id="_288" type="_89" size="64" align="64"/>
  <ArrayType id="_289" min="0" max="" type="_330" align="8"/>
  <CvQualifiedType id="_289c" type="_289" const="1"/>
  <PointerType id="_291" type="_187" size="64" align="64"/>
  <PointerType id="_292" type="_81" size="64" align="64"/>
  <PointerType id="_293" type="_49c" size="64" align="64"/>
  <PointerType id="_294" type="_49" size="64" align="64"/>
  <Field id="_295" name="refcount" type="_253" offset="0" context="_174" access="public" location="f2:46" file="f2" line="46"/>
  <Field id="_296" name="version" type="_253" offset="32" context="_174" access="public" location="f2:47" file="f2" line="47"/>
  <Field id="_297" name="flags" type="_247" offset="64" context="_174" access="public" location="f2:48" file="f2" line="48"/>
  <Field id="_298" name="extendedflags" type="_247" offset="96" context="_174" access="public" location="f2:49" file="f2" line="49"/>
  <Field id="_299" name="restrictions" type="_247" offset="128" context="_174" access="public" location="f2:50" file="f2" line="50"/>
  <Field id="_300" name="options" type="_247" offset="160" context="_174" access="public" location="f2:51" file="f2" line="51"/>
  <Field id="_301" name="nframes" type="_253" offset="192" context="_174" access="public" location="f2:52" file="f2" line="52"/>
  <Field id="_302" name="frames" type="_344" offset="256" context="_174" access="public" location="f2:53" file="f2" line="53"/>
  <Field id="_303" name="paddedsize" type="_74" offset="320" context="_174" access="public" location="f2:54" file="f2" line="54"/>
  <Destructor id="_304" name="id3_tag" artificial="1" throw="" context="_174" access="public" mangled="_ZN7id3_tagD1Ev *INTERNAL* " demangled="id3_tag::~id3_tag()" location="f2:45" file="f2" line="45" endline="45" inline="1">
  </Destructor>
  <OperatorMethod id="_305" name="=" returns="_345" artificial="1" throw="" context="_174" access="public" mangled="_ZN7id3_tagaSERKS_" demangled="id3_tag::operator=(id3_tag const&amp;)" location="f2:45" file="f2" line="45" endline="45" inline="1">
    <Argument type="_346" location="f2:45" file="f2" line="45"/>
  </OperatorMethod>
  <Constructor id="_306" name="id3_tag" artificial="1" throw="" context="_174" access="public" mangled="_ZN7id3_tagC1ERKS_ *INTERNAL* " demangled="id3_tag::id3_tag(id3_tag const&amp;)" location="f2:45" file="f2" line="45" endline="45" inline="1">
    <Argument type="_346" location="f2:45" file="f2" line="45"/>
  </Constructor>
  <Constructor id="_307" name="id3_tag" artificial="1" throw="" context="_174" access="public" mangled="_ZN7id3_tagC1Ev *INTERNAL* " demangled="id3_tag::id3_tag()" location="f2:45" file="f2" line="45" inline="1"/>
  <PointerType id="_308" type="_124c" size="64" align="64"/>
  <PointerType id="_309" type="_292" size="64" align="64"/>
  <PointerType id="_310" type="_121" size="64" align="64"/>
  <Field id="_311" name="type" type="_241" offset="0" context="_230" access="public" location="f2:206" file="f2" line="206"/>
  <Field id="_312" name="number" type="_319" offset="0" context="_230" access="public" location="f2:210" file="f2" line="210"/>
  <Field id="_313" name="latin1" type="_320" offset="0" context="_230" access="public" location="f2:214" file="f2" line="214"/>
  <Field id="_314" name="latin1list" type="_321" offset="0" context="_230" access="public" location="f2:219" file="f2" line="219"/>
  <Field id="_315" name="string" type="_322" offset="0" context="_230" access="public" location="f2:223" file="f2" line="223"/>
  <Field id="_316" name="stringlist" type="_323" offset="0" context="_230" access="public" location="f2:228" file="f2" line="228"/>
  <Field id="_317" name="immediate" type="_324" offset="0" context="_230" access="public" location="f2:232" file="f2" line="232"/>
  <Field id="_318" name="binary" type="_325" offset="0" context="_230" access="public" location="f2:237" file="f2" line="237"/>
  <Struct id="_319" context="_230" access="public" mangled="N9id3_field3._9E" demangled="id3_field::._9" location="f2:207" file="f2" line="207" artificial="1" size="128" align="64" members="_348 _349 _350 _351 _352 _353 " bases=""/>
  <Struct id="_320" context="_230" access="public" mangled="N9id3_field4._10E" demangled="id3_field::._10" location="f2:211" file="f2" line="211" artificial="1" size="128" align="64" members="_354 _355 _356 _357 _358 _359 " bases=""/>
  <Struct id="_321" context="_230" access="public" mangled="N9id3_field4._11E" demangled="id3_field::._11" location="f2:215" file="f2" line="215" artificial="1" size="128" align="64" members="_360 _361 _362 _363 _364 _365 _366 " bases=""/>
  <Struct id="_322" context="_230" access="public" mangled="N9id3_field4._12E" demangled="id3_field::._12" location="f2:220" file="f2" line="220" artificial="1" size="128" align="64" members="_367 _368 _369 _370 _371 _372 " bases=""/>
  <Struct id="_323" context="_230" access="public" mangled="N9id3_field4._13E" demangled="id3_field::._13" location="f2:224" file="f2" line="224" artificial="1" size="128" align="64" members="_373 _374 _375 _376 _377 _378 _379 " bases=""/>
  <Struct id="_324" context="_230" access="public" mangled="N9id3_field4._14E" demangled="id3_field::._14" location="f2:229" file="f2" line="229" artificial="1" size="128" align="32" members="_380 _381 _382 _383 _384 _385 " bases=""/>
  <Struct id="_325" context="_230" access="public" mangled="N9id3_field4._15E" demangled="id3_field::._15" location="f2:233" file="f2" line="233" artificial="1" size="192" align="64" members="_386 _387 _388 _389 _390 _391 _392 " bases=""/>
  <Destructor id="_326" name="id3_field" artificial="1" throw="" context="_230" access="public" mangled="_ZN9id3_fieldD1Ev *INTERNAL* " demangled="id3_field::~id3_field()" location="f2:205" file="f2" line="205" endline="205" inline="1">
  </Destructor>
  <OperatorMethod id="_327" name="=" returns="_393" artificial="1" throw="" context="_230" access="public" mangled="_ZN9id3_fieldaSERKS_" demangled="id3_field::operator=(id3_field const&amp;)" location="f2:205" file="f2" line="205" endline="205" inline="1">
    <Argument type="_394" location="f2:205" file="f2" line="205"/>
  </OperatorMethod>
  <Constructor id="_328" name="id3_field" artificial="1" throw="" context="_230" access="public" mangled="_ZN9id3_fieldC1ERKS_ *INTERNAL* " demangled="id3_field::id3_field(id3_field const&amp;)" location="f2:205" file="f2" line="205" endline="205" inline="1">
    <Argument type="_394" location="f2:205" file="f2" line="205"/>
  </Constructor>
  <Constructor id="_329" name="id3_field" artificial="1" throw="" context="_230" access="public" mangled="_ZN9id3_fieldC1Ev *INTERNAL* " demangled="id3_field::id3_field()" location="f2:205" file="f2" line="205" inline="1"/>
  <ArrayType id="_338" min="0" max="4u" type="_330" size="40" align="8"/>
  <ReferenceType id="_339" type="_89" size="64" align="64"/>
  <ReferenceType id="_340" type="_89c" size="64" align="64"/>
  <FundamentalType id="_330" name="char" size="8" align="8"/>
  <PointerType id="_344" type="_288" size="64" align="64"/>
  <ReferenceType id="_345" type="_174" size="64" align="64"/>
  <ReferenceType id="_346" type="_174c" size="64" align="64"/>
  <Field id="_348" name="type" type="_241" offset="0" context="_319" access="public" location="f2:208" file="f2" line="208"/>
  <Field id="_349" name="value" type="_267" offset="64" context="_319" access="public" location="f2:209" file="f2" line="209"/>
  <Destructor id="_350" name="._9" artificial="1" throw="" context="_319" access="public" mangled="_ZN9id3_field3._9D1Ev *INTERNAL* " demangled="id3_field::._9::~._9()" location="f2:207" file="f2" line="207" endline="207" inline="1">
  </Destructor>
  <OperatorMethod id="_351" name="=" returns="_395" artificial="1" throw="" context="_319" access="public" mangled="_ZN9id3_field3._9aSERKS0_" demangled="id3_field::._9::operator=(id3_field::._9 const&amp;)" location="f2:207" file="f2" line="207" endline="207" inline="1">
    <Argument type="_396" location="f2:207" file="f2" line="207"/>
  </OperatorMethod>
  <Constructor id="_352" artificial="1" throw="" context="_319" access="public" mangled="_ZN9id3_field3._9C1ERKS0_ *INTERNAL* " demangled="id3_field::._9::._9(id3_field::._9 const&amp;)" location="f2:207" file="f2" line="207" endline="207" inline="1">
    <Argument type="_396" location="f2:207" file="f2" line="207"/>
  </Constructor>
  <Constructor id="_353" artificial="1" throw="" context="_319" access="public" mangled="_ZN9id3_field3._9C1Ev *INTERNAL* " demangled="id3_field::._9::._9()" location="f2:207" file="f2" line="207" inline="1"/>
  <Field id="_354" name="type" type="_241" offset="0" context="_320" access="public" location="f2:212" file="f2" line="212"/>
  <Field id="_355" name="ptr" type="_310" offset="64" context="_320" access="public" location="f2:213" file="f2" line="213"/>
  <Destructor id="_356" name="._10" artificial="1" throw="" context="_320" access="public" mangled="_ZN9id3_field4._10D1Ev *INTERNAL* " demangled="id3_field::._10::~._10()" location="f2:211" file="f2" line="211" endline="211" inline="1">
  </Destructor>
  <OperatorMethod id="_357" name="=" returns="_397" artificial="1" throw="" context="_320" access="public" mangled="_ZN9id3_field4._10aSERKS0_" demangled="id3_field::._10::operator=(id3_field::._10 const&amp;)" location="f2:211" file="f2" line="211" endline="211" inline="1">
    <Argument type="_398" location="f2:211" file="f2" line="211"/>
  </OperatorMethod>
  <Constructor id="_358" artificial="1" throw="" context="_320" access="public" mangled="_ZN9id3_field4._10C1ERKS0_ *INTERNAL* " demangled="id3_field::._10::._10(id3_field::._10 const&amp;)" location="f2:211" file="f2" line="211" endline="211" inline="1">
    <Argument type="_398" location="f2:211" file="f2" line="211"/>
  </Constructor>
  <Constructor id="_359" artificial="1" throw="" context="_320" access="public" mangled="_ZN9id3_field4._10C1Ev *INTERNAL* " demangled="id3_field::._10::._10()" location="f2:211" file="f2" line="211" inline="1"/>
  <Field id="_360" name="type" type="_241" offset="0" context="_321" access="public" location="f2:216" file="f2" line="216"/>
  <Field id="_361" name="nstrings" type="_253" offset="32" context="_321" access="public" location="f2:217" file="f2" line="217"/>
  <Field id="_362" name="strings" type="_399" offset="64" context="_321" access="public" location="f2:218" file="f2" line="218"/>
  <Destructor id="_363" name="._11" artificial="1" throw="" context="_321" access="public" mangled="_ZN9id3_field4._11D1Ev *INTERNAL* " demangled="id3_field::._11::~._11()" location="f2:215" file="f2" line="215" endline="215" inline="1">
  </Destructor>
  <OperatorMethod id="_364" name="=" returns="_400" artificial="1" throw="" context="_321" access="public" mangled="_ZN9id3_field4._11aSERKS0_" demangled="id3_field::._11::operator=(id3_field::._11 const&amp;)" location="f2:215" file="f2" line="215" endline="215" inline="1">
    <Argument type="_401" location="f2:215" file="f2" line="215"/>
  </OperatorMethod>
  <Constructor id="_365" artificial="1" throw="" context="_321" access="public" mangled="_ZN9id3_field4._11C1ERKS0_ *INTERNAL* " demangled="id3_field::._11::._11(id3_field::._11 const&amp;)" location="f2:215" file="f2" line="215" endline="215" inline="1">
    <Argument type="_401" location="f2:215" file="f2" line="215"/>
  </Constructor>
  <Constructor id="_366" artificial="1" throw="" context="_321" access="public" mangled="_ZN9id3_field4._11C1Ev *INTERNAL* " demangled="id3_field::._11::._11()" location="f2:215" file="f2" line="215" inline="1"/>
  <Field id="_367" name="type" type="_241" offset="0" context="_322" access="public" location="f2:221" file="f2" line="221"/>
  <Field id="_368" name="ptr" type="_292" offset="64" context="_322" access="public" location="f2:222" file="f2" line="222"/>
  <Destructor id="_369" name="._12" artificial="1" throw="" context="_322" access="public" mangled="_ZN9id3_field4._12D1Ev *INTERNAL* " demangled="id3_field::._12::~._12()" location="f2:220" file="f2" line="220" endline="220" inline="1">
  </Destructor>
  <OperatorMethod id="_370" name="=" returns="_402" artificial="1" throw="" context="_322" access="public" mangled="_ZN9id3_field4._12aSERKS0_" demangled="id3_field::._12::operator=(id3_field::._12 const&amp;)" location="f2:220" file="f2" line="220" endline="220" inline="1">
    <Argument type="_403" location="f2:220" file="f2" line="220"/>
  </OperatorMethod>
  <Constructor id="_371" artificial="1" throw="" context="_322" access="public" mangled="_ZN9id3_field4._12C1ERKS0_ *INTERNAL* " demangled="id3_field::._12::._12(id3_field::._12 const&amp;)" location="f2:220" file="f2" line="220" endline="220" inline="1">
    <Argument type="_403" location="f2:220" file="f2" line="220"/>
  </Constructor>
  <Constructor id="_372" artificial="1" throw="" context="_322" access="public" mangled="_ZN9id3_field4._12C1Ev *INTERNAL* " demangled="id3_field::._12::._12()" location="f2:220" file="f2" line="220" inline="1"/>
  <Field id="_373" name="type" type="_241" offset="0" context="_323" access="public" location="f2:225" file="f2" line="225"/>
  <Field id="_374" name="nstrings" type="_253" offset="32" context="_323" access="public" location="f2:226" file="f2" line="226"/>
  <Field id="_375" name="strings" type="_309" offset="64" context="_323" access="public" location="f2:227" file="f2" line="227"/>
  <Destructor id="_376" name="._13" artificial="1" throw="" context="_323" access="public" mangled="_ZN9id3_field4._13D1Ev *INTERNAL* " demangled="id3_field::._13::~._13()" location="f2:224" file="f2" line="224" endline="224" inline="1">
  </Destructor>
  <OperatorMethod id="_377" name="=" returns="_404" artificial="1" throw="" context="_323" access="public" mangled="_ZN9id3_field4._13aSERKS0_" demangled="id3_field::._13::operator=(id3_field::._13 const&amp;)" location="f2:224" file="f2" line="224" endline="224" inline="1">
    <Argument type="_405" location="f2:224" file="f2" line="224"/>
  </OperatorMethod>
  <Constructor id="_378" artificial="1" throw="" context="_323" access="public" mangled="_ZN9id3_field4._13C1ERKS0_ *INTERNAL* " demangled="id3_field::._13::._13(id3_field::._13 const&amp;)" location="f2:224" file="f2" line="224" endline="224" inline="1">
    <Argument type="_405" location="f2:224" file="f2" line="224"/>
  </Constructor>
  <Constructor id="_379" artificial="1" throw="" context="_323" access="public" mangled="_ZN9id3_field4._13C1Ev *INTERNAL* " demangled="id3_field::._13::._13()" location="f2:224" file="f2" line="224" inline="1"/>
  <Field id="_380" name="type" type="_241" offset="0" context="_324" access="public" location="f2:230" file="f2" line="230"/>
  <Field id="_381" name="value" type="_406" offset="32" context="_324" access="public" location="f2:231" file="f2" line="231"/>
  <Destructor id="_382" name="._14" artificial="1" throw="" context="_324" access="public" mangled="_ZN9id3_field4._14D1Ev *INTERNAL* " demangled="id3_field::._14::~._14()" location="f2:229" file="f2" line="229" endline="229" inline="1">
  </Destructor>
  <OperatorMethod id="_383" name="=" returns="_407" artificial="1" throw="" context="_324" access="public" mangled="_ZN9id3_field4._14aSERKS0_" demangled="id3_field::._14::operator=(id3_field::._14 const&amp;)" location="f2:229" file="f2" line="229" endline="229" inline="1">
    <Argument type="_408" location="f2:229" file="f2" line="229"/>
  </OperatorMethod>
  <Constructor id="_384" artificial="1" throw="" context="_324" access="public" mangled="_ZN9id3_field4._14C1ERKS0_ *INTERNAL* " demangled="id3_field::._14::._14(id3_field::._14 const&amp;)" location="f2:229" file="f2" line="229" endline="229" inline="1">
    <Argument type="_408" location="f2:229" file="f2" line="229"/>
  </Constructor>
  <Constructor id="_385" artificial="1" throw="" context="_324" access="public" mangled="_ZN9id3_field4._14C1Ev *INTERNAL* " demangled="id3_field::._14::._14()" location="f2:229" file="f2" line="229" inline="1"/>
  <Field id="_386" name="type" type="_241" offset="0" context="_325" access="public" location="f2:234" file="f2" line="234"/>
  <Field id="_387" name="data" type="_286" offset="64" context="_325" access="public" location="f2:235" file="f2" line="235"/>
  <Field id="_388" name="length" type="_74" offset="128" context="_325" access="public" location="f2:236" file="f2" line="236"/>
  <Destructor id="_389" name="._15" artificial="1" throw="" context="_325" access="public" mangled="_ZN9id3_field4._15D1Ev *INTERNAL* " demangled="id3_field::._15::~._15()" location="f2:233" file="f2" line="233" endline="233" inline="1">
  </Destructor>
  <OperatorMethod id="_390" name="=" returns="_409" artificial="1" throw="" context="_325" access="public" mangled="_ZN9id3_field4._15aSERKS0_" demangled="id3_field::._15::operator=(id3_field::._15 const&amp;)" location="f2:233" file="f2" line="233" endline="233" inline="1">
    <Argument type="_410" location="f2:233" file="f2" line="233"/>
  </OperatorMethod>
  <Constructor id="_391" artificial="1" throw="" context="_325" access="public" mangled="_ZN9id3_field4._15C1ERKS0_ *INTERNAL* " demangled="id3_field::._15::._15(id3_field::._15 const&amp;)" location="f2:233" file="f2" line="233" endline="233" inline="1">
    <Argument type="_410" location="f2:233" file="f2" line="233"/>
  </Constructor>
  <Constructor id="_392" artificial="1" throw="" context="_325" access="public" mangled="_ZN9id3_field4._15C1Ev *INTERNAL* " demangled="id3_field::._15::._15()" location="f2:233" file="f2" line="233" inline="1"/>
  <ReferenceType id="_393" type="_230" size="64" align="64"/>
  <ReferenceType id="_394" type="_230c" size="64" align="64"/>
  <ReferenceType id="_395" type="_319" size="64" align="64"/>
  <ReferenceType id="_396" type="_319c" size="64" align="64"/>
  <ReferenceType id="_397" type="_320" size="64" align="64"/>
  <ReferenceType id="_398" type="_320c" size="64" align="64"/>
  <PointerType id="_399" type="_310" size="64" align="64"/>
  <ReferenceType id="_400" type="_321" size="64" align="64"/>
  <ReferenceType id="_401" type="_321c" size="64" align="64"/>
  <ReferenceType id="_402" type="_322" size="64" align="64"/>
  <ReferenceType id="_403" type="_322c" size="64" align="64"/>
  <ReferenceType id="_404" type="_323" size="64" align="64"/>
  <ReferenceType id="_405" type="_323c" size="64" align="64"/>
  <ArrayType id="_406" min="0" max="8u" type="_330" size="72" align="8"/>
  <ReferenceType id="_407" type="_324" size="64" align="64"/>
  <ReferenceType id="_408" type="_324c" size="64" align="64"/>
  <ReferenceType id="_409" type="_325" size="64" align="64"/>
  <ReferenceType id="_410" type="_325c" size="64" align="64"/>
  <CvQualifiedType id="_330c" type="_330" const="1"/>
  <CvQualifiedType id="_260c" type="_260" const="1"/>
  <CvQualifiedType id="_174c" type="_174" const="1"/>
  <CvQualifiedType id="_89c" type="_89" const="1"/>
  <CvQualifiedType id="_319c" type="_319" const="1"/>
  <CvQualifiedType id="_320c" type="_320" const="1"/>
  <CvQualifiedType id="_321c" type="_321" const="1"/>
  <CvQualifiedType id="_322c" type="_322" const="1"/>
  <CvQualifiedType id="_323c" type="_323" const="1"/>
  <CvQualifiedType id="_324c" type="_324" const="1"/>
  <CvQualifiedType id="_325c" type="_325" const="1"/>
  <CvQualifiedType id="_230c" type="_230" const="1"/>
  <CvQualifiedType id="_187c" type="_187" const="1"/>
  <CvQualifiedType id="_166c" type="_166" const="1"/>
  <CvQualifiedType id="_81c" type="_81" const="1"/>
  <CvQualifiedType id="_121c" type="_121" const="1"/>
  <CvQualifiedType id="_49c" type="_49" const="1"/>
  <CvQualifiedType id="_124c" type="_124" const="1"/>
  <File id="f0" name="/usr/share/gccxml-0.9/GCC/4.8/gccxml_builtins.h"/>
  <File id="f1" name="/tmp/tmp_eZcOS.cpp"/>
  <File id="f2" name="/usr/include/id3tag.h"/>
  <CPP_DUMP name="functions"><![CDATA[ID3_TAG_VERSION_MAJOR(x) (((x) >> 8) & 0xff)
ID3_TAG_VERSION_MINOR(x) (((x) >> 0) & 0xff)
ID3_VERSION_STRING(num) ID3_VERSION_STRINGIZE(num)
ID3_VERSION_STRINGIZE(str) #str
]]></CPP_DUMP>
  <CPP_DUMP name="aliases"><![CDATA[]]></CPP_DUMP>
  <CPP_DUMP name="excluded"><![CDATA[]]></CPP_DUMP>
</GCC_XML>
