<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Variable id="_734" name="cpp_sym_____mbstate_t_defined" type="_311c" init="1" context="_1" location="f2:54" file="f2" line="54" static="1"/>
  <Function id="_735" name="lame_encode_buffer_long2" returns="_311" context="_1" location="f1:819" file="f1" line="819" extern="1">
    <Argument name="gfp" type="_674" location="f1:819" file="f1" line="819"/>
    <Argument name="buffer_l" type="_859" location="f1:819" file="f1" line="819"/>
    <Argument name="buffer_r" type="_859" location="f1:819" file="f1" line="819"/>
    <Argument name="nsamples" type="_311c" location="f1:819" file="f1" line="819"/>
    <Argument name="mp3buf" type="_771" location="f1:819" file="f1" line="819"/>
    <Argument name="mp3buf_size" type="_311c" location="f1:819" file="f1" line="819"/>
  </Function>
  <Variable id="_736" name="cpp_sym__IOS_NOREPLACE" type="_311c" init="64" context="_1" location="f2:65" file="f2" line="65" static="1"/>
  <Variable id="_737" name="cpp_sym__IO_HEX" type="_311c" init="64" context="_1" location="f2:83" file="f2" line="83" static="1"/>
  <Variable id="_738" name="cpp_sym___GNU_LIBRARY__" type="_311c" init="6" context="_1" location="f2:6" file="f2" line="6" static="1"/>
  <Function id="_739" name="__fread_unlocked_chk" returns="_504" context="_1" location="f4:329" file="f4" line="329" extern="1" attributes="__warn_unused_result__">
    <Argument name="__ptr" type="_599r" location="f4:329" file="f4" line="329"/>
    <Argument name="__ptrlen" type="_504" location="f4:329" file="f4" line="329"/>
    <Argument name="__size" type="_504" location="f4:329" file="f4" line="329"/>
    <Argument name="__n" type="_504" location="f4:329" file="f4" line="329"/>
    <Argument name="__stream" type="_763r" location="f4:329" file="f4" line="329"/>
  </Function>
  <Function id="_740" name="lame_set_write_id3tag_automatic" returns="_66" context="_1" location="f1:1246" file="f1" line="1246" extern="1">
    <Argument name="gfp" type="_674" location="f1:1246" file="f1" line="1246"/>
    <Argument type="_311" location="f1:1246" file="f1" line="1246"/>
  </Function>
  <Function id="_741" name="lame_get_original" returns="_311" context="_1" location="f1:373" file="f1" line="373" extern="1">
    <Argument type="_766" location="f1:373" file="f1" line="373"/>
  </Function>
  <Function id="_742" name="__builtin_sinf" returns="_759" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_759" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_743" name="__builtin_sinh" returns="_757" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_757" location="f0:77" file="f0" line="77"/>
  </Function>
  <Typedef id="_744" name="__io_read_fn" type="_381" context="_1" location="f6:338" file="f6" line="338"/>
  <Function id="_745" name="__builtin_sinl" returns="_760" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_760" location="f0:80" file="f0" line="80"/>
  </Function>
  <Function id="_746" name="__builtin_csin" returns="_790" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_790" location="f0:115" file="f0" line="115"/>
  </Function>
  <Typedef id="_747" name="__clock_t" type="_83" context="_1" location="f7:135" file="f7" line="135"/>
  <Function id="_748" name="_IO_vfscanf" returns="_311" context="_1" location="f6:465" file="f6" line="465" extern="1">
    <Argument type="_772r" location="f6:465" file="f6" line="465"/>
    <Argument type="_758r" location="f6:465" file="f6" line="465"/>
    <Argument type="_765" location="f6:465" file="f6" line="465"/>
    <Argument type="_827r" location="f6:465" file="f6" line="465"/>
  </Function>
  <Function id="_749" name="id3tag_add_v2" returns="_66" context="_1" location="f1:1183" file="f1" line="1183" extern="1">
    <Argument name="gfp" type="_675" location="f1:1183" file="f1" line="1183"/>
  </Function>
  <Variable id="_750" name="cpp_sym__POSIX_SOURCE" type="_311c" init="1" context="_1" location="f2:30" file="f2" line="30" static="1"/>
  <Function id="_751" name="_IO_ftrylockfile" returns="_311" throw="" context="_1" location="f6:447" file="f6" line="447" extern="1">
    <Argument type="_772" location="f6:447" file="f6" line="447"/>
  </Function>
  <Typedef id="_752" name="__int32_t" type="_311" context="_1" location="f7:40" file="f7" line="40"/>
  <Typedef id="_753" name="__io_write_fn" type="_178" context="_1" location="f6:347" file="f6" line="347"/>
  <Variable id="_754" name="cpp_sym__IO_IN_BACKUP" type="_311c" init="256" context="_1" location="f2:64" file="f2" line="64" static="1"/>
  <PointerType id="_755" type="_919" size="64" align="64"/>
  <Typedef id="_756" name="__caddr_t" type="_755" context="_1" location="f7:183" file="f7" line="183"/>
  <FundamentalType id="_757" name="double" size="64" align="64"/>
  <PointerType id="_758" type="_919c" size="64" align="64"/>
  <FundamentalType id="_759" name="float" size="32" align="32"/>
  <FundamentalType id="_760" name="long double" size="128" align="128"/>
  <CvQualifiedType id="_311c" type="_311" const="1"/>
  <FundamentalType id="_762" name="bool" size="8" align="8"/>
  <PointerType id="_763" type="_431" size="64" align="64"/>
  <CvQualifiedType id="_758r" type="_758" restrict="1"/>
  <PointerType id="_765" type="_839" size="64" align="64"/>
  <PointerType id="_766" type="_187c" size="64" align="64"/>
  <FundamentalType id="_767" name="long long int" size="64" align="64"/>
  <FundamentalType id="_768" name="complex float" size="64" align="32"/>
  <FundamentalType id="_769" name="complex long double" size="256" align="128"/>
  <PointerType id="_770" type="_93c" size="64" align="64"/>
  <PointerType id="_771" type="_517" size="64" align="64"/>
  <PointerType id="_772" type="_93" size="64" align="64"/>
  <CvQualifiedType id="_755r" type="_755" restrict="1"/>
  <Field id="_774" name="read" type="_923" offset="0" context="_44" access="public" location="f6:371" file="f6" line="371"/>
  <Field id="_775" name="write" type="_924" offset="64" context="_44" access="public" location="f6:372" file="f6" line="372"/>
  <Field id="_776" name="seek" type="_925" offset="128" context="_44" access="public" location="f6:373" file="f6" line="373"/>
  <Field id="_777" name="close" type="_926" offset="192" context="_44" access="public" location="f6:374" file="f6" line="374"/>
  <Destructor id="_778" name="._5" artificial="1" throw="" context="_44" access="public" mangled="_ZN25_IO_cookie_io_functions_tD1Ev *INTERNAL* " demangled="_IO_cookie_io_functions_t::~_IO_cookie_io_functions_t()" location="f6:375" file="f6" line="375" endline="375" inline="1">
  </Destructor>
  <OperatorMethod id="_779" name="=" returns="_927" artificial="1" throw="" context="_44" access="public" mangled="_ZN25_IO_cookie_io_functions_taSERKS_" demangled="_IO_cookie_io_functions_t::operator=(_IO_cookie_io_functions_t const&amp;)" location="f6:375" file="f6" line="375" endline="375" inline="1">
    <Argument type="_928" location="f6:370" file="f6" line="370"/>
  </OperatorMethod>
  <Constructor id="_780" name="._5" artificial="1" throw="" context="_44" access="public" mangled="_ZN25_IO_cookie_io_functions_tC1ERKS_ *INTERNAL* " demangled="_IO_cookie_io_functions_t::_IO_cookie_io_functions_t(_IO_cookie_io_functions_t const&amp;)" location="f6:375" file="f6" line="375" endline="375" inline="1">
    <Argument type="_928" location="f6:370" file="f6" line="370"/>
  </Constructor>
  <Constructor id="_781" name="._5" artificial="1" throw="" context="_44" access="public" mangled="_ZN25_IO_cookie_io_functions_tC1Ev *INTERNAL* " demangled="_IO_cookie_io_functions_t::_IO_cookie_io_functions_t()" location="f6:375" file="f6" line="375" inline="1"/>
  <PointerType id="_782" type="_103" size="64" align="64"/>
  <PointerType id="_783" type="_461" size="64" align="64"/>
  <PointerType id="_784" type="_43" size="64" align="64"/>
  <CvQualifiedType id="_784r" type="_784" restrict="1"/>
  <CvQualifiedType id="_763r" type="_763" restrict="1"/>
  <PointerType id="_787" type="_755" size="64" align="64"/>
  <CvQualifiedType id="_787r" type="_787" restrict="1"/>
  <CvQualifiedType id="_599r" type="_599" restrict="1"/>
  <FundamentalType id="_790" name="complex double" size="128" align="64"/>
  <PointerType id="_791" type="_311c" size="64" align="64"/>
  <PointerType id="_792" type="_504" size="64" align="64"/>
  <CvQualifiedType id="_792r" type="_792" restrict="1"/>
  <Field id="_794" name="_flags" type="_311" offset="0" context="_93" access="public" location="f6:246" file="f6" line="246"/>
  <Field id="_795" name="_IO_read_ptr" type="_755" offset="64" context="_93" access="public" location="f6:251" file="f6" line="251"/>
  <Field id="_796" name="_IO_read_end" type="_755" offset="128" context="_93" access="public" location="f6:252" file="f6" line="252"/>
  <Field id="_797" name="_IO_read_base" type="_755" offset="192" context="_93" access="public" location="f6:253" file="f6" line="253"/>
  <Field id="_798" name="_IO_write_base" type="_755" offset="256" context="_93" access="public" location="f6:254" file="f6" line="254"/>
  <Field id="_799" name="_IO_write_ptr" type="_755" offset="320" context="_93" access="public" location="f6:255" file="f6" line="255"/>
  <Field id="_800" name="_IO_write_end" type="_755" offset="384" context="_93" access="public" location="f6:256" file="f6" line="256"/>
  <Field id="_801" name="_IO_buf_base" type="_755" offset="448" context="_93" access="public" location="f6:257" file="f6" line="257"/>
  <Field id="_802" name="_IO_buf_end" type="_755" offset="512" context="_93" access="public" location="f6:258" file="f6" line="258"/>
  <Field id="_803" name="_IO_save_base" type="_755" offset="576" context="_93" access="public" location="f6:260" file="f6" line="260"/>
  <Field id="_804" name="_IO_backup_base" type="_755" offset="640" context="_93" access="public" location="f6:261" file="f6" line="261"/>
  <Field id="_805" name="_IO_save_end" type="_755" offset="704" context="_93" access="public" location="f6:262" file="f6" line="262"/>
  <Field id="_806" name="_markers" type="_929" offset="768" context="_93" access="public" location="f6:264" file="f6" line="264"/>
  <Field id="_807" name="_chain" type="_772" offset="832" context="_93" access="public" location="f6:266" file="f6" line="266"/>
  <Field id="_808" name="_fileno" type="_311" offset="896" context="_93" access="public" location="f6:268" file="f6" line="268"/>
  <Field id="_809" name="_flags2" type="_311" offset="928" context="_93" access="public" location="f6:272" file="f6" line="272"/>
  <Field id="_810" name="_old_offset" type="_470" offset="960" context="_93" access="public" location="f6:274" file="f6" line="274"/>
  <Field id="_811" name="_cur_column" type="_157" offset="1024" context="_93" access="public" location="f6:278" file="f6" line="278"/>
  <Field id="_812" name="_vtable_offset" type="_248" offset="1040" context="_93" access="public" location="f6:279" file="f6" line="279"/>
  <Field id="_813" name="_shortbuf" type="_930" offset="1048" context="_93" access="public" location="f6:280" file="f6" line="280"/>
  <Field id="_814" name="_lock" type="_931" offset="1088" context="_93" access="public" location="f6:284" file="f6" line="284"/>
  <Field id="_815" name="_offset" type="_603" offset="1152" context="_93" access="public" location="f6:293" file="f6" line="293"/>
  <Field id="_816" name="__pad1" type="_599" offset="1216" context="_93" access="public" location="f6:302" file="f6" line="302"/>
  <Field id="_817" name="__pad2" type="_599" offset="1280" context="_93" access="public" location="f6:303" file="f6" line="303"/>
  <Field id="_818" name="__pad3" type="_599" offset="1344" context="_93" access="public" location="f6:304" file="f6" line="304"/>
  <Field id="_819" name="__pad4" type="_599" offset="1408" context="_93" access="public" location="f6:305" file="f6" line="305"/>
  <Field id="_820" name="__pad5" type="_504" offset="1472" context="_93" access="public" location="f6:306" file="f6" line="306"/>
  <Field id="_821" name="_mode" type="_311" offset="1536" context="_93" access="public" location="f6:308" file="f6" line="308"/>
  <Field id="_822" name="_unused2" type="_932" offset="1568" context="_93" access="public" location="f6:310" file="f6" line="310"/>
  <Destructor id="_823" name="_IO_FILE" artificial="1" throw="" context="_93" access="public" mangled="_ZN8_IO_FILED1Ev *INTERNAL* " demangled="_IO_FILE::~_IO_FILE()" location="f6:245" file="f6" line="245" endline="245" inline="1">
  </Destructor>
  <OperatorMethod id="_824" name="=" returns="_933" artificial="1" throw="" context="_93" access="public" mangled="_ZN8_IO_FILEaSERKS_" demangled="_IO_FILE::operator=(_IO_FILE const&amp;)" location="f6:245" file="f6" line="245" endline="245" inline="1">
    <Argument type="_934" location="f6:245" file="f6" line="245"/>
  </OperatorMethod>
  <Constructor id="_825" name="_IO_FILE" artificial="1" throw="" context="_93" access="public" mangled="_ZN8_IO_FILEC1ERKS_ *INTERNAL* " demangled="_IO_FILE::_IO_FILE(_IO_FILE const&amp;)" location="f6:245" file="f6" line="245" endline="245" inline="1">
    <Argument type="_934" location="f6:245" file="f6" line="245"/>
  </Constructor>
  <Constructor id="_826" name="_IO_FILE" artificial="1" throw="" context="_93" access="public" mangled="_ZN8_IO_FILEC1Ev *INTERNAL* " demangled="_IO_FILE::_IO_FILE()" location="f6:245" file="f6" line="245" inline="1"/>
  <PointerType id="_827" type="_311" size="64" align="64"/>
  <PointerType id="_828" type="_759c" size="64" align="64"/>
  <PointerType id="_829" type="_157c" size="64" align="64"/>
  <PointerType id="_831" type="_66c" size="64" align="64"/>
  <CvQualifiedType id="_831r" type="_831" restrict="1"/>
  <Field id="_833" name="__pos" type="_470" offset="0" context="_208" access="public" location="f8:23" file="f8" line="23"/>
  <Field id="_834" name="__state" type="_346" offset="64" context="_208" access="public" location="f8:24" file="f8" line="24"/>
  <Destructor id="_835" name="._3" artificial="1" throw="" context="_208" access="public" mangled="_ZN9_G_fpos_tD1Ev *INTERNAL* " demangled="_G_fpos_t::~_G_fpos_t()" location="f8:25" file="f8" line="25" endline="25" inline="1">
  </Destructor>
  <OperatorMethod id="_836" name="=" returns="_938" artificial="1" throw="" context="_208" access="public" mangled="_ZN9_G_fpos_taSERKS_" demangled="_G_fpos_t::operator=(_G_fpos_t const&amp;)" location="f8:25" file="f8" line="25" endline="25" inline="1">
    <Argument type="_939" location="f8:22" file="f8" line="22"/>
  </OperatorMethod>
  <Constructor id="_837" name="._3" artificial="1" throw="" context="_208" access="public" mangled="_ZN9_G_fpos_tC1ERKS_ *INTERNAL* " demangled="_G_fpos_t::_G_fpos_t(_G_fpos_t const&amp;)" location="f8:25" file="f8" line="25" endline="25" inline="1">
    <Argument type="_939" location="f8:22" file="f8" line="22"/>
  </Constructor>
  <Constructor id="_838" name="._3" artificial="1" throw="" context="_208" access="public" mangled="_ZN9_G_fpos_tC1Ev *INTERNAL* " demangled="_G_fpos_t::_G_fpos_t()" location="f8:25" file="f8" line="25" inline="1"/>
  <Struct id="_839" name="__va_list_tag" context="_1" mangled="13__va_list_tag" demangled="__va_list_tag" location="f13:0" file="f13" line="0" size="192" align="64" members=""/>
  <CvQualifiedType id="_73c" type="_73" const="1"/>
  <PointerType id="_841" type="_940" size="64" align="64"/>
  <ArrayType id="_842" min="0" max="" type="_758" align="64"/>
  <CvQualifiedType id="_842c" type="_842" const="1"/>
  <PointerType id="_844" type="_621" size="64" align="64"/>
  <CvQualifiedType id="_844r" type="_844" restrict="1"/>
  <ArrayType id="_846" min="0" max="2u" type="_941" size="384" align="32"/>
  <CvQualifiedType id="_846c" type="_846" const="1"/>
  <Field id="_848" name="__pos" type="_603" offset="0" context="_267" access="public" location="f8:28" file="f8" line="28"/>
  <Field id="_849" name="__state" type="_346" offset="64" context="_267" access="public" location="f8:29" file="f8" line="29"/>
  <Destructor id="_850" name="._4" artificial="1" throw="" context="_267" access="public" mangled="_ZN11_G_fpos64_tD1Ev *INTERNAL* " demangled="_G_fpos64_t::~_G_fpos64_t()" location="f8:30" file="f8" line="30" endline="30" inline="1">
  </Destructor>
  <OperatorMethod id="_851" name="=" returns="_942" artificial="1" throw="" context="_267" access="public" mangled="_ZN11_G_fpos64_taSERKS_" demangled="_G_fpos64_t::operator=(_G_fpos64_t const&amp;)" location="f8:30" file="f8" line="30" endline="30" inline="1">
    <Argument type="_943" location="f8:27" file="f8" line="27"/>
  </OperatorMethod>
  <Constructor id="_852" name="._4" artificial="1" throw="" context="_267" access="public" mangled="_ZN11_G_fpos64_tC1ERKS_ *INTERNAL* " demangled="_G_fpos64_t::_G_fpos64_t(_G_fpos64_t const&amp;)" location="f8:30" file="f8" line="30" endline="30" inline="1">
    <Argument type="_943" location="f8:27" file="f8" line="27"/>
  </Constructor>
  <Constructor id="_853" name="._4" artificial="1" throw="" context="_267" access="public" mangled="_ZN11_G_fpos64_tC1Ev *INTERNAL* " demangled="_G_fpos64_t::_G_fpos64_t()" location="f8:30" file="f8" line="30" inline="1"/>
  <PointerType id="_854" type="_759" size="64" align="64"/>
  <PointerType id="_855" type="_760" size="64" align="64"/>
  <CvQualifiedType id="_83c" type="_83" const="1"/>
  <PointerType id="_857" type="_103c" size="64" align="64"/>
  <PointerType id="_858" type="_460" size="64" align="64"/>
  <PointerType id="_859" type="_83c" size="64" align="64"/>
  <Field id="_860" name="__count" type="_311" offset="0" context="_346" access="public" location="f11:84" file="f11" line="84"/>
  <Field id="_861" name="__value" type="_862" offset="32" context="_346" access="public" location="f11:93" file="f11" line="93"/>
  <Union id="_862" context="_346" access="public" mangled="N11__mbstate_t3._2E" demangled="__mbstate_t::._2" location="f11:86" file="f11" line="86" artificial="1" size="32" align="32" members="_945 _946 _947 _948 _949 _950 " bases=""/>
  <Destructor id="_863" name="._1" artificial="1" throw="" context="_346" access="public" mangled="_ZN11__mbstate_tD1Ev *INTERNAL* " demangled="__mbstate_t::~__mbstate_t()" location="f11:94" file="f11" line="94" endline="94" inline="1">
  </Destructor>
  <OperatorMethod id="_864" name="=" returns="_951" artificial="1" throw="" context="_346" access="public" mangled="_ZN11__mbstate_taSERKS_" demangled="__mbstate_t::operator=(__mbstate_t const&amp;)" location="f11:94" file="f11" line="94" endline="94" inline="1">
    <Argument type="_952" location="f11:83" file="f11" line="83"/>
  </OperatorMethod>
  <Constructor id="_865" name="._1" artificial="1" throw="" context="_346" access="public" mangled="_ZN11__mbstate_tC1ERKS_ *INTERNAL* " demangled="__mbstate_t::__mbstate_t(__mbstate_t const&amp;)" location="f11:94" file="f11" line="94" endline="94" inline="1">
    <Argument type="_952" location="f11:83" file="f11" line="83"/>
  </Constructor>
  <Constructor id="_866" name="._1" artificial="1" throw="" context="_346" access="public" mangled="_ZN11__mbstate_tC1Ev *INTERNAL* " demangled="__mbstate_t::__mbstate_t()" location="f11:94" file="f11" line="94" inline="1"/>
  <PointerType id="_867" type="_621c" size="64" align="64"/>
  <CvQualifiedType id="_772r" type="_772" restrict="1"/>
  <PointerType id="_869" type="_954" size="64" align="64"/>
  <PointerType id="_870" type="_268c" size="64" align="64"/>
  <PointerType id="_871" type="_757c" size="64" align="64"/>
  <Field id="_872" name="__val" type="_957" offset="0" context="_459" access="public" location="f7:134" file="f7" line="134"/>
  <Destructor id="_873" name="._0" artificial="1" throw="" context="_459" access="public" mangled="_ZN8__fsid_tD1Ev *INTERNAL* " demangled="__fsid_t::~__fsid_t()" location="f7:134" file="f7" line="134" endline="134" inline="1">
  </Destructor>
  <OperatorMethod id="_874" name="=" returns="_958" artificial="1" throw="" context="_459" access="public" mangled="_ZN8__fsid_taSERKS_" demangled="__fsid_t::operator=(__fsid_t const&amp;)" location="f7:134" file="f7" line="134" endline="134" inline="1">
    <Argument type="_959" location="f7:134" file="f7" line="134"/>
  </OperatorMethod>
  <Constructor id="_875" name="._0" artificial="1" throw="" context="_459" access="public" mangled="_ZN8__fsid_tC1ERKS_ *INTERNAL* " demangled="__fsid_t::__fsid_t(__fsid_t const&amp;)" location="f7:134" file="f7" line="134" endline="134" inline="1">
    <Argument type="_959" location="f7:134" file="f7" line="134"/>
  </Constructor>
  <Constructor id="_876" name="._0" artificial="1" throw="" context="_459" access="public" mangled="_ZN8__fsid_tC1Ev *INTERNAL* " demangled="__fsid_t::__fsid_t()" location="f7:134" file="f7" line="134" inline="1"/>
  <Field id="_877" name="major" type="_311" offset="0" context="_460" access="public" location="f1:657" file="f1" line="657"/>
  <Field id="_878" name="minor" type="_311" offset="32" context="_460" access="public" location="f1:658" file="f1" line="658"/>
  <Field id="_879" name="alpha" type="_311" offset="64" context="_460" access="public" location="f1:659" file="f1" line="659"/>
  <Field id="_880" name="beta" type="_311" offset="96" context="_460" access="public" location="f1:660" file="f1" line="660"/>
  <Field id="_881" name="psy_major" type="_311" offset="128" context="_460" access="public" location="f1:663" file="f1" line="663"/>
  <Field id="_882" name="psy_minor" type="_311" offset="160" context="_460" access="public" location="f1:664" file="f1" line="664"/>
  <Field id="_883" name="psy_alpha" type="_311" offset="192" context="_460" access="public" location="f1:665" file="f1" line="665"/>
  <Field id="_884" name="psy_beta" type="_311" offset="224" context="_460" access="public" location="f1:666" file="f1" line="666"/>
  <Field id="_885" name="features" type="_758" offset="256" context="_460" access="public" location="f1:669" file="f1" line="669"/>
  <Destructor id="_886" name="._6" artificial="1" throw="" context="_460" access="public" mangled="_ZN14lame_version_tD1Ev *INTERNAL* " demangled="lame_version_t::~lame_version_t()" location="f1:670" file="f1" line="670" endline="670" inline="1">
  </Destructor>
  <OperatorMethod id="_887" name="=" returns="_960" artificial="1" throw="" context="_460" access="public" mangled="_ZN14lame_version_taSERKS_" demangled="lame_version_t::operator=(lame_version_t const&amp;)" location="f1:670" file="f1" line="670" endline="670" inline="1">
    <Argument type="_961" location="f1:655" file="f1" line="655"/>
  </OperatorMethod>
  <Constructor id="_888" name="._6" artificial="1" throw="" context="_460" access="public" mangled="_ZN14lame_version_tC1ERKS_ *INTERNAL* " demangled="lame_version_t::lame_version_t(lame_version_t const&amp;)" location="f1:670" file="f1" line="670" endline="670" inline="1">
    <Argument type="_961" location="f1:655" file="f1" line="655"/>
  </Constructor>
  <Constructor id="_889" name="._6" artificial="1" throw="" context="_460" access="public" mangled="_ZN14lame_version_tC1Ev *INTERNAL* " demangled="lame_version_t::lame_version_t()" location="f1:670" file="f1" line="670" inline="1"/>
  <Field id="_890" name="header_parsed" type="_311" offset="0" context="_461" access="public" location="f1:1014" file="f1" line="1014"/>
  <Field id="_891" name="stereo" type="_311" offset="32" context="_461" access="public" location="f1:1016" file="f1" line="1016"/>
  <Field id="_892" name="samplerate" type="_311" offset="64" context="_461" access="public" location="f1:1017" file="f1" line="1017"/>
  <Field id="_893" name="bitrate" type="_311" offset="96" context="_461" access="public" location="f1:1018" file="f1" line="1018"/>
  <Field id="_894" name="mode" type="_311" offset="128" context="_461" access="public" location="f1:1019" file="f1" line="1019"/>
  <Field id="_895" name="mode_ext" type="_311" offset="160" context="_461" access="public" location="f1:1020" file="f1" line="1020"/>
  <Field id="_896" name="framesize" type="_311" offset="192" context="_461" access="public" location="f1:1021" file="f1" line="1021"/>
  <Field id="_897" name="nsamp" type="_71" offset="256" context="_461" access="public" location="f1:1024" file="f1" line="1024"/>
  <Field id="_898" name="totalframes" type="_311" offset="320" context="_461" access="public" location="f1:1025" file="f1" line="1025"/>
  <Field id="_899" name="framenum" type="_311" offset="352" context="_461" access="public" location="f1:1028" file="f1" line="1028"/>
  <Destructor id="_900" name="._7" artificial="1" throw="" context="_461" access="public" mangled="_ZN14mp3data_structD1Ev *INTERNAL* " demangled="mp3data_struct::~mp3data_struct()" location="f1:1029" file="f1" line="1029" endline="1029" inline="1">
  </Destructor>
  <OperatorMethod id="_901" name="=" returns="_962" artificial="1" throw="" context="_461" access="public" mangled="_ZN14mp3data_structaSERKS_" demangled="mp3data_struct::operator=(mp3data_struct const&amp;)" location="f1:1029" file="f1" line="1029" endline="1029" inline="1">
    <Argument type="_963" location="f1:1013" file="f1" line="1013"/>
  </OperatorMethod>
  <Constructor id="_902" name="._7" artificial="1" throw="" context="_461" access="public" mangled="_ZN14mp3data_structC1ERKS_ *INTERNAL* " demangled="mp3data_struct::mp3data_struct(mp3data_struct const&amp;)" location="f1:1029" file="f1" line="1029" endline="1029" inline="1">
    <Argument type="_963" location="f1:1013" file="f1" line="1013"/>
  </Constructor>
  <Constructor id="_903" name="._7" artificial="1" throw="" context="_461" access="public" mangled="_ZN14mp3data_structC1Ev *INTERNAL* " demangled="mp3data_struct::mp3data_struct()" location="f1:1029" file="f1" line="1029" inline="1"/>
  <Field id="_904" name="_next" type="_929" offset="0" context="_471" access="public" location="f6:161" file="f6" line="161"/>
  <Field id="_905" name="_sbuf" type="_772" offset="64" context="_471" access="public" location="f6:162" file="f6" line="162"/>
  <Field id="_906" name="_pos" type="_311" offset="128" context="_471" access="public" location="f6:166" file="f6" line="166"/>
  <Destructor id="_907" name="_IO_marker" artificial="1" throw="" context="_471" access="public" mangled="_ZN10_IO_markerD1Ev *INTERNAL* " demangled="_IO_marker::~_IO_marker()" location="f6:160" file="f6" line="160" endline="160" inline="1">
  </Destructor>
  <OperatorMethod id="_908" name="=" returns="_964" artificial="1" throw="" context="_471" access="public" mangled="_ZN10_IO_markeraSERKS_" demangled="_IO_marker::operator=(_IO_marker const&amp;)" location="f6:160" file="f6" line="160" endline="160" inline="1">
    <Argument type="_965" location="f6:160" file="f6" line="160"/>
  </OperatorMethod>
  <Constructor id="_909" name="_IO_marker" artificial="1" throw="" context="_471" access="public" mangled="_ZN10_IO_markerC1ERKS_ *INTERNAL* " demangled="_IO_marker::_IO_marker(_IO_marker const&amp;)" location="f6:160" file="f6" line="160" endline="160" inline="1">
    <Argument type="_965" location="f6:160" file="f6" line="160"/>
  </Constructor>
  <Constructor id="_910" name="_IO_marker" artificial="1" throw="" context="_471" access="public" mangled="_ZN10_IO_markerC1Ev *INTERNAL* " demangled="_IO_marker::_IO_marker()" location="f6:160" file="f6" line="160" inline="1"/>
  <PointerType id="_911" type="_941" size="64" align="64"/>
  <PointerType id="_912" type="_603" size="64" align="64"/>
  <PointerType id="_913" type="_679" size="64" align="64"/>
  <ArrayType id="_914" min="0" max="2u" type="_966" size="1536" align="32"/>
  <CvQualifiedType id="_914c" type="_914" const="1"/>
  <PointerType id="_916" type="_268" size="64" align="64"/>
  <CvQualifiedType id="_916r" type="_916" restrict="1"/>
  <CvQualifiedType id="_827r" type="_827" restrict="1"/>
  <PointerType id="_923" type="_744" size="64" align="64"/>
  <PointerType id="_924" type="_753" size="64" align="64"/>
  <PointerType id="_925" type="_537" size="64" align="64"/>
  <PointerType id="_926" type="_134" size="64" align="64"/>
  <ReferenceType id="_927" type="_44" size="64" align="64"/>
  <ReferenceType id="_928" type="_44c" size="64" align="64"/>
  <PointerType id="_929" type="_471" size="64" align="64"/>
  <ArrayType id="_930" min="0" max="0u" type="_919" size="8" align="8"/>
  <PointerType id="_931" type="_67" size="64" align="64"/>
  <ArrayType id="_932" min="0" max="19u" type="_919" size="160" align="8"/>
  <ReferenceType id="_933" type="_93" size="64" align="64"/>
  <ReferenceType id="_934" type="_93c" size="64" align="64"/>
  <ReferenceType id="_938" type="_208" size="64" align="64"/>
  <ReferenceType id="_939" type="_208c" size="64" align="64"/>
  <ArrayType id="_941" min="0" max="3u" type="_311" size="128" align="32"/>
  <ReferenceType id="_942" type="_267" size="64" align="64"/>
  <ReferenceType id="_943" type="_267c" size="64" align="64"/>
  <Field id="_945" name="__wch" type="_73" offset="0" context="_862" access="public" location="f11:88" file="f11" line="88"/>
  <Field id="_946" name="__wchb" type="_970" offset="0" context="_862" access="public" location="f11:92" file="f11" line="92"/>
  <Destructor id="_947" name="._2" artificial="1" throw="" context="_862" access="public" mangled="_ZN11__mbstate_t3._2D1Ev *INTERNAL* " demangled="__mbstate_t::._2::~._2()" location="f11:86" file="f11" line="86" endline="86" inline="1">
  </Destructor>
  <OperatorMethod id="_948" name="=" returns="_971" artificial="1" throw="" context="_862" access="public" mangled="_ZN11__mbstate_t3._2aSERKS0_" demangled="__mbstate_t::._2::operator=(__mbstate_t::._2 const&amp;)" location="f11:86" file="f11" line="86" endline="86" inline="1">
    <Argument type="_972" location="f11:86" file="f11" line="86"/>
  </OperatorMethod>
  <Constructor id="_949" artificial="1" throw="" context="_862" access="public" mangled="_ZN11__mbstate_t3._2C1ERKS0_ *INTERNAL* " demangled="__mbstate_t::._2::._2(__mbstate_t::._2 const&amp;)" location="f11:86" file="f11" line="86" endline="86" inline="1">
    <Argument type="_972" location="f11:86" file="f11" line="86"/>
  </Constructor>
  <Constructor id="_950" artificial="1" throw="" context="_862" access="public" mangled="_ZN11__mbstate_t3._2C1Ev *INTERNAL* " demangled="__mbstate_t::._2::._2()" location="f11:86" file="f11" line="86" inline="1"/>
  <ReferenceType id="_951" type="_346" size="64" align="64"/>
  <ReferenceType id="_952" type="_346c" size="64" align="64"/>
  <ArrayType id="_957" min="0" max="1u" type="_311" size="64" align="32"/>
  <ReferenceType id="_958" type="_459" size="64" align="64"/>
  <ReferenceType id="_959" type="_459c" size="64" align="64"/>
  <ReferenceType id="_960" type="_460" size="64" align="64"/>
  <ReferenceType id="_961" type="_460c" size="64" align="64"/>
  <ReferenceType id="_962" type="_461" size="64" align="64"/>
  <ReferenceType id="_963" type="_461c" size="64" align="64"/>
  <ReferenceType id="_964" type="_471" size="64" align="64"/>
  <ReferenceType id="_965" type="_471c" size="64" align="64"/>
  <ArrayType id="_966" min="0" max="15u" type="_311" size="512" align="32"/>
  <FundamentalType id="_919" name="char" size="8" align="8"/>
  <ArrayType id="_970" min="0" max="3u" type="_919" size="32" align="8"/>
  <ReferenceType id="_971" type="_862" size="64" align="64"/>
  <ReferenceType id="_972" type="_862c" size="64" align="64"/>
  <CvQualifiedType id="_919c" type="_919" const="1"/>
  <CvQualifiedType id="_759c" type="_759" const="1"/>
  <CvQualifiedType id="_757c" type="_757" const="1"/>
  <CvQualifiedType id="_66c" type="_66" const="1"/>
  <CvQualifiedType id="_459c" type="_459" const="1"/>
  <CvQualifiedType id="_862c" type="_862" const="1"/>
  <CvQualifiedType id="_346c" type="_346" const="1"/>
  <CvQualifiedType id="_208c" type="_208" const="1"/>
  <CvQualifiedType id="_267c" type="_267" const="1"/>
  <CvQualifiedType id="_471c" type="_471" const="1"/>
  <CvQualifiedType id="_93c" type="_93" const="1"/>
  <CvQualifiedType id="_44c" type="_44" const="1"/>
  <CvQualifiedType id="_621c" type="_621" const="1"/>
  <CvQualifiedType id="_268c" type="_268" const="1"/>
  <FunctionType id="_830" returns="_66">
    <Argument type="_758"/>
    <Argument type="_765"/>
  </FunctionType>
  <CvQualifiedType id="_187c" type="_187" const="1"/>
  <CvQualifiedType id="_460c" type="_460" const="1"/>
  <CvQualifiedType id="_103c" type="_103" const="1"/>
  <ArrayType id="_954" min="0" max="5u" type="_311" size="192" align="32"/>
  <CvQualifiedType id="_461c" type="_461" const="1"/>
  <FunctionType id="_940" returns="_66">
    <Argument type="_311"/>
    <Argument type="_758"/>
    <Argument type="_599"/>
  </FunctionType>
  <CvQualifiedType id="_157c" type="_157" const="1"/>
  <File id="f0" name="/usr/share/gccxml-0.9/GCC/4.8/gccxml_builtins.h"/>
  <File id="f1" name="/usr/include/lame/lame.h"/>
  <File id="f2" name="/tmp/tmpM7j7Ie.cpp"/>
  <File id="f3" name="/usr/include/stdio.h"/>
  <File id="f4" name="/usr/include/bits/stdio2.h"/>
