<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

    <Argument name="ppBytes" type="_1021" location="f5:100" file="f5" line="100"/>
    <Argument name="pNumBytes" type="_1022" location="f5:100" file="f5" line="100"/>
    <Argument name="pStartTime" type="_1031" location="f5:100" file="f5" line="100" default="0"/>
    <Argument name="pDuration" type="_1032" location="f5:100" file="f5" line="100" default="0"/>
    <Argument name="pRenderingOffset" type="_1032" location="f5:100" file="f5" line="100" default="0"/>
    <Argument name="pIsSyncSample" type="_1033" location="f5:100" file="f5" line="100" default="0"/>
  </Function>
  <Typedef id="_973" name="uint64_t" type="_22" context="_1" location="f4:59" file="f4" line="59"/>
  <Function id="_974" name="__builtin_csin" returns="_1039" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_1039" location="f0:115" file="f0" line="115"/>
  </Function>
  <Variable id="_975" name="cpp_sym_MPEG4_STP_L1" type="_116c" init="81" context="_1" location="f1:45" file="f1" line="45" static="1"/>
  <Variable id="_976" name="cpp_sym_MPEG4_ASP_L3B" type="_116c" init="247" context="_1" location="f1:169" file="f1" line="169" static="1"/>
  <Typedef id="_977" name="__clock_t" type="_70" context="_1" location="f2:145" file="f2" line="145"/>
  <Function id="_978" name="MP4TagsSetITunesCountry" returns="_996" context="_1" location="f7:279" file="f7" line="279" extern="1" attributes="visibility(default)">
    <Argument type="_999" location="f7:279" file="f7" line="279"/>
    <Argument type="_1000" location="f7:279" file="f7" line="279"/>
  </Function>
  <Function id="_979" name="MP4SetAmrVendor" returns="_98" context="_1" location="f9:183" file="f9" line="183" extern="1" attributes="visibility(default)">
    <Argument name="hFile" type="_646" location="f9:183" file="f9" line="183"/>
    <Argument name="trackId" type="_743" location="f9:183" file="f9" line="183"/>
    <Argument name="vendor" type="_401" location="f9:183" file="f9" line="183"/>
  </Function>
  <Function id="_980" name="_IO_vfscanf" returns="_116" context="_1" location="f13:493" file="f13" line="493" extern="1">
    <Argument type="_1019r" location="f13:493" file="f13" line="493"/>
    <Argument type="_992r" location="f13:493" file="f13" line="493"/>
    <Argument type="_674" location="f13:493" file="f13" line="493"/>
    <Argument type="_1107r" location="f13:493" file="f13" line="493"/>
  </Function>
  <Variable id="_981" name="cpp_sym__POSIX_SOURCE" type="_116c" init="1" context="_1" location="f1:66" file="f1" line="66" static="1"/>
  <Function id="_982" name="_IO_ftrylockfile" returns="_116" throw="" context="_1" location="f13:475" file="f13" line="475" extern="1">
    <Argument type="_1019" location="f13:475" file="f13" line="475"/>
  </Function>
  <Typedef id="_983" name="__int32_t" type="_116" context="_1" location="f2:41" file="f2" line="41"/>
  <Typedef id="_984" name="__io_write_fn" type="_241" context="_1" location="f13:375" file="f13" line="375"/>
  <Function id="_985" name="MP4AddChapterTextTrack" returns="_743" context="_1" location="f18:70" file="f18" line="70" extern="1" attributes="visibility(default)">
    <Argument name="hFile" type="_646" location="f18:70" file="f18" line="70"/>
    <Argument name="refTrackId" type="_743" location="f18:70" file="f18" line="70"/>
    <Argument name="timescale" type="_401" location="f18:70" file="f18" line="70" default="0"/>
  </Function>
  <Function id="_986" name="MP4TagsSetEncodingTool" returns="_996" context="_1" location="f7:264" file="f7" line="264" extern="1" attributes="visibility(default)">
    <Argument type="_999" location="f7:264" file="f7" line="264"/>
    <Argument type="_992" location="f7:264" file="f7" line="264"/>
  </Function>
  <Variable id="_987" name="cpp_sym__IO_IN_BACKUP" type="_116c" init="256" context="_1" location="f1:149" file="f1" line="149" static="1"/>
  <Function id="_988" name="MP4AddHrefTrack" returns="_743" context="_1" location="f9:207" file="f9" line="207" extern="1" attributes="visibility(default)">
    <Argument name="hFile" type="_646" location="f9:207" file="f9" line="207"/>
    <Argument name="timeScale" type="_401" location="f9:207" file="f9" line="207"/>
    <Argument name="sampleDuration" type="_562" location="f9:207" file="f9" line="207"/>
    <Argument name="base_url" type="_992" location="f9:207" file="f9" line="207" default="0"/>
  </Function>
  <Function id="_989" name="MP4GetHintTrackReferenceTrackId" returns="_743" context="_1" location="f8:67" file="f8" line="67" extern="1" attributes="visibility(default)">
    <Argument name="hFile" type="_646" location="f8:67" file="f8" line="67"/>
    <Argument name="hintTrackId" type="_743" location="f8:67" file="f8" line="67"/>
  </Function>
  <Typedef id="_990" name="__caddr_t" type="_285" context="_1" location="f2:186" file="f2" line="186"/>
  <FundamentalType id="_991" name="double" size="64" align="64"/>
  <PointerType id="_992" type="_1105c" size="32" align="32"/>
  <CvQualifiedType id="_116c" type="_116" const="1"/>
  <FundamentalType id="_994" name="float" size="32" align="32"/>
  <FundamentalType id="_995" name="long double" size="96" align="32"/>
  <FundamentalType id="_996" name="bool" size="8" align="8"/>
  <PointerType id="_997" type="_550" size="32" align="32"/>
  <CvQualifiedType id="_992r" type="_992" restrict="1"/>
  <PointerType id="_999" type="_841c" size="32" align="32"/>
  <PointerType id="_1000" type="_401c" size="32" align="32"/>
  <FundamentalType id="_1001" name="complex float" size="64" align="32"/>
  <FundamentalType id="_1002" name="complex long double" size="192" align="32"/>
  <PointerType id="_1003" type="_994" size="32" align="32"/>
  <PointerType id="_1004" type="_358" size="32" align="32"/>
  <PointerType id="_1005" type="_937" size="32" align="32"/>
  <PointerType id="_1006" type="_134c" size="32" align="32"/>
  <PointerType id="_1007" type="_1021" size="32" align="32"/>
  <PointerType id="_1008" type="_1022" size="32" align="32"/>
  <Field id="_1009" name="scheme_type" type="_401" offset="0" context="_58" access="public" location="f11:13" file="f11" line="13"/>
  <Field id="_1010" name="scheme_version" type="_747" offset="32" context="_58" access="public" location="f11:14" file="f11" line="14"/>
  <Field id="_1011" name="key_ind_len" type="_792" offset="48" context="_58" access="public" location="f11:15" file="f11" line="15"/>
  <Field id="_1012" name="iv_len" type="_792" offset="56" context="_58" access="public" location="f11:16" file="f11" line="16"/>
  <Field id="_1013" name="selective_enc" type="_792" offset="64" context="_58" access="public" location="f11:17" file="f11" line="17"/>
  <Field id="_1014" name="kms_uri" type="_992" offset="96" context="_58" access="public" location="f11:18" file="f11" line="18"/>
  <Destructor id="_1015" name="mp4v2_ismacryp_session_params" artificial="1" throw="" context="_58" access="public" mangled="_ZN29mp4v2_ismacryp_session_paramsD1Ev *INTERNAL* " demangled="mp4v2_ismacryp_session_params::~mp4v2_ismacryp_session_params()" location="f11:12" file="f11" line="12" endline="12" inline="1">
  </Destructor>
  <OperatorMethod id="_1016" name="=" returns="_1267" artificial="1" throw="" context="_58" access="public" mangled="_ZN29mp4v2_ismacryp_session_paramsaSERKS_" demangled="mp4v2_ismacryp_session_params::operator=(mp4v2_ismacryp_session_params const&amp;)" location="f11:12" file="f11" line="12" endline="12" inline="1">
    <Argument type="_1268" location="f11:12" file="f11" line="12"/>
  </OperatorMethod>
  <Constructor id="_1017" name="mp4v2_ismacryp_session_params" artificial="1" throw="" context="_58" access="public" mangled="_ZN29mp4v2_ismacryp_session_paramsC1ERKS_ *INTERNAL* " demangled="mp4v2_ismacryp_session_params::mp4v2_ismacryp_session_params(mp4v2_ismacryp_session_params const&amp;)" location="f11:12" file="f11" line="12" endline="12" inline="1">
    <Argument type="_1268" location="f11:12" file="f11" line="12"/>
  </Constructor>
  <Constructor id="_1018" name="mp4v2_ismacryp_session_params" artificial="1" throw="" context="_58" access="public" mangled="_ZN29mp4v2_ismacryp_session_paramsC1Ev *INTERNAL* " demangled="mp4v2_ismacryp_session_params::mp4v2_ismacryp_session_params()" location="f11:12" file="f11" line="12" inline="1"/>
  <PointerType id="_1019" type="_134" size="32" align="32"/>
  <CvQualifiedType id="_285r" type="_285" restrict="1"/>
  <PointerType id="_1021" type="_1094" size="32" align="32"/>
  <PointerType id="_1022" type="_401" size="32" align="32"/>
  <Field id="_1023" name="read" type="_1269" offset="0" context="_69" access="public" location="f13:399" file="f13" line="399"/>
  <Field id="_1024" name="write" type="_1270" offset="32" context="_69" access="public" location="f13:400" file="f13" line="400"/>
  <Field id="_1025" name="seek" type="_1271" offset="64" context="_69" access="public" location="f13:401" file="f13" line="401"/>
  <Field id="_1026" name="close" type="_1272" offset="96" context="_69" access="public" location="f13:402" file="f13" line="402"/>
  <Destructor id="_1027" name="._5" artificial="1" throw="" context="_69" access="public" mangled="_ZN25_IO_cookie_io_functions_tD1Ev *INTERNAL* " demangled="_IO_cookie_io_functions_t::~_IO_cookie_io_functions_t()" location="f13:403" file="f13" line="403" endline="403" inline="1">
  </Destructor>
  <OperatorMethod id="_1028" name="=" returns="_1273" artificial="1" throw="" context="_69" access="public" mangled="_ZN25_IO_cookie_io_functions_taSERKS_" demangled="_IO_cookie_io_functions_t::operator=(_IO_cookie_io_functions_t const&amp;)" location="f13:403" file="f13" line="403" endline="403" inline="1">
    <Argument type="_1274" location="f13:398" file="f13" line="398"/>
  </OperatorMethod>
  <Constructor id="_1029" name="._5" artificial="1" throw="" context="_69" access="public" mangled="_ZN25_IO_cookie_io_functions_tC1ERKS_ *INTERNAL* " demangled="_IO_cookie_io_functions_t::_IO_cookie_io_functions_t(_IO_cookie_io_functions_t const&amp;)" location="f13:403" file="f13" line="403" endline="403" inline="1">
    <Argument type="_1274" location="f13:398" file="f13" line="398"/>
  </Constructor>
  <Constructor id="_1030" name="._5" artificial="1" throw="" context="_69" access="public" mangled="_ZN25_IO_cookie_io_functions_tC1Ev *INTERNAL* " demangled="_IO_cookie_io_functions_t::_IO_cookie_io_functions_t()" location="f13:403" file="f13" line="403" inline="1"/>
  <PointerType id="_1031" type="_306" size="32" align="32"/>
  <PointerType id="_1032" type="_562" size="32" align="32"/>
  <PointerType id="_1033" type="_996" size="32" align="32"/>
  <PointerType id="_1034" type="_67" size="32" align="32"/>
  <CvQualifiedType id="_1034r" type="_1034" restrict="1"/>
  <PointerType id="_1036" type="_323c" size="32" align="32"/>
  <PointerType id="_1037" type="_285" size="32" align="32"/>
  <CvQualifiedType id="_1037r" type="_1037" restrict="1"/>
  <FundamentalType id="_1039" name="complex double" size="128" align="64"/>
  <PointerType id="_1040" type="_467" size="32" align="32"/>
  <PointerType id="_1041" type="_792c" size="32" align="32"/>
  <PointerType id="_1042" type="_654" size="32" align="32"/>
  <CvQualifiedType id="_1042r" type="_1042" restrict="1"/>
  <CvQualifiedType id="_997r" type="_997" restrict="1"/>
  <Field id="_1045" name="_flags" type="_116" offset="0" context="_134" access="public" location="f13:274" file="f13" line="274"/>
  <Field id="_1046" name="_IO_read_ptr" type="_285" offset="32" context="_134" access="public" location="f13:279" file="f13" line="279"/>
  <Field id="_1047" name="_IO_read_end" type="_285" offset="64" context="_134" access="public" location="f13:280" file="f13" line="280"/>
  <Field id="_1048" name="_IO_read_base" type="_285" offset="96" context="_134" access="public" location="f13:281" file="f13" line="281"/>
  <Field id="_1049" name="_IO_write_base" type="_285" offset="128" context="_134" access="public" location="f13:282" file="f13" line="282"/>
  <Field id="_1050" name="_IO_write_ptr" type="_285" offset="160" context="_134" access="public" location="f13:283" file="f13" line="283"/>
  <Field id="_1051" name="_IO_write_end" type="_285" offset="192" context="_134" access="public" location="f13:284" file="f13" line="284"/>
  <Field id="_1052" name="_IO_buf_base" type="_285" offset="224" context="_134" access="public" location="f13:285" file="f13" line="285"/>
  <Field id="_1053" name="_IO_buf_end" type="_285" offset="256" context="_134" access="public" location="f13:286" file="f13" line="286"/>
  <Field id="_1054" name="_IO_save_base" type="_285" offset="288" context="_134" access="public" location="f13:288" file="f13" line="288"/>
  <Field id="_1055" name="_IO_backup_base" type="_285" offset="320" context="_134" access="public" location="f13:289" file="f13" line="289"/>
  <Field id="_1056" name="_IO_save_end" type="_285" offset="352" context="_134" access="public" location="f13:290" file="f13" line="290"/>
  <Field id="_1057" name="_markers" type="_1277" offset="384" context="_134" access="public" location="f13:292" file="f13" line="292"/>
  <Field id="_1058" name="_chain" type="_1019" offset="416" context="_134" access="public" location="f13:294" file="f13" line="294"/>
  <Field id="_1059" name="_fileno" type="_116" offset="448" context="_134" access="public" location="f13:296" file="f13" line="296"/>
  <Field id="_1060" name="_flags2" type="_116" offset="480" context="_134" access="public" location="f13:300" file="f13" line="300"/>
  <Field id="_1061" name="_old_offset" type="_591" offset="512" context="_134" access="public" location="f13:302" file="f13" line="302"/>
  <Field id="_1062" name="_cur_column" type="_217" offset="544" context="_134" access="public" location="f13:306" file="f13" line="306"/>
  <Field id="_1063" name="_vtable_offset" type="_193" offset="560" context="_134" access="public" location="f13:307" file="f13" line="307"/>
  <Field id="_1064" name="_shortbuf" type="_1278" offset="568" context="_134" access="public" location="f13:308" file="f13" line="308"/>
  <Field id="_1065" name="_lock" type="_1279" offset="576" context="_134" access="public" location="f13:312" file="f13" line="312"/>
  <Field id="_1066" name="_offset" type="_804" offset="608" context="_134" access="public" location="f13:321" file="f13" line="321"/>
  <Field id="_1067" name="__pad1" type="_645" offset="672" context="_134" access="public" location="f13:330" file="f13" line="330"/>
  <Field id="_1068" name="__pad2" type="_645" offset="704" context="_134" access="public" location="f13:331" file="f13" line="331"/>
  <Field id="_1069" name="__pad3" type="_645" offset="736" context="_134" access="public" location="f13:332" file="f13" line="332"/>
  <Field id="_1070" name="__pad4" type="_645" offset="768" context="_134" access="public" location="f13:333" file="f13" line="333"/>
  <Field id="_1071" name="__pad5" type="_654" offset="800" context="_134" access="public" location="f13:334" file="f13" line="334"/>
  <Field id="_1072" name="_mode" type="_116" offset="832" context="_134" access="public" location="f13:336" file="f13" line="336"/>
  <Field id="_1073" name="_unused2" type="_1280" offset="864" context="_134" access="public" location="f13:338" file="f13" line="338"/>
  <Destructor id="_1074" name="_IO_FILE" artificial="1" throw="" context="_134" access="public" mangled="_ZN8_IO_FILED1Ev *INTERNAL* " demangled="_IO_FILE::~_IO_FILE()" location="f13:273" file="f13" line="273" endline="273" inline="1">
  </Destructor>
  <OperatorMethod id="_1075" name="=" returns="_1281" artificial="1" throw="" context="_134" access="public" mangled="_ZN8_IO_FILEaSERKS_" demangled="_IO_FILE::operator=(_IO_FILE const&amp;)" location="f13:273" file="f13" line="273" endline="273" inline="1">
    <Argument type="_1282" location="f13:273" file="f13" line="273"/>
  </OperatorMethod>
  <Constructor id="_1076" name="_IO_FILE" artificial="1" throw="" context="_134" access="public" mangled="_ZN8_IO_FILEC1ERKS_ *INTERNAL* " demangled="_IO_FILE::_IO_FILE(_IO_FILE const&amp;)" location="f13:273" file="f13" line="273" endline="273" inline="1">
    <Argument type="_1282" location="f13:273" file="f13" line="273"/>
  </Constructor>
  <Constructor id="_1077" name="_IO_FILE" artificial="1" throw="" context="_134" access="public" mangled="_ZN8_IO_FILEC1Ev *INTERNAL* " demangled="_IO_FILE::_IO_FILE()" location="f13:273" file="f13" line="273" inline="1"/>
  <Field id="_1078" name="data" type="_645" offset="0" context="_136" access="public" location="f7:69" file="f7" line="69"/>
  <Field id="_1079" name="size" type="_401" offset="32" context="_136" access="public" location="f7:70" file="f7" line="70"/>
  <Field id="_1080" name="type" type="_50" offset="64" context="_136" access="public" location="f7:71" file="f7" line="71"/>
  <Destructor id="_1081" name="MP4TagArtwork_s" artificial="1" throw="" context="_136" access="public" mangled="_ZN15MP4TagArtwork_sD1Ev *INTERNAL* " demangled="MP4TagArtwork_s::~MP4TagArtwork_s()" location="f7:68" file="f7" line="68" endline="68" inline="1">
  </Destructor>
  <OperatorMethod id="_1082" name="=" returns="_1283" artificial="1" throw="" context="_136" access="public" mangled="_ZN15MP4TagArtwork_saSERKS_" demangled="MP4TagArtwork_s::operator=(MP4TagArtwork_s const&amp;)" location="f7:68" file="f7" line="68" endline="68" inline="1">
    <Argument type="_1284" location="f7:68" file="f7" line="68"/>
  </OperatorMethod>
  <Constructor id="_1083" name="MP4TagArtwork_s" artificial="1" throw="" context="_136" access="public" mangled="_ZN15MP4TagArtwork_sC1ERKS_ *INTERNAL* " demangled="MP4TagArtwork_s::MP4TagArtwork_s(MP4TagArtwork_s const&amp;)" location="f7:68" file="f7" line="68" endline="68" inline="1">
    <Argument type="_1284" location="f7:68" file="f7" line="68"/>
  </Constructor>
  <Constructor id="_1084" name="MP4TagArtwork_s" artificial="1" throw="" context="_136" access="public" mangled="_ZN15MP4TagArtwork_sC1Ev *INTERNAL* " demangled="MP4TagArtwork_s::MP4TagArtwork_s()" location="f7:68" file="f7" line="68" inline="1"/>
  <PointerType id="_1085" type="_890c" size="32" align="32"/>
  <PointerType id="_1086" type="_973c" size="32" align="32"/>
  <Field id="_1087" name="duration" type="_562" offset="0" context="_197" access="public" location="f18:20" file="f18" line="20"/>
  <Field id="_1088" name="title" type="_1287" offset="64" context="_197" access="public" location="f18:21" file="f18" line="21"/>
  <Destructor id="_1089" name="MP4Chapter_s" artificial="1" throw="" context="_197" access="public" mangled="_ZN12MP4Chapter_sD1Ev *INTERNAL* " demangled="MP4Chapter_s::~MP4Chapter_s()" location="f18:19" file="f18" line="19" endline="19" inline="1">
  </Destructor>
  <OperatorMethod id="_1090" name="=" returns="_1288" artificial="1" throw="" context="_197" access="public" mangled="_ZN12MP4Chapter_saSERKS_" demangled="MP4Chapter_s::operator=(MP4Chapter_s const&amp;)" location="f18:19" file="f18" line="19" endline="19" inline="1">
    <Argument type="_1289" location="f18:19" file="f18" line="19"/>
  </OperatorMethod>
  <Constructor id="_1091" name="MP4Chapter_s" artificial="1" throw="" context="_197" access="public" mangled="_ZN12MP4Chapter_sC1ERKS_ *INTERNAL* " demangled="MP4Chapter_s::MP4Chapter_s(MP4Chapter_s const&amp;)" location="f18:19" file="f18" line="19" endline="19" inline="1">
    <Argument type="_1289" location="f18:19" file="f18" line="19"/>
  </Constructor>
  <Constructor id="_1092" name="MP4Chapter_s" artificial="1" throw="" context="_197" access="public" mangled="_ZN12MP4Chapter_sC1Ev *INTERNAL* " demangled="MP4Chapter_s::MP4Chapter_s()" location="f18:19" file="f18" line="19" inline="1"/>
  <PointerType id="_1093" type="_992" size="32" align="32"/>
  <PointerType id="_1094" type="_792" size="32" align="32"/>
  <PointerType id="_1095" type="_98c" size="32" align="32"/>
  <CvQualifiedType id="_1095r" type="_1095" restrict="1"/>
  <CvQualifiedType id="_17c" type="_17" const="1"/>
  <CvQualifiedType id="_70c" type="_70" const="1"/>
  <Field id="_1099" name="__pos" type="_591" offset="0" context="_280" access="public" location="f17:24" file="f17" line="24"/>
  <Field id="_1100" name="__state" type="_455" offset="32" context="_280" access="public" location="f17:25" file="f17" line="25"/>
  <Destructor id="_1101" name="._3" artificial="1" throw="" context="_280" access="public" mangled="_ZN9_G_fpos_tD1Ev *INTERNAL* " demangled="_G_fpos_t::~_G_fpos_t()" location="f17:26" file="f17" line="26" endline="26" inline="1">
  </Destructor>
  <OperatorMethod id="_1102" name="=" returns="_1291" artificial="1" throw="" context="_280" access="public" mangled="_ZN9_G_fpos_taSERKS_" demangled="_G_fpos_t::operator=(_G_fpos_t const&amp;)" location="f17:26" file="f17" line="26" endline="26" inline="1">
    <Argument type="_1292" location="f17:23" file="f17" line="23"/>
  </OperatorMethod>
  <Constructor id="_1103" name="._3" artificial="1" throw="" context="_280" access="public" mangled="_ZN9_G_fpos_tC1ERKS_ *INTERNAL* " demangled="_G_fpos_t::_G_fpos_t(_G_fpos_t const&amp;)" location="f17:26" file="f17" line="26" endline="26" inline="1">
    <Argument type="_1292" location="f17:23" file="f17" line="23"/>
  </Constructor>
  <Constructor id="_1104" name="._3" artificial="1" throw="" context="_280" access="public" mangled="_ZN9_G_fpos_tC1Ev *INTERNAL* " demangled="_G_fpos_t::_G_fpos_t()" location="f17:26" file="f17" line="26" inline="1"/>
  <PointerType id="_1106" type="_1259" size="32" align="32"/>
  <PointerType id="_1107" type="_116" size="32" align="32"/>
  <Field id="_1108" name="open" type="_1293" offset="0" context="_322" access="public" location="f15:38" file="f15" line="38"/>
  <Field id="_1109" name="seek" type="_1294" offset="32" context="_322" access="public" location="f15:39" file="f15" line="39"/>
  <Field id="_1110" name="read" type="_1295" offset="64" context="_322" access="public" location="f15:40" file="f15" line="40"/>
  <Field id="_1111" name="write" type="_1296" offset="96" context="_322" access="public" location="f15:41" file="f15" line="41"/>
  <Field id="_1112" name="close" type="_1297" offset="128" context="_322" access="public" location="f15:42" file="f15" line="42"/>
  <Destructor id="_1113" name="MP4FileProvider_s" artificial="1" throw="" context="_322" access="public" mangled="_ZN17MP4FileProvider_sD1Ev *INTERNAL* " demangled="MP4FileProvider_s::~MP4FileProvider_s()" location="f15:37" file="f15" line="37" endline="37" inline="1">
  </Destructor>
  <OperatorMethod id="_1114" name="=" returns="_1298" artificial="1" throw="" context="_322" access="public" mangled="_ZN17MP4FileProvider_saSERKS_" demangled="MP4FileProvider_s::operator=(MP4FileProvider_s const&amp;)" location="f15:37" file="f15" line="37" endline="37" inline="1">
    <Argument type="_1299" location="f15:37" file="f15" line="37"/>
  </OperatorMethod>
  <Constructor id="_1115" name="MP4FileProvider_s" artificial="1" throw="" context="_322" access="public" mangled="_ZN17MP4FileProvider_sC1ERKS_ *INTERNAL* " demangled="MP4FileProvider_s::MP4FileProvider_s(MP4FileProvider_s const&amp;)" location="f15:37" file="f15" line="37" endline="37" inline="1">
    <Argument type="_1299" location="f15:37" file="f15" line="37"/>
  </Constructor>
  <Constructor id="_1116" name="MP4FileProvider_s" artificial="1" throw="" context="_322" access="public" mangled="_ZN17MP4FileProvider_sC1Ev *INTERNAL* " demangled="MP4FileProvider_s::MP4FileProvider_s()" location="f15:37" file="f15" line="37" inline="1"/>
  <PointerType id="_1117" type="_973" size="32" align="32"/>
  <ArrayType id="_1118" min="0" max="" type="_992" align="32"/>
  <CvQualifiedType id="_1118c" type="_1118" const="1"/>
  <PointerType id="_1120" type="_747c" size="32" align="32"/>
  <Field id="_1121" name="index" type="_747" offset="0" context="_338" access="public" location="f7:82" file="f7" line="82"/>
  <Field id="_1122" name="total" type="_747" offset="16" context="_338" access="public" location="f7:83" file="f7" line="83"/>
  <Destructor id="_1123" name="MP4TagDisk_s" artificial="1" throw="" context="_338" access="public" mangled="_ZN12MP4TagDisk_sD1Ev *INTERNAL* " demangled="MP4TagDisk_s::~MP4TagDisk_s()" location="f7:81" file="f7" line="81" endline="81" inline="1">
  </Destructor>
  <OperatorMethod id="_1124" name="=" returns="_1301" artificial="1" throw="" context="_338" access="public" mangled="_ZN12MP4TagDisk_saSERKS_" demangled="MP4TagDisk_s::operator=(MP4TagDisk_s const&amp;)" location="f7:81" file="f7" line="81" endline="81" inline="1">
    <Argument type="_1302" location="f7:81" file="f7" line="81"/>
  </OperatorMethod>
  <Constructor id="_1125" name="MP4TagDisk_s" artificial="1" throw="" context="_338" access="public" mangled="_ZN12MP4TagDisk_sC1ERKS_ *INTERNAL* " demangled="MP4TagDisk_s::MP4TagDisk_s(MP4TagDisk_s const&amp;)" location="f7:81" file="f7" line="81" endline="81" inline="1">
    <Argument type="_1302" location="f7:81" file="f7" line="81"/>
  </Constructor>
  <Constructor id="_1126" name="MP4TagDisk_s" artificial="1" throw="" context="_338" access="public" mangled="_ZN12MP4TagDisk_sC1Ev *INTERNAL* " demangled="MP4TagDisk_s::MP4TagDisk_s()" location="f7:81" file="f7" line="81" inline="1"/>
  <PointerType id="_1127" type="_766" size="32" align="32"/>
  <CvQualifiedType id="_1127r" type="_1127" restrict="1"/>
  <Field id="_1129" name="__pos" type="_804" offset="0" context="_362" access="public" location="f17:29" file="f17" line="29"/>
  <Field id="_1130" name="__state" type="_455" offset="64" context="_362" access="public" location="f17:30" file="f17" line="30"/>
  <Destructor id="_1131" name="._4" artificial="1" throw="" context="_362" access="public" mangled="_ZN11_G_fpos64_tD1Ev *INTERNAL* " demangled="_G_fpos64_t::~_G_fpos64_t()" location="f17:31" file="f17" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_1132" name="=" returns="_1303" artificial="1" throw="" context="_362" access="public" mangled="_ZN11_G_fpos64_taSERKS_" demangled="_G_fpos64_t::operator=(_G_fpos64_t const&amp;)" location="f17:31" file="f17" line="31" endline="31" inline="1">
    <Argument type="_1304" location="f17:28" file="f17" line="28"/>
  </OperatorMethod>
  <Constructor id="_1133" name="._4" artificial="1" throw="" context="_362" access="public" mangled="_ZN11_G_fpos64_tC1ERKS_ *INTERNAL* " demangled="_G_fpos64_t::_G_fpos64_t(_G_fpos64_t const&amp;)" location="f17:31" file="f17" line="31" endline="31" inline="1">
    <Argument type="_1304" location="f17:28" file="f17" line="28"/>
  </Constructor>
  <Constructor id="_1134" name="._4" artificial="1" throw="" context="_362" access="public" mangled="_ZN11_G_fpos64_tC1Ev *INTERNAL* " demangled="_G_fpos64_t::_G_fpos64_t()" location="f17:31" file="f17" line="31" inline="1"/>
  <PointerType id="_1135" type="_995" size="32" align="32"/>
  <Field id="_1136" name="typeSetIdentifier" type="_792" offset="0" context="_430" access="public" location="f16:102" file="f16" line="102"/>
  <Field id="_1137" name="typeCode" type="_736" offset="32" context="_430" access="public" location="f16:103" file="f16" line="103"/>
  <Field id="_1138" name="locale" type="_401" offset="64" context="_430" access="public" location="f16:104" file="f16" line="104"/>
  <Field id="_1139" name="value" type="_1094" offset="96" context="_430" access="public" location="f16:105" file="f16" line="105"/>
  <Field id="_1140" name="valueSize" type="_401" offset="128" context="_430" access="public" location="f16:106" file="f16" line="106"/>
  <Destructor id="_1141" name="MP4ItmfData_s" artificial="1" throw="" context="_430" access="public" mangled="_ZN13MP4ItmfData_sD1Ev *INTERNAL* " demangled="MP4ItmfData_s::~MP4ItmfData_s()" location="f16:101" file="f16" line="101" endline="101" inline="1">
  </Destructor>
  <OperatorMethod id="_1142" name="=" returns="_1305" artificial="1" throw="" context="_430" access="public" mangled="_ZN13MP4ItmfData_saSERKS_" demangled="MP4ItmfData_s::operator=(MP4ItmfData_s const&amp;)" location="f16:101" file="f16" line="101" endline="101" inline="1">
    <Argument type="_1306" location="f16:101" file="f16" line="101"/>
  </OperatorMethod>
  <Constructor id="_1143" name="MP4ItmfData_s" artificial="1" throw="" context="_430" access="public" mangled="_ZN13MP4ItmfData_sC1ERKS_ *INTERNAL* " demangled="MP4ItmfData_s::MP4ItmfData_s(MP4ItmfData_s const&amp;)" location="f16:101" file="f16" line="101" endline="101" inline="1">
    <Argument type="_1306" location="f16:101" file="f16" line="101"/>
  </Constructor>
  <Constructor id="_1144" name="MP4ItmfData_s" artificial="1" throw="" context="_430" access="public" mangled="_ZN13MP4ItmfData_sC1Ev *INTERNAL* " demangled="MP4ItmfData_s::MP4ItmfData_s()" location="f16:101" file="f16" line="101" inline="1"/>
  <PointerType id="_1145" type="_747" size="32" align="32"/>
  <Field id="_1146" name="__count" type="_116" offset="0" context="_455" access="public" location="f20:85" file="f20" line="85"/>
  <Field id="_1147" name="__value" type="_1148" offset="32" context="_455" access="public" location="f20:94" file="f20" line="94"/>
  <Union id="_1148" context="_455" access="public" mangled="N11__mbstate_t3._2E" demangled="__mbstate_t::._2" location="f20:87" file="f20" line="87" artificial="1" size="32" align="32" members="_1307 _1308 _1309 _1310 _1311 _1312 " bases=""/>
  <Destructor id="_1149" name="._1" artificial="1" throw="" context="_455" access="public" mangled="_ZN11__mbstate_tD1Ev *INTERNAL* " demangled="__mbstate_t::~__mbstate_t()" location="f20:95" file="f20" line="95" endline="95" inline="1">
  </Destructor>
  <OperatorMethod id="_1150" name="=" returns="_1313" artificial="1" throw="" context="_455" access="public" mangled="_ZN11__mbstate_taSERKS_" demangled="__mbstate_t::operator=(__mbstate_t const&amp;)" location="f20:95" file="f20" line="95" endline="95" inline="1">
    <Argument type="_1314" location="f20:84" file="f20" line="84"/>
  </OperatorMethod>
  <Constructor id="_1151" name="._1" artificial="1" throw="" context="_455" access="public" mangled="_ZN11__mbstate_tC1ERKS_ *INTERNAL* " demangled="__mbstate_t::__mbstate_t(__mbstate_t const&amp;)" location="f20:95" file="f20" line="95" endline="95" inline="1">
    <Argument type="_1314" location="f20:84" file="f20" line="84"/>
  </Constructor>
  <Constructor id="_1152" name="._1" artificial="1" throw="" context="_455" access="public" mangled="_ZN11__mbstate_tC1Ev *INTERNAL* " demangled="__mbstate_t::__mbstate_t()" location="f20:95" file="f20" line="95" inline="1"/>
  <Field id="_1153" name="elements" type="_1159" offset="0" context="_466" access="public" location="f16:132" file="f16" line="132"/>
  <Field id="_1154" name="size" type="_401" offset="32" context="_466" access="public" location="f16:133" file="f16" line="133"/>
  <Destructor id="_1155" name="MP4ItmfItemList_s" artificial="1" throw="" context="_466" access="public" mangled="_ZN17MP4ItmfItemList_sD1Ev *INTERNAL* " demangled="MP4ItmfItemList_s::~MP4ItmfItemList_s()" location="f16:131" file="f16" line="131" endline="131" inline="1">
  </Destructor>
  <OperatorMethod id="_1156" name="=" returns="_1315" artificial="1" throw="" context="_466" access="public" mangled="_ZN17MP4ItmfItemList_saSERKS_" demangled="MP4ItmfItemList_s::operator=(MP4ItmfItemList_s const&amp;)" location="f16:131" file="f16" line="131" endline="131" inline="1">
    <Argument type="_1316" location="f16:131" file="f16" line="131"/>
  </OperatorMethod>
  <Constructor id="_1157" name="MP4ItmfItemList_s" artificial="1" throw="" context="_466" access="public" mangled="_ZN17MP4ItmfItemList_sC1ERKS_ *INTERNAL* " demangled="MP4ItmfItemList_s::MP4ItmfItemList_s(MP4ItmfItemList_s const&amp;)" location="f16:131" file="f16" line="131" endline="131" inline="1">
    <Argument type="_1316" location="f16:131" file="f16" line="131"/>
  </Constructor>
  <Constructor id="_1158" name="MP4ItmfItemList_s" artificial="1" throw="" context="_466" access="public" mangled="_ZN17MP4ItmfItemList_sC1Ev *INTERNAL* " demangled="MP4ItmfItemList_s::MP4ItmfItemList_s()" location="f16:131" file="f16" line="131" inline="1"/>
  <PointerType id="_1159" type="_890" size="32" align="32"/>
  <PointerType id="_1160" type="_766c" size="32" align="32"/>
  <CvQualifiedType id="_1019r" type="_1019" restrict="1"/>
  <Field id="_1162" name="elements" type="_1318" offset="0" context="_514" access="public" location="f16:112" file="f16" line="112"/>
  <Field id="_1163" name="size" type="_401" offset="32" context="_514" access="public" location="f16:113" file="f16" line="113"/>
  <Destructor id="_1164" name="MP4ItmfDataList_s" artificial="1" throw="" context="_514" access="public" mangled="_ZN17MP4ItmfDataList_sD1Ev *INTERNAL* " demangled="MP4ItmfDataList_s::~MP4ItmfDataList_s()" location="f16:111" file="f16" line="111" endline="111" inline="1">
  </Destructor>
  <OperatorMethod id="_1165" name="=" returns="_1319" artificial="1" throw="" context="_514" access="public" mangled="_ZN17MP4ItmfDataList_saSERKS_" demangled="MP4ItmfDataList_s::operator=(MP4ItmfDataList_s const&amp;)" location="f16:111" file="f16" line="111" endline="111" inline="1">
    <Argument type="_1320" location="f16:111" file="f16" line="111"/>
  </OperatorMethod>
  <Constructor id="_1166" name="MP4ItmfDataList_s" artificial="1" throw="" context="_514" access="public" mangled="_ZN17MP4ItmfDataList_sC1ERKS_ *INTERNAL* " demangled="MP4ItmfDataList_s::MP4ItmfDataList_s(MP4ItmfDataList_s const&amp;)" location="f16:111" file="f16" line="111" endline="111" inline="1">
    <Argument type="_1320" location="f16:111" file="f16" line="111"/>
  </Constructor>
  <Constructor id="_1167" name="MP4ItmfDataList_s" artificial="1" throw="" context="_514" access="public" mangled="_ZN17MP4ItmfDataList_sC1Ev *INTERNAL* " demangled="MP4ItmfDataList_s::MP4ItmfDataList_s()" location="f16:111" file="f16" line="111" inline="1"/>
  <PointerType id="_1168" type="_339c" size="32" align="32"/>
  <PointerType id="_1169" type="_363c" size="32" align="32"/>
  <Field id="_1171" name="__val" type="_1323" offset="0" context="_582" access="public" location="f2:144" file="f2" line="144"/>
  <Destructor id="_1172" name="._0" artificial="1" throw="" context="_582" access="public" mangled="_ZN8__fsid_tD1Ev *INTERNAL* " demangled="__fsid_t::~__fsid_t()" location="f2:144" file="f2" line="144" endline="144" inline="1">
  </Destructor>
  <OperatorMethod id="_1173" name="=" returns="_1324" artificial="1" throw="" context="_582" access="public" mangled="_ZN8__fsid_taSERKS_" demangled="__fsid_t::operator=(__fsid_t const&amp;)" location="f2:144" file="f2" line="144" endline="144" inline="1">
    <Argument type="_1325" location="f2:144" file="f2" line="144"/>
  </OperatorMethod>
  <Constructor id="_1174" name="._0" artificial="1" throw="" context="_582" access="public" mangled="_ZN8__fsid_tC1ERKS_ *INTERNAL* " demangled="__fsid_t::__fsid_t(__fsid_t const&amp;)" location="f2:144" file="f2" line="144" endline="144" inline="1">
    <Argument type="_1325" location="f2:144" file="f2" line="144"/>
  </Constructor>
  <Constructor id="_1175" name="._0" artificial="1" throw="" context="_582" access="public" mangled="_ZN8__fsid_tC1Ev *INTERNAL* " demangled="__fsid_t::__fsid_t()" location="f2:144" file="f2" line="144" inline="1"/>
  <Field id="_1176" name="_next" type="_1277" offset="0" context="_595" access="public" location="f13:189" file="f13" line="189"/>
  <Field id="_1177" name="_sbuf" type="_1019" offset="32" context="_595" access="public" location="f13:190" file="f13" line="190"/>
  <Field id="_1178" name="_pos" type="_116" offset="64" context="_595" access="public" location="f13:194" file="f13" line="194"/>
  <Destructor id="_1179" name="_IO_marker" artificial="1" throw="" context="_595" access="public" mangled="_ZN10_IO_markerD1Ev *INTERNAL* " demangled="_IO_marker::~_IO_marker()" location="f13:188" file="f13" line="188" endline="188" inline="1">
  </Destructor>
  <OperatorMethod id="_1180" name="=" returns="_1326" artificial="1" throw="" context="_595" access="public" mangled="_ZN10_IO_markeraSERKS_" demangled="_IO_marker::operator=(_IO_marker const&amp;)" location="f13:188" file="f13" line="188" endline="188" inline="1">
    <Argument type="_1327" location="f13:188" file="f13" line="188"/>
  </OperatorMethod>
  <Constructor id="_1181" name="_IO_marker" artificial="1" throw="" context="_595" access="public" mangled="_ZN10_IO_markerC1ERKS_ *INTERNAL* " demangled="_IO_marker::_IO_marker(_IO_marker const&amp;)" location="f13:188" file="f13" line="188" endline="188" inline="1">
    <Argument type="_1327" location="f13:188" file="f13" line="188"/>
  </Constructor>
  <Constructor id="_1182" name="_IO_marker" artificial="1" throw="" context="_595" access="public" mangled="_ZN10_IO_markerC1Ev *INTERNAL* " demangled="_IO_marker::_IO_marker()" location="f13:188" file="f13" line="188" inline="1"/>
  <PointerType id="_1183" type="_749c" size="32" align="32"/>
  <Field id="_1184" name="__handle" type="_645" offset="0" context="_619" access="public" location="f16:121" file="f16" line="121"/>
  <Field id="_1185" name="code" type="_285" offset="32" context="_619" access="public" location="f16:123" file="f16" line="123"/>
  <Field id="_1186" name="mean" type="_285" offset="64" context="_619" access="public" location="f16:124" file="f16" line="124"/>
  <Field id="_1187" name="name" type="_285" offset="96" context="_619" access="public" location="f16:125" file="f16" line="125"/>
  <Field id="_1188" name="dataList" type="_755" offset="128" context="_619" access="public" location="f16:126" file="f16" line="126"/>
  <Destructor id="_1189" name="MP4ItmfItem_s" artificial="1" throw="" context="_619" access="public" mangled="_ZN13MP4ItmfItem_sD1Ev *INTERNAL* " demangled="MP4ItmfItem_s::~MP4ItmfItem_s()" location="f16:120" file="f16" line="120" endline="120" inline="1">
  </Destructor>
  <OperatorMethod id="_1190" name="=" returns="_1329" artificial="1" throw="" context="_619" access="public" mangled="_ZN13MP4ItmfItem_saSERKS_" demangled="MP4ItmfItem_s::operator=(MP4ItmfItem_s const&amp;)" location="f16:120" file="f16" line="120" endline="120" inline="1">
    <Argument type="_1330" location="f16:120" file="f16" line="120"/>
  </OperatorMethod>
  <Constructor id="_1191" name="MP4ItmfItem_s" artificial="1" throw="" context="_619" access="public" mangled="_ZN13MP4ItmfItem_sC1ERKS_ *INTERNAL* " demangled="MP4ItmfItem_s::MP4ItmfItem_s(MP4ItmfItem_s const&amp;)" location="f16:120" file="f16" line="120" endline="120" inline="1">
    <Argument type="_1330" location="f16:120" file="f16" line="120"/>
  </Constructor>
  <Constructor id="_1192" name="MP4ItmfItem_s" artificial="1" throw="" context="_619" access="public" mangled="_ZN13MP4ItmfItem_sC1Ev *INTERNAL* " demangled="MP4ItmfItem_s::MP4ItmfItem_s()" location="f16:120" file="f16" line="120" inline="1"/>
  <Field id="_1193" name="__handle" type="_645" offset="0" context="_655" access="public" location="f7:100" file="f7" line="100"/>
  <Field id="_1194" name="name" type="_992" offset="32" context="_655" access="public" location="f7:102" file="f7" line="102"/>
  <Field id="_1195" name="artist" type="_992" offset="64" context="_655" access="public" location="f7:103" file="f7" line="103"/>
  <Field id="_1196" name="albumArtist" type="_992" offset="96" context="_655" access="public" location="f7:104" file="f7" line="104"/>
  <Field id="_1197" name="album" type="_992" offset="128" context="_655" access="public" location="f7:105" file="f7" line="105"/>
  <Field id="_1198" name="grouping" type="_992" offset="160" context="_655" access="public" location="f7:106" file="f7" line="106"/>
  <Field id="_1199" name="composer" type="_992" offset="192" context="_655" access="public" location="f7:107" file="f7" line="107"/>
  <Field id="_1200" name="comments" type="_992" offset="224" context="_655" access="public" location="f7:108" file="f7" line="108"/>
  <Field id="_1201" name="genre" type="_992" offset="256" context="_655" access="public" location="f7:109" file="f7" line="109"/>
  <Field id="_1202" name="genreType" type="_1120" offset="288" context="_655" access="public" location="f7:110" file="f7" line="110"/>
  <Field id="_1203" name="releaseDate" type="_992" offset="320" context="_655" access="public" location="f7:111" file="f7" line="111"/>
  <Field id="_1204" name="track" type="_1183" offset="352" context="_655" access="public" location="f7:112" file="f7" line="112"/>
  <Field id="_1205" name="disk" type="_1168" offset="384" context="_655" access="public" location="f7:113" file="f7" line="113"/>
  <Field id="_1206" name="tempo" type="_1120" offset="416" context="_655" access="public" location="f7:114" file="f7" line="114"/>
  <Field id="_1207" name="compilation" type="_1041" offset="448" context="_655" access="public" location="f7:115" file="f7" line="115"/>
  <Field id="_1208" name="tvShow" type="_992" offset="480" context="_655" access="public" location="f7:117" file="f7" line="117"/>
  <Field id="_1209" name="tvNetwork" type="_992" offset="512" context="_655" access="public" location="f7:118" file="f7" line="118"/>
  <Field id="_1210" name="tvEpisodeID" type="_992" offset="544" context="_655" access="public" location="f7:119" file="f7" line="119"/>
  <Field id="_1211" name="tvSeason" type="_1000" offset="576" context="_655" access="public" location="f7:120" file="f7" line="120"/>
  <Field id="_1212" name="tvEpisode" type="_1000" offset="608" context="_655" access="public" location="f7:121" file="f7" line="121"/>
  <Field id="_1213" name="description" type="_992" offset="640" context="_655" access="public" location="f7:123" file="f7" line="123"/>
  <Field id="_1214" name="longDescription" type="_992" offset="672" context="_655" access="public" location="f7:124" file="f7" line="124"/>
  <Field id="_1215" name="lyrics" type="_992" offset="704" context="_655" access="public" location="f7:125" file="f7" line="125"/>
  <Field id="_1216" name="sortName" type="_992" offset="736" context="_655" access="public" location="f7:127" file="f7" line="127"/>
  <Field id="_1217" name="sortArtist" type="_992" offset="768" context="_655" access="public" location="f7:128" file="f7" line="128"/>
  <Field id="_1218" name="sortAlbumArtist" type="_992" offset="800" context="_655" access="public" location="f7:129" file="f7" line="129"/>
  <Field id="_1219" name="sortAlbum" type="_992" offset="832" context="_655" access="public" location="f7:130" file="f7" line="130"/>
  <Field id="_1220" name="sortComposer" type="_992" offset="864" context="_655" access="public" location="f7:131" file="f7" line="131"/>
  <Field id="_1221" name="sortTVShow" type="_992" offset="896" context="_655" access="public" location="f7:132" file="f7" line="132"/>
  <Field id="_1222" name="artwork" type="_1331" offset="928" context="_655" access="public" location="f7:134" file="f7" line="134"/>
  <Field id="_1223" name="artworkCount" type="_401" offset="960" context="_655" access="public" location="f7:135" file="f7" line="135"/>
  <Field id="_1224" name="copyright" type="_992" offset="992" context="_655" access="public" location="f7:137" file="f7" line="137"/>
  <Field id="_1225" name="encodingTool" type="_992" offset="1024" context="_655" access="public" location="f7:138" file="f7" line="138"/>
  <Field id="_1226" name="encodedBy" type="_992" offset="1056" context="_655" access="public" location="f7:139" file="f7" line="139"/>
  <Field id="_1227" name="purchaseDate" type="_992" offset="1088" context="_655" access="public" location="f7:140" file="f7" line="140"/>
  <Field id="_1228" name="podcast" type="_1041" offset="1120" context="_655" access="public" location="f7:142" file="f7" line="142"/>
  <Field id="_1229" name="keywords" type="_992" offset="1152" context="_655" access="public" location="f7:143" file="f7" line="143"/>
  <Field id="_1230" name="category" type="_992" offset="1184" context="_655" access="public" location="f7:144" file="f7" line="144"/>
  <Field id="_1231" name="hdVideo" type="_1041" offset="1216" context="_655" access="public" location="f7:146" file="f7" line="146"/>
  <Field id="_1232" name="mediaType" type="_1041" offset="1248" context="_655" access="public" location="f7:147" file="f7" line="147"/>
  <Field id="_1233" name="contentRating" type="_1041" offset="1280" context="_655" access="public" location="f7:148" file="f7" line="148"/>
  <Field id="_1234" name="gapless" type="_1041" offset="1312" context="_655" access="public" location="f7:149" file="f7" line="149"/>
  <Field id="_1235" name="iTunesAccount" type="_992" offset="1344" context="_655" access="public" location="f7:151" file="f7" line="151"/>
  <Field id="_1236" name="iTunesAccountType" type="_1041" offset="1376" context="_655" access="public" location="f7:152" file="f7" line="152"/>
  <Field id="_1237" name="iTunesCountry" type="_1000" offset="1408" context="_655" access="public" location="f7:153" file="f7" line="153"/>
  <Field id="_1238" name="contentID" type="_1000" offset="1440" context="_655" access="public" location="f7:154" file="f7" line="154"/>
  <Field id="_1239" name="artistID" type="_1000" offset="1472" context="_655" access="public" location="f7:155" file="f7" line="155"/>
  <Field id="_1240" name="playlistID" type="_1086" offset="1504" context="_655" access="public" location="f7:156" file="f7" line="156"/>
  <Field id="_1241" name="genreID" type="_1000" offset="1536" context="_655" access="public" location="f7:157" file="f7" line="157"/>
  <Field id="_1242" name="composerID" type="_1000" offset="1568" context="_655" access="public" location="f7:158" file="f7" line="158"/>
  <Field id="_1243" name="xid" type="_992" offset="1600" context="_655" access="public" location="f7:159" file="f7" line="159"/>
  <Destructor id="_1244" name="MP4Tags_s" artificial="1" throw="" context="_655" access="public" mangled="_ZN9MP4Tags_sD1Ev *INTERNAL* " demangled="MP4Tags_s::~MP4Tags_s()" location="f7:99" file="f7" line="99" endline="99" inline="1">
  </Destructor>
  <OperatorMethod id="_1245" name="=" returns="_1332" artificial="1" throw="" context="_655" access="public" mangled="_ZN9MP4Tags_saSERKS_" demangled="MP4Tags_s::operator=(MP4Tags_s const&amp;)" location="f7:99" file="f7" line="99" endline="99" inline="1">
    <Argument type="_1333" location="f7:99" file="f7" line="99"/>
  </OperatorMethod>
  <Constructor id="_1246" name="MP4Tags_s" artificial="1" throw="" context="_655" access="public" mangled="_ZN9MP4Tags_sC1ERKS_ *INTERNAL* " demangled="MP4Tags_s::MP4Tags_s(MP4Tags_s const&amp;)" location="f7:99" file="f7" line="99" endline="99" inline="1">
    <Argument type="_1333" location="f7:99" file="f7" line="99"/>
  </Constructor>
  <Constructor id="_1247" name="MP4Tags_s" artificial="1" throw="" context="_655" access="public" mangled="_ZN9MP4Tags_sC1Ev *INTERNAL* " demangled="MP4Tags_s::MP4Tags_s()" location="f7:99" file="f7" line="99" inline="1"/>
  <CvQualifiedType id="_22c" type="_22" const="1"/>
  <PointerType id="_1249" type="_804" size="32" align="32"/>
  <CvQualifiedType id="_645r" type="_645" restrict="1"/>
  <Field id="_1252" name="index" type="_747" offset="0" context="_748" access="public" location="f7:76" file="f7" line="76"/>
  <Field id="_1253" name="total" type="_747" offset="16" context="_748" access="public" location="f7:77" file="f7" line="77"/>
  <Destructor id="_1254" name="MP4TagTrack_s" artificial="1" throw="" context="_748" access="public" mangled="_ZN13MP4TagTrack_sD1Ev *INTERNAL* " demangled="MP4TagTrack_s::~MP4TagTrack_s()" location="f7:75" file="f7" line="75" endline="75" inline="1">
  </Destructor>
  <OperatorMethod id="_1255" name="=" returns="_1334" artificial="1" throw="" context="_748" access="public" mangled="_ZN13MP4TagTrack_saSERKS_" demangled="MP4TagTrack_s::operator=(MP4TagTrack_s const&amp;)" location="f7:75" file="f7" line="75" endline="75" inline="1">
    <Argument type="_1335" location="f7:75" file="f7" line="75"/>
  </OperatorMethod>
  <Constructor id="_1256" name="MP4TagTrack_s" artificial="1" throw="" context="_748" access="public" mangled="_ZN13MP4TagTrack_sC1ERKS_ *INTERNAL* " demangled="MP4TagTrack_s::MP4TagTrack_s(MP4TagTrack_s const&amp;)" location="f7:75" file="f7" line="75" endline="75" inline="1">
    <Argument type="_1335" location="f7:75" file="f7" line="75"/>
  </Constructor>
  <Constructor id="_1257" name="MP4TagTrack_s" artificial="1" throw="" context="_748" access="public" mangled="_ZN13MP4TagTrack_sC1Ev *INTERNAL* " demangled="MP4TagTrack_s::MP4TagTrack_s()" location="f7:75" file="f7" line="75" inline="1"/>
  <PointerType id="_1258" type="_888" size="32" align="32"/>
  <PointerType id="_1259" type="_198" size="32" align="32"/>
  <PointerType id="_1260" type="_363" size="32" align="32"/>
  <CvQualifiedType id="_1260r" type="_1260" restrict="1"/>
  <CvQualifiedType id="_1107r" type="_1107" restrict="1"/>
  <ReferenceType id="_1267" type="_58" size="32" align="32"/>
  <ReferenceType id="_1268" type="_58c" size="32" align="32"/>
  <PointerType id="_1269" type="_967" size="32" align="32"/>
  <PointerType id="_1270" type="_984" size="32" align="32"/>
  <PointerType id="_1271" type="_686" size="32" align="32"/>
  <PointerType id="_1272" type="_187" size="32" align="32"/>
  <ReferenceType id="_1273" type="_69" size="32" align="32"/>
  <ReferenceType id="_1274" type="_69c" size="32" align="32"/>
  <PointerType id="_1277" type="_595" size="32" align="32"/>
  <ArrayType id="_1278" min="0" max="0u" type="_1105" size="8" align="8"/>
  <PointerType id="_1279" type="_99" size="32" align="32"/>
  <ArrayType id="_1280" min="0" max="39u" type="_1105" size="320" align="8"/>
  <ReferenceType id="_1281" type="_134" size="32" align="32"/>
  <ReferenceType id="_1282" type="_134c" size="32" align="32"/>
  <ReferenceType id="_1283" type="_136" size="32" align="32"/>
  <ReferenceType id="_1284" type="_136c" size="32" align="32"/>
  <ArrayType id="_1287" min="0" max="1023u" type="_1105" size="8192" align="8"/>
  <ReferenceType id="_1288" type="_197" size="32" align="32"/>
  <ReferenceType id="_1289" type="_197c" size="32" align="32"/>
  <ReferenceType id="_1291" type="_280" size="32" align="32"/>
  <ReferenceType id="_1292" type="_280c" size="32" align="32"/>
  <PointerType id="_1293" type="_1341" size="32" align="32"/>
  <PointerType id="_1294" type="_1342" size="32" align="32"/>
  <PointerType id="_1295" type="_1343" size="32" align="32"/>
  <PointerType id="_1296" type="_1344" size="32" align="32"/>
  <PointerType id="_1297" type="_186" size="32" align="32"/>
  <ReferenceType id="_1298" type="_322" size="32" align="32"/>
  <ReferenceType id="_1299" type="_322c" size="32" align="32"/>
  <ReferenceType id="_1301" type="_338" size="32" align="32"/>
  <ReferenceType id="_1302" type="_338c" size="32" align="32"/>
  <ReferenceType id="_1303" type="_362" size="32" align="32"/>
  <ReferenceType id="_1304" type="_362c" size="32" align="32"/>
  <ReferenceType id="_1305" type="_430" size="32" align="32"/>
  <ReferenceType id="_1306" type="_430c" size="32" align="32"/>
  <Field id="_1307" name="__wch" type="_17" offset="0" context="_1148" access="public" location="f20:89" file="f20" line="89"/>
  <Field id="_1308" name="__wchb" type="_1349" offset="0" context="_1148" access="public" location="f20:93" file="f20" line="93"/>
  <Destructor id="_1309" name="._2" artificial="1" throw="" context="_1148" access="public" mangled="_ZN11__mbstate_t3._2D1Ev *INTERNAL* " demangled="__mbstate_t::._2::~._2()" location="f20:87" file="f20" line="87" endline="87" inline="1">
  </Destructor>
  <OperatorMethod id="_1310" name="=" returns="_1350" artificial="1" throw="" context="_1148" access="public" mangled="_ZN11__mbstate_t3._2aSERKS0_" demangled="__mbstate_t::._2::operator=(__mbstate_t::._2 const&amp;)" location="f20:87" file="f20" line="87" endline="87" inline="1">
    <Argument type="_1351" location="f20:87" file="f20" line="87"/>
  </OperatorMethod>
  <Constructor id="_1311" artificial="1" throw="" context="_1148" access="public" mangled="_ZN11__mbstate_t3._2C1ERKS0_ *INTERNAL* " demangled="__mbstate_t::._2::._2(__mbstate_t::._2 const&amp;)" location="f20:87" file="f20" line="87" endline="87" inline="1">
    <Argument type="_1351" location="f20:87" file="f20" line="87"/>
  </Constructor>
  <Constructor id="_1312" artificial="1" throw="" context="_1148" access="public" mangled="_ZN11__mbstate_t3._2C1Ev *INTERNAL* " demangled="__mbstate_t::._2::._2()" location="f20:87" file="f20" line="87" inline="1"/>
  <ReferenceType id="_1313" type="_455" size="32" align="32"/>
  <ReferenceType id="_1314" type="_455c" size="32" align="32"/>
  <ReferenceType id="_1315" type="_466" size="32" align="32"/>
  <ReferenceType id="_1316" type="_466c" size="32" align="32"/>
  <PointerType id="_1318" type="_959" size="32" align="32"/>
  <ReferenceType id="_1319" type="_514" size="32" align="32"/>
  <ReferenceType id="_1320" type="_514c" size="32" align="32"/>
  <ArrayType id="_1323" min="0" max="1u" type="_116" size="64" align="32"/>
  <ReferenceType id="_1324" type="_582" size="32" align="32"/>
  <ReferenceType id="_1325" type="_582c" size="32" align="32"/>
  <ReferenceType id="_1326" type="_595" size="32" align="32"/>
  <ReferenceType id="_1327" type="_595c" size="32" align="32"/>
  <ReferenceType id="_1329" type="_619" size="32" align="32"/>
  <ReferenceType id="_1330" type="_619c" size="32" align="32"/>
  <PointerType id="_1331" type="_937c" size="32" align="32"/>
  <ReferenceType id="_1332" type="_655" size="32" align="32"/>
  <ReferenceType id="_1333" type="_655c" size="32" align="32"/>
  <ReferenceType id="_1334" type="_748" size="32" align="32"/>
  <ReferenceType id="_1335" type="_748c" size="32" align="32"/>
  <FundamentalType id="_1105" name="char" size="8" align="8"/>
  <ArrayType id="_1349" min="0" max="3u" type="_1105" size="32" align="8"/>
  <ReferenceType id="_1350" type="_1148" size="32" align="32"/>
  <ReferenceType id="_1351" type="_1148c" size="32" align="32"/>
  <CvQualifiedType id="_1105c" type="_1105" const="1"/>
  <CvQualifiedType id="_98c" type="_98" const="1"/>
  <CvQualifiedType id="_582c" type="_582" const="1"/>
  <CvQualifiedType id="_1148c" type="_1148" const="1"/>
  <CvQualifiedType id="_455c" type="_455" const="1"/>
  <CvQualifiedType id="_280c" type="_280" const="1"/>
  <CvQualifiedType id="_362c" type="_362" const="1"/>
  <CvQualifiedType id="_595c" type="_595" const="1"/>
  <CvQualifiedType id="_134c" type="_134" const="1"/>
  <CvQualifiedType id="_69c" type="_69" const="1"/>
  <CvQualifiedType id="_766c" type="_766" const="1"/>
  <CvQualifiedType id="_363c" type="_363" const="1"/>
  <FunctionType id="_1250" returns="_98">
    <Argument type="_583"/>
    <Argument type="_992"/>
    <Argument type="_286"/>
  </FunctionType>
  <FunctionType id="_1170" returns="_401">
    <Argument type="_401"/>
    <Argument type="_401"/>
    <Argument type="_1094"/>
    <Argument type="_1022"/>
    <Argument type="_1021"/>
  </FunctionType>
  <CvQualifiedType id="_792c" type="_792" const="1"/>
  <FunctionType id="_1341" returns="_645">
    <Argument type="_992"/>
    <Argument type="_114"/>
  </FunctionType>
