<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Typedef id="_980" name="uint64_t" type="_21" context="_1" location="f3:55" file="f3" line="55"/>
  <Function id="_981" name="__builtin_csin" returns="_1052" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_1052" location="f0:115" file="f0" line="115"/>
  </Function>
  <Variable id="_982" name="cpp_sym_MPEG4_STP_L1" type="_237c" init="81" context="_1" location="f1:47" file="f1" line="47" static="1"/>
  <Variable id="_983" name="cpp_sym_MPEG4_ASP_L3B" type="_237c" init="247" context="_1" location="f1:173" file="f1" line="173" static="1"/>
  <Typedef id="_984" name="__clock_t" type="_69" context="_1" location="f12:144" file="f12" line="144"/>
  <Function id="_985" name="MP4TagsSetITunesCountry" returns="_1006" context="_1" location="f6:279" file="f6" line="279" extern="1" attributes="visibility(default)">
    <Argument type="_1010" location="f6:279" file="f6" line="279"/>
    <Argument type="_1011" location="f6:279" file="f6" line="279"/>
  </Function>
  <Function id="_986" name="MP4SetAmrVendor" returns="_98" context="_1" location="f8:183" file="f8" line="183" extern="1" attributes="visibility(default)">
    <Argument name="hFile" type="_642" location="f8:183" file="f8" line="183"/>
    <Argument name="trackId" type="_743" location="f8:183" file="f8" line="183"/>
    <Argument name="vendor" type="_392" location="f8:183" file="f8" line="183"/>
  </Function>
  <Function id="_987" name="_IO_vfscanf" returns="_237" context="_1" location="f11:473" file="f11" line="473" extern="1">
    <Argument type="_1031r" location="f11:473" file="f11" line="473"/>
    <Argument type="_1002r" location="f11:473" file="f11" line="473"/>
    <Argument type="_1009" location="f11:473" file="f11" line="473"/>
    <Argument type="_1119r" location="f11:473" file="f11" line="473"/>
  </Function>
  <Variable id="_988" name="cpp_sym__POSIX_SOURCE" type="_237c" init="1" context="_1" location="f1:69" file="f1" line="69" static="1"/>
  <Function id="_989" name="_IO_ftrylockfile" returns="_237" throw="" context="_1" location="f11:455" file="f11" line="455" extern="1">
    <Argument type="_1031" location="f11:455" file="f11" line="455"/>
  </Function>
  <Typedef id="_990" name="__int32_t" type="_237" context="_1" location="f12:40" file="f12" line="40"/>
  <Typedef id="_991" name="__io_write_fn" type="_234" context="_1" location="f11:355" file="f11" line="355"/>
  <Function id="_992" name="MP4AddChapterTextTrack" returns="_743" context="_1" location="f18:70" file="f18" line="70" extern="1" attributes="visibility(default)">
    <Argument name="hFile" type="_642" location="f18:70" file="f18" line="70"/>
    <Argument name="refTrackId" type="_743" location="f18:70" file="f18" line="70"/>
    <Argument name="timescale" type="_392" location="f18:70" file="f18" line="70" default="0"/>
  </Function>
  <Function id="_993" name="MP4TagsSetEncodingTool" returns="_1006" context="_1" location="f6:264" file="f6" line="264" extern="1" attributes="visibility(default)">
    <Argument type="_1010" location="f6:264" file="f6" line="264"/>
    <Argument type="_1002" location="f6:264" file="f6" line="264"/>
  </Function>
  <Variable id="_994" name="cpp_sym__IO_IN_BACKUP" type="_237c" init="256" context="_1" location="f1:3" file="f1" line="3" static="1"/>
  <Function id="_995" name="MP4ItmfItemListFree" returns="_98" context="_1" location="f16:154" file="f16" line="154" extern="1" attributes="visibility(default)">
    <Argument name="itemList" type="_1053" location="f16:154" file="f16" line="154"/>
  </Function>
  <Variable id="_996" name="cpp_sym__STDC_PREDEF_H" type="_237c" init="1" context="_1" location="f1:193" file="f1" line="193" static="1"/>
  <Function id="_997" name="MP4AddHrefTrack" returns="_743" context="_1" location="f8:207" file="f8" line="207" extern="1" attributes="visibility(default)">
    <Argument name="hFile" type="_642" location="f8:207" file="f8" line="207"/>
    <Argument name="timeScale" type="_392" location="f8:207" file="f8" line="207"/>
    <Argument name="sampleDuration" type="_556" location="f8:207" file="f8" line="207"/>
    <Argument name="base_url" type="_1002" location="f8:207" file="f8" line="207" default="0l"/>
  </Function>
  <Function id="_998" name="MP4GetHintTrackReferenceTrackId" returns="_743" context="_1" location="f7:67" file="f7" line="67" extern="1" attributes="visibility(default)">
    <Argument name="hFile" type="_642" location="f7:67" file="f7" line="67"/>
    <Argument name="hintTrackId" type="_743" location="f7:67" file="f7" line="67"/>
  </Function>
  <PointerType id="_999" type="_1275" size="64" align="64"/>
  <Typedef id="_1000" name="__caddr_t" type="_999" context="_1" location="f12:193" file="f12" line="193"/>
  <FundamentalType id="_1001" name="double" size="64" align="64"/>
  <PointerType id="_1002" type="_1275c" size="64" align="64"/>
  <CvQualifiedType id="_237c" type="_237" const="1"/>
  <FundamentalType id="_1004" name="float" size="32" align="32"/>
  <FundamentalType id="_1005" name="long double" size="128" align="128"/>
  <FundamentalType id="_1006" name="bool" size="8" align="8"/>
  <PointerType id="_1007" type="_544" size="64" align="64"/>
  <CvQualifiedType id="_1002r" type="_1002" restrict="1"/>
  <PointerType id="_1009" type="_1117" size="64" align="64"/>
  <PointerType id="_1010" type="_838c" size="64" align="64"/>
  <PointerType id="_1011" type="_392c" size="64" align="64"/>
  <FundamentalType id="_1012" name="long long int" size="64" align="64"/>
  <FundamentalType id="_1013" name="complex float" size="64" align="32"/>
  <FundamentalType id="_1014" name="complex long double" size="256" align="128"/>
  <PointerType id="_1015" type="_1004" size="64" align="64"/>
  <PointerType id="_1016" type="_353" size="64" align="64"/>
  <PointerType id="_1017" type="_939" size="64" align="64"/>
  <PointerType id="_1018" type="_132c" size="64" align="64"/>
  <PointerType id="_1019" type="_1033" size="64" align="64"/>
  <PointerType id="_1020" type="_1034" size="64" align="64"/>
  <Field id="_1021" name="scheme_type" type="_392" offset="0" context="_57" access="public" location="f10:13" file="f10" line="13"/>
  <Field id="_1022" name="scheme_version" type="_747" offset="32" context="_57" access="public" location="f10:14" file="f10" line="14"/>
  <Field id="_1023" name="key_ind_len" type="_788" offset="48" context="_57" access="public" location="f10:15" file="f10" line="15"/>
  <Field id="_1024" name="iv_len" type="_788" offset="56" context="_57" access="public" location="f10:16" file="f10" line="16"/>
  <Field id="_1025" name="selective_enc" type="_788" offset="64" context="_57" access="public" location="f10:17" file="f10" line="17"/>
  <Field id="_1026" name="kms_uri" type="_1002" offset="128" context="_57" access="public" location="f10:18" file="f10" line="18"/>
  <Destructor id="_1027" name="mp4v2_ismacryp_session_params" artificial="1" throw="" context="_57" access="public" mangled="_ZN29mp4v2_ismacryp_session_paramsD1Ev *INTERNAL* " demangled="mp4v2_ismacryp_session_params::~mp4v2_ismacryp_session_params()" location="f10:12" file="f10" line="12" endline="12" inline="1">
  </Destructor>
  <OperatorMethod id="_1028" name="=" returns="_1280" artificial="1" throw="" context="_57" access="public" mangled="_ZN29mp4v2_ismacryp_session_paramsaSERKS_" demangled="mp4v2_ismacryp_session_params::operator=(mp4v2_ismacryp_session_params const&amp;)" location="f10:12" file="f10" line="12" endline="12" inline="1">
    <Argument type="_1281" location="f10:12" file="f10" line="12"/>
  </OperatorMethod>
  <Constructor id="_1029" name="mp4v2_ismacryp_session_params" artificial="1" throw="" context="_57" access="public" mangled="_ZN29mp4v2_ismacryp_session_paramsC1ERKS_ *INTERNAL* " demangled="mp4v2_ismacryp_session_params::mp4v2_ismacryp_session_params(mp4v2_ismacryp_session_params const&amp;)" location="f10:12" file="f10" line="12" endline="12" inline="1">
    <Argument type="_1281" location="f10:12" file="f10" line="12"/>
  </Constructor>
  <Constructor id="_1030" name="mp4v2_ismacryp_session_params" artificial="1" throw="" context="_57" access="public" mangled="_ZN29mp4v2_ismacryp_session_paramsC1Ev *INTERNAL* " demangled="mp4v2_ismacryp_session_params::mp4v2_ismacryp_session_params()" location="f10:12" file="f10" line="12" inline="1"/>
  <PointerType id="_1031" type="_132" size="64" align="64"/>
  <CvQualifiedType id="_999r" type="_999" restrict="1"/>
  <PointerType id="_1033" type="_1106" size="64" align="64"/>
  <PointerType id="_1034" type="_392" size="64" align="64"/>
  <Field id="_1035" name="read" type="_1282" offset="0" context="_68" access="public" location="f11:379" file="f11" line="379"/>
  <Field id="_1036" name="write" type="_1283" offset="64" context="_68" access="public" location="f11:380" file="f11" line="380"/>
  <Field id="_1037" name="seek" type="_1284" offset="128" context="_68" access="public" location="f11:381" file="f11" line="381"/>
  <Field id="_1038" name="close" type="_1285" offset="192" context="_68" access="public" location="f11:382" file="f11" line="382"/>
  <Destructor id="_1039" name="._5" artificial="1" throw="" context="_68" access="public" mangled="_ZN25_IO_cookie_io_functions_tD1Ev *INTERNAL* " demangled="_IO_cookie_io_functions_t::~_IO_cookie_io_functions_t()" location="f11:383" file="f11" line="383" endline="383" inline="1">
  </Destructor>
  <OperatorMethod id="_1040" name="=" returns="_1286" artificial="1" throw="" context="_68" access="public" mangled="_ZN25_IO_cookie_io_functions_taSERKS_" demangled="_IO_cookie_io_functions_t::operator=(_IO_cookie_io_functions_t const&amp;)" location="f11:383" file="f11" line="383" endline="383" inline="1">
    <Argument type="_1287" location="f11:378" file="f11" line="378"/>
  </OperatorMethod>
  <Constructor id="_1041" name="._5" artificial="1" throw="" context="_68" access="public" mangled="_ZN25_IO_cookie_io_functions_tC1ERKS_ *INTERNAL* " demangled="_IO_cookie_io_functions_t::_IO_cookie_io_functions_t(_IO_cookie_io_functions_t const&amp;)" location="f11:383" file="f11" line="383" endline="383" inline="1">
    <Argument type="_1287" location="f11:378" file="f11" line="378"/>
  </Constructor>
  <Constructor id="_1042" name="._5" artificial="1" throw="" context="_68" access="public" mangled="_ZN25_IO_cookie_io_functions_tC1Ev *INTERNAL* " demangled="_IO_cookie_io_functions_t::_IO_cookie_io_functions_t()" location="f11:383" file="f11" line="383" inline="1"/>
  <PointerType id="_1043" type="_301" size="64" align="64"/>
  <PointerType id="_1044" type="_556" size="64" align="64"/>
  <PointerType id="_1045" type="_1006" size="64" align="64"/>
  <PointerType id="_1046" type="_66" size="64" align="64"/>
  <CvQualifiedType id="_1046r" type="_1046" restrict="1"/>
  <CvQualifiedType id="_1007r" type="_1007" restrict="1"/>
  <PointerType id="_1049" type="_318c" size="64" align="64"/>
  <PointerType id="_1050" type="_999" size="64" align="64"/>
  <CvQualifiedType id="_1050r" type="_1050" restrict="1"/>
  <FundamentalType id="_1052" name="complex double" size="128" align="64"/>
  <PointerType id="_1053" type="_459" size="64" align="64"/>
  <PointerType id="_1054" type="_788c" size="64" align="64"/>
  <PointerType id="_1055" type="_650" size="64" align="64"/>
  <CvQualifiedType id="_1055r" type="_1055" restrict="1"/>
  <Field id="_1057" name="_flags" type="_237" offset="0" context="_132" access="public" location="f11:254" file="f11" line="254"/>
  <Field id="_1058" name="_IO_read_ptr" type="_999" offset="64" context="_132" access="public" location="f11:259" file="f11" line="259"/>
  <Field id="_1059" name="_IO_read_end" type="_999" offset="128" context="_132" access="public" location="f11:260" file="f11" line="260"/>
  <Field id="_1060" name="_IO_read_base" type="_999" offset="192" context="_132" access="public" location="f11:261" file="f11" line="261"/>
  <Field id="_1061" name="_IO_write_base" type="_999" offset="256" context="_132" access="public" location="f11:262" file="f11" line="262"/>
  <Field id="_1062" name="_IO_write_ptr" type="_999" offset="320" context="_132" access="public" location="f11:263" file="f11" line="263"/>
  <Field id="_1063" name="_IO_write_end" type="_999" offset="384" context="_132" access="public" location="f11:264" file="f11" line="264"/>
  <Field id="_1064" name="_IO_buf_base" type="_999" offset="448" context="_132" access="public" location="f11:265" file="f11" line="265"/>
  <Field id="_1065" name="_IO_buf_end" type="_999" offset="512" context="_132" access="public" location="f11:266" file="f11" line="266"/>
  <Field id="_1066" name="_IO_save_base" type="_999" offset="576" context="_132" access="public" location="f11:268" file="f11" line="268"/>
  <Field id="_1067" name="_IO_backup_base" type="_999" offset="640" context="_132" access="public" location="f11:269" file="f11" line="269"/>
  <Field id="_1068" name="_IO_save_end" type="_999" offset="704" context="_132" access="public" location="f11:270" file="f11" line="270"/>
  <Field id="_1069" name="_markers" type="_1290" offset="768" context="_132" access="public" location="f11:272" file="f11" line="272"/>
  <Field id="_1070" name="_chain" type="_1031" offset="832" context="_132" access="public" location="f11:274" file="f11" line="274"/>
  <Field id="_1071" name="_fileno" type="_237" offset="896" context="_132" access="public" location="f11:276" file="f11" line="276"/>
  <Field id="_1072" name="_flags2" type="_237" offset="928" context="_132" access="public" location="f11:280" file="f11" line="280"/>
  <Field id="_1073" name="_old_offset" type="_589" offset="960" context="_132" access="public" location="f11:282" file="f11" line="282"/>
  <Field id="_1074" name="_cur_column" type="_210" offset="1024" context="_132" access="public" location="f11:286" file="f11" line="286"/>
  <Field id="_1075" name="_vtable_offset" type="_187" offset="1040" context="_132" access="public" location="f11:287" file="f11" line="287"/>
  <Field id="_1076" name="_shortbuf" type="_1291" offset="1048" context="_132" access="public" location="f11:288" file="f11" line="288"/>
  <Field id="_1077" name="_lock" type="_1292" offset="1088" context="_132" access="public" location="f11:292" file="f11" line="292"/>
  <Field id="_1078" name="_offset" type="_799" offset="1152" context="_132" access="public" location="f11:301" file="f11" line="301"/>
  <Field id="_1079" name="__pad1" type="_641" offset="1216" context="_132" access="public" location="f11:310" file="f11" line="310"/>
  <Field id="_1080" name="__pad2" type="_641" offset="1280" context="_132" access="public" location="f11:311" file="f11" line="311"/>
  <Field id="_1081" name="__pad3" type="_641" offset="1344" context="_132" access="public" location="f11:312" file="f11" line="312"/>
  <Field id="_1082" name="__pad4" type="_641" offset="1408" context="_132" access="public" location="f11:313" file="f11" line="313"/>
  <Field id="_1083" name="__pad5" type="_650" offset="1472" context="_132" access="public" location="f11:314" file="f11" line="314"/>
  <Field id="_1084" name="_mode" type="_237" offset="1536" context="_132" access="public" location="f11:316" file="f11" line="316"/>
  <Field id="_1085" name="_unused2" type="_1293" offset="1568" context="_132" access="public" location="f11:318" file="f11" line="318"/>
  <Destructor id="_1086" name="_IO_FILE" artificial="1" throw="" context="_132" access="public" mangled="_ZN8_IO_FILED1Ev *INTERNAL* " demangled="_IO_FILE::~_IO_FILE()" location="f11:253" file="f11" line="253" endline="253" inline="1">
  </Destructor>
  <OperatorMethod id="_1087" name="=" returns="_1294" artificial="1" throw="" context="_132" access="public" mangled="_ZN8_IO_FILEaSERKS_" demangled="_IO_FILE::operator=(_IO_FILE const&amp;)" location="f11:253" file="f11" line="253" endline="253" inline="1">
    <Argument type="_1295" location="f11:253" file="f11" line="253"/>
  </OperatorMethod>
  <Constructor id="_1088" name="_IO_FILE" artificial="1" throw="" context="_132" access="public" mangled="_ZN8_IO_FILEC1ERKS_ *INTERNAL* " demangled="_IO_FILE::_IO_FILE(_IO_FILE const&amp;)" location="f11:253" file="f11" line="253" endline="253" inline="1">
    <Argument type="_1295" location="f11:253" file="f11" line="253"/>
  </Constructor>
  <Constructor id="_1089" name="_IO_FILE" artificial="1" throw="" context="_132" access="public" mangled="_ZN8_IO_FILEC1Ev *INTERNAL* " demangled="_IO_FILE::_IO_FILE()" location="f11:253" file="f11" line="253" inline="1"/>
  <Field id="_1090" name="data" type="_641" offset="0" context="_134" access="public" location="f6:69" file="f6" line="69"/>
  <Field id="_1091" name="size" type="_392" offset="64" context="_134" access="public" location="f6:70" file="f6" line="70"/>
  <Field id="_1092" name="type" type="_48" offset="96" context="_134" access="public" location="f6:71" file="f6" line="71"/>
  <Destructor id="_1093" name="MP4TagArtwork_s" artificial="1" throw="" context="_134" access="public" mangled="_ZN15MP4TagArtwork_sD1Ev *INTERNAL* " demangled="MP4TagArtwork_s::~MP4TagArtwork_s()" location="f6:68" file="f6" line="68" endline="68" inline="1">
  </Destructor>
  <OperatorMethod id="_1094" name="=" returns="_1296" artificial="1" throw="" context="_134" access="public" mangled="_ZN15MP4TagArtwork_saSERKS_" demangled="MP4TagArtwork_s::operator=(MP4TagArtwork_s const&amp;)" location="f6:68" file="f6" line="68" endline="68" inline="1">
    <Argument type="_1297" location="f6:68" file="f6" line="68"/>
  </OperatorMethod>
  <Constructor id="_1095" name="MP4TagArtwork_s" artificial="1" throw="" context="_134" access="public" mangled="_ZN15MP4TagArtwork_sC1ERKS_ *INTERNAL* " demangled="MP4TagArtwork_s::MP4TagArtwork_s(MP4TagArtwork_s const&amp;)" location="f6:68" file="f6" line="68" endline="68" inline="1">
    <Argument type="_1297" location="f6:68" file="f6" line="68"/>
  </Constructor>
  <Constructor id="_1096" name="MP4TagArtwork_s" artificial="1" throw="" context="_134" access="public" mangled="_ZN15MP4TagArtwork_sC1Ev *INTERNAL* " demangled="MP4TagArtwork_s::MP4TagArtwork_s()" location="f6:68" file="f6" line="68" inline="1"/>
  <PointerType id="_1097" type="_890c" size="64" align="64"/>
  <PointerType id="_1098" type="_980c" size="64" align="64"/>
  <Field id="_1099" name="duration" type="_556" offset="0" context="_191" access="public" location="f18:20" file="f18" line="20"/>
  <Field id="_1100" name="title" type="_1300" offset="64" context="_191" access="public" location="f18:21" file="f18" line="21"/>
  <Destructor id="_1101" name="MP4Chapter_s" artificial="1" throw="" context="_191" access="public" mangled="_ZN12MP4Chapter_sD1Ev *INTERNAL* " demangled="MP4Chapter_s::~MP4Chapter_s()" location="f18:19" file="f18" line="19" endline="19" inline="1">
  </Destructor>
  <OperatorMethod id="_1102" name="=" returns="_1301" artificial="1" throw="" context="_191" access="public" mangled="_ZN12MP4Chapter_saSERKS_" demangled="MP4Chapter_s::operator=(MP4Chapter_s const&amp;)" location="f18:19" file="f18" line="19" endline="19" inline="1">
    <Argument type="_1302" location="f18:19" file="f18" line="19"/>
  </OperatorMethod>
  <Constructor id="_1103" name="MP4Chapter_s" artificial="1" throw="" context="_191" access="public" mangled="_ZN12MP4Chapter_sC1ERKS_ *INTERNAL* " demangled="MP4Chapter_s::MP4Chapter_s(MP4Chapter_s const&amp;)" location="f18:19" file="f18" line="19" endline="19" inline="1">
    <Argument type="_1302" location="f18:19" file="f18" line="19"/>
  </Constructor>
  <Constructor id="_1104" name="MP4Chapter_s" artificial="1" throw="" context="_191" access="public" mangled="_ZN12MP4Chapter_sC1Ev *INTERNAL* " demangled="MP4Chapter_s::MP4Chapter_s()" location="f18:19" file="f18" line="19" inline="1"/>
  <PointerType id="_1105" type="_1002" size="64" align="64"/>
  <PointerType id="_1106" type="_788" size="64" align="64"/>
  <PointerType id="_1107" type="_98c" size="64" align="64"/>
  <CvQualifiedType id="_1107r" type="_1107" restrict="1"/>
  <CvQualifiedType id="_105c" type="_105" const="1"/>
  <CvQualifiedType id="_69c" type="_69" const="1"/>
  <Field id="_1111" name="__pos" type="_589" offset="0" context="_274" access="public" location="f17:24" file="f17" line="24"/>
  <Field id="_1112" name="__state" type="_446" offset="64" context="_274" access="public" location="f17:25" file="f17" line="25"/>
  <Destructor id="_1113" name="._3" artificial="1" throw="" context="_274" access="public" mangled="_ZN9_G_fpos_tD1Ev *INTERNAL* " demangled="_G_fpos_t::~_G_fpos_t()" location="f17:26" file="f17" line="26" endline="26" inline="1">
  </Destructor>
  <OperatorMethod id="_1114" name="=" returns="_1304" artificial="1" throw="" context="_274" access="public" mangled="_ZN9_G_fpos_taSERKS_" demangled="_G_fpos_t::operator=(_G_fpos_t const&amp;)" location="f17:26" file="f17" line="26" endline="26" inline="1">
    <Argument type="_1305" location="f17:23" file="f17" line="23"/>
  </OperatorMethod>
  <Constructor id="_1115" name="._3" artificial="1" throw="" context="_274" access="public" mangled="_ZN9_G_fpos_tC1ERKS_ *INTERNAL* " demangled="_G_fpos_t::_G_fpos_t(_G_fpos_t const&amp;)" location="f17:26" file="f17" line="26" endline="26" inline="1">
    <Argument type="_1305" location="f17:23" file="f17" line="23"/>
  </Constructor>
  <Constructor id="_1116" name="._3" artificial="1" throw="" context="_274" access="public" mangled="_ZN9_G_fpos_tC1Ev *INTERNAL* " demangled="_G_fpos_t::_G_fpos_t()" location="f17:26" file="f17" line="26" inline="1"/>
  <Struct id="_1117" name="__va_list_tag" context="_1" mangled="13__va_list_tag" demangled="__va_list_tag" location="f23:0" file="f23" line="0" size="192" align="64" members=""/>
  <PointerType id="_1118" type="_1271" size="64" align="64"/>
  <PointerType id="_1119" type="_237" size="64" align="64"/>
  <Field id="_1120" name="open" type="_1306" offset="0" context="_317" access="public" location="f14:38" file="f14" line="38"/>
  <Field id="_1121" name="seek" type="_1307" offset="64" context="_317" access="public" location="f14:39" file="f14" line="39"/>
  <Field id="_1122" name="read" type="_1308" offset="128" context="_317" access="public" location="f14:40" file="f14" line="40"/>
  <Field id="_1123" name="write" type="_1309" offset="192" context="_317" access="public" location="f14:41" file="f14" line="41"/>
  <Field id="_1124" name="close" type="_1310" offset="256" context="_317" access="public" location="f14:42" file="f14" line="42"/>
  <Destructor id="_1125" name="MP4FileProvider_s" artificial="1" throw="" context="_317" access="public" mangled="_ZN17MP4FileProvider_sD1Ev *INTERNAL* " demangled="MP4FileProvider_s::~MP4FileProvider_s()" location="f14:37" file="f14" line="37" endline="37" inline="1">
  </Destructor>
  <OperatorMethod id="_1126" name="=" returns="_1311" artificial="1" throw="" context="_317" access="public" mangled="_ZN17MP4FileProvider_saSERKS_" demangled="MP4FileProvider_s::operator=(MP4FileProvider_s const&amp;)" location="f14:37" file="f14" line="37" endline="37" inline="1">
    <Argument type="_1312" location="f14:37" file="f14" line="37"/>
  </OperatorMethod>
  <Constructor id="_1127" name="MP4FileProvider_s" artificial="1" throw="" context="_317" access="public" mangled="_ZN17MP4FileProvider_sC1ERKS_ *INTERNAL* " demangled="MP4FileProvider_s::MP4FileProvider_s(MP4FileProvider_s const&amp;)" location="f14:37" file="f14" line="37" endline="37" inline="1">
    <Argument type="_1312" location="f14:37" file="f14" line="37"/>
  </Constructor>
  <Constructor id="_1128" name="MP4FileProvider_s" artificial="1" throw="" context="_317" access="public" mangled="_ZN17MP4FileProvider_sC1Ev *INTERNAL* " demangled="MP4FileProvider_s::MP4FileProvider_s()" location="f14:37" file="f14" line="37" inline="1"/>
  <PointerType id="_1129" type="_980" size="64" align="64"/>
  <ArrayType id="_1130" min="0" max="" type="_1002" align="64"/>
  <CvQualifiedType id="_1130c" type="_1130" const="1"/>
  <PointerType id="_1132" type="_747c" size="64" align="64"/>
  <Field id="_1133" name="index" type="_747" offset="0" context="_332" access="public" location="f6:82" file="f6" line="82"/>
  <Field id="_1134" name="total" type="_747" offset="16" context="_332" access="public" location="f6:83" file="f6" line="83"/>
  <Destructor id="_1135" name="MP4TagDisk_s" artificial="1" throw="" context="_332" access="public" mangled="_ZN12MP4TagDisk_sD1Ev *INTERNAL* " demangled="MP4TagDisk_s::~MP4TagDisk_s()" location="f6:81" file="f6" line="81" endline="81" inline="1">
  </Destructor>
  <OperatorMethod id="_1136" name="=" returns="_1314" artificial="1" throw="" context="_332" access="public" mangled="_ZN12MP4TagDisk_saSERKS_" demangled="MP4TagDisk_s::operator=(MP4TagDisk_s const&amp;)" location="f6:81" file="f6" line="81" endline="81" inline="1">
    <Argument type="_1315" location="f6:81" file="f6" line="81"/>
  </OperatorMethod>
  <Constructor id="_1137" name="MP4TagDisk_s" artificial="1" throw="" context="_332" access="public" mangled="_ZN12MP4TagDisk_sC1ERKS_ *INTERNAL* " demangled="MP4TagDisk_s::MP4TagDisk_s(MP4TagDisk_s const&amp;)" location="f6:81" file="f6" line="81" endline="81" inline="1">
    <Argument type="_1315" location="f6:81" file="f6" line="81"/>
  </Constructor>
  <Constructor id="_1138" name="MP4TagDisk_s" artificial="1" throw="" context="_332" access="public" mangled="_ZN12MP4TagDisk_sC1Ev *INTERNAL* " demangled="MP4TagDisk_s::MP4TagDisk_s()" location="f6:81" file="f6" line="81" inline="1"/>
  <PointerType id="_1139" type="_820" size="64" align="64"/>
  <CvQualifiedType id="_1139r" type="_1139" restrict="1"/>
  <Field id="_1141" name="__pos" type="_799" offset="0" context="_356" access="public" location="f17:29" file="f17" line="29"/>
  <Field id="_1142" name="__state" type="_446" offset="64" context="_356" access="public" location="f17:30" file="f17" line="30"/>
  <Destructor id="_1143" name="._4" artificial="1" throw="" context="_356" access="public" mangled="_ZN11_G_fpos64_tD1Ev *INTERNAL* " demangled="_G_fpos64_t::~_G_fpos64_t()" location="f17:31" file="f17" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_1144" name="=" returns="_1316" artificial="1" throw="" context="_356" access="public" mangled="_ZN11_G_fpos64_taSERKS_" demangled="_G_fpos64_t::operator=(_G_fpos64_t const&amp;)" location="f17:31" file="f17" line="31" endline="31" inline="1">
    <Argument type="_1317" location="f17:28" file="f17" line="28"/>
  </OperatorMethod>
  <Constructor id="_1145" name="._4" artificial="1" throw="" context="_356" access="public" mangled="_ZN11_G_fpos64_tC1ERKS_ *INTERNAL* " demangled="_G_fpos64_t::_G_fpos64_t(_G_fpos64_t const&amp;)" location="f17:31" file="f17" line="31" endline="31" inline="1">
    <Argument type="_1317" location="f17:28" file="f17" line="28"/>
  </Constructor>
  <Constructor id="_1146" name="._4" artificial="1" throw="" context="_356" access="public" mangled="_ZN11_G_fpos64_tC1Ev *INTERNAL* " demangled="_G_fpos64_t::_G_fpos64_t()" location="f17:31" file="f17" line="31" inline="1"/>
  <PointerType id="_1147" type="_1005" size="64" align="64"/>
  <Field id="_1148" name="typeSetIdentifier" type="_788" offset="0" context="_421" access="public" location="f16:102" file="f16" line="102"/>
  <Field id="_1149" name="typeCode" type="_736" offset="32" context="_421" access="public" location="f16:103" file="f16" line="103"/>
  <Field id="_1150" name="locale" type="_392" offset="64" context="_421" access="public" location="f16:104" file="f16" line="104"/>
  <Field id="_1151" name="value" type="_1106" offset="128" context="_421" access="public" location="f16:105" file="f16" line="105"/>
  <Field id="_1152" name="valueSize" type="_392" offset="192" context="_421" access="public" location="f16:106" file="f16" line="106"/>
  <Destructor id="_1153" name="MP4ItmfData_s" artificial="1" throw="" context="_421" access="public" mangled="_ZN13MP4ItmfData_sD1Ev *INTERNAL* " demangled="MP4ItmfData_s::~MP4ItmfData_s()" location="f16:101" file="f16" line="101" endline="101" inline="1">
  </Destructor>
  <OperatorMethod id="_1154" name="=" returns="_1318" artificial="1" throw="" context="_421" access="public" mangled="_ZN13MP4ItmfData_saSERKS_" demangled="MP4ItmfData_s::operator=(MP4ItmfData_s const&amp;)" location="f16:101" file="f16" line="101" endline="101" inline="1">
    <Argument type="_1319" location="f16:101" file="f16" line="101"/>
  </OperatorMethod>
  <Constructor id="_1155" name="MP4ItmfData_s" artificial="1" throw="" context="_421" access="public" mangled="_ZN13MP4ItmfData_sC1ERKS_ *INTERNAL* " demangled="MP4ItmfData_s::MP4ItmfData_s(MP4ItmfData_s const&amp;)" location="f16:101" file="f16" line="101" endline="101" inline="1">
    <Argument type="_1319" location="f16:101" file="f16" line="101"/>
  </Constructor>
  <Constructor id="_1156" name="MP4ItmfData_s" artificial="1" throw="" context="_421" access="public" mangled="_ZN13MP4ItmfData_sC1Ev *INTERNAL* " demangled="MP4ItmfData_s::MP4ItmfData_s()" location="f16:101" file="f16" line="101" inline="1"/>
  <PointerType id="_1157" type="_747" size="64" align="64"/>
  <Field id="_1158" name="__count" type="_237" offset="0" context="_446" access="public" location="f20:84" file="f20" line="84"/>
  <Field id="_1159" name="__value" type="_1160" offset="32" context="_446" access="public" location="f20:93" file="f20" line="93"/>
  <Union id="_1160" context="_446" access="public" mangled="N11__mbstate_t3._2E" demangled="__mbstate_t::._2" location="f20:86" file="f20" line="86" artificial="1" size="32" align="32" members="_1320 _1321 _1322 _1323 _1324 _1325 " bases=""/>
  <Destructor id="_1161" name="._1" artificial="1" throw="" context="_446" access="public" mangled="_ZN11__mbstate_tD1Ev *INTERNAL* " demangled="__mbstate_t::~__mbstate_t()" location="f20:94" file="f20" line="94" endline="94" inline="1">
  </Destructor>
  <OperatorMethod id="_1162" name="=" returns="_1326" artificial="1" throw="" context="_446" access="public" mangled="_ZN11__mbstate_taSERKS_" demangled="__mbstate_t::operator=(__mbstate_t const&amp;)" location="f20:94" file="f20" line="94" endline="94" inline="1">
    <Argument type="_1327" location="f20:83" file="f20" line="83"/>
  </OperatorMethod>
  <Constructor id="_1163" name="._1" artificial="1" throw="" context="_446" access="public" mangled="_ZN11__mbstate_tC1ERKS_ *INTERNAL* " demangled="__mbstate_t::__mbstate_t(__mbstate_t const&amp;)" location="f20:94" file="f20" line="94" endline="94" inline="1">
    <Argument type="_1327" location="f20:83" file="f20" line="83"/>
  </Constructor>
  <Constructor id="_1164" name="._1" artificial="1" throw="" context="_446" access="public" mangled="_ZN11__mbstate_tC1Ev *INTERNAL* " demangled="__mbstate_t::__mbstate_t()" location="f20:94" file="f20" line="94" inline="1"/>
  <Field id="_1165" name="elements" type="_1194" offset="0" context="_458" access="public" location="f16:132" file="f16" line="132"/>
  <Field id="_1166" name="size" type="_392" offset="64" context="_458" access="public" location="f16:133" file="f16" line="133"/>
  <Destructor id="_1167" name="MP4ItmfItemList_s" artificial="1" throw="" context="_458" access="public" mangled="_ZN17MP4ItmfItemList_sD1Ev *INTERNAL* " demangled="MP4ItmfItemList_s::~MP4ItmfItemList_s()" location="f16:131" file="f16" line="131" endline="131" inline="1">
  </Destructor>
  <OperatorMethod id="_1168" name="=" returns="_1328" artificial="1" throw="" context="_458" access="public" mangled="_ZN17MP4ItmfItemList_saSERKS_" demangled="MP4ItmfItemList_s::operator=(MP4ItmfItemList_s const&amp;)" location="f16:131" file="f16" line="131" endline="131" inline="1">
    <Argument type="_1329" location="f16:131" file="f16" line="131"/>
  </OperatorMethod>
  <Constructor id="_1169" name="MP4ItmfItemList_s" artificial="1" throw="" context="_458" access="public" mangled="_ZN17MP4ItmfItemList_sC1ERKS_ *INTERNAL* " demangled="MP4ItmfItemList_s::MP4ItmfItemList_s(MP4ItmfItemList_s const&amp;)" location="f16:131" file="f16" line="131" endline="131" inline="1">
    <Argument type="_1329" location="f16:131" file="f16" line="131"/>
  </Constructor>
  <Constructor id="_1170" name="MP4ItmfItemList_s" artificial="1" throw="" context="_458" access="public" mangled="_ZN17MP4ItmfItemList_sC1Ev *INTERNAL* " demangled="MP4ItmfItemList_s::MP4ItmfItemList_s()" location="f16:131" file="f16" line="131" inline="1"/>
  <PointerType id="_1171" type="_820c" size="64" align="64"/>
  <CvQualifiedType id="_1031r" type="_1031" restrict="1"/>
  <Field id="_1173" name="elements" type="_1331" offset="0" context="_504" access="public" location="f16:112" file="f16" line="112"/>
  <Field id="_1174" name="size" type="_392" offset="64" context="_504" access="public" location="f16:113" file="f16" line="113"/>
  <Destructor id="_1175" name="MP4ItmfDataList_s" artificial="1" throw="" context="_504" access="public" mangled="_ZN17MP4ItmfDataList_sD1Ev *INTERNAL* " demangled="MP4ItmfDataList_s::~MP4ItmfDataList_s()" location="f16:111" file="f16" line="111" endline="111" inline="1">
  </Destructor>
  <OperatorMethod id="_1176" name="=" returns="_1332" artificial="1" throw="" context="_504" access="public" mangled="_ZN17MP4ItmfDataList_saSERKS_" demangled="MP4ItmfDataList_s::operator=(MP4ItmfDataList_s const&amp;)" location="f16:111" file="f16" line="111" endline="111" inline="1">
    <Argument type="_1333" location="f16:111" file="f16" line="111"/>
  </OperatorMethod>
  <Constructor id="_1177" name="MP4ItmfDataList_s" artificial="1" throw="" context="_504" access="public" mangled="_ZN17MP4ItmfDataList_sC1ERKS_ *INTERNAL* " demangled="MP4ItmfDataList_s::MP4ItmfDataList_s(MP4ItmfDataList_s const&amp;)" location="f16:111" file="f16" line="111" endline="111" inline="1">
    <Argument type="_1333" location="f16:111" file="f16" line="111"/>
  </Constructor>
  <Constructor id="_1178" name="MP4ItmfDataList_s" artificial="1" throw="" context="_504" access="public" mangled="_ZN17MP4ItmfDataList_sC1Ev *INTERNAL* " demangled="MP4ItmfDataList_s::MP4ItmfDataList_s()" location="f16:111" file="f16" line="111" inline="1"/>
  <PointerType id="_1179" type="_333c" size="64" align="64"/>
  <PointerType id="_1180" type="_357c" size="64" align="64"/>
  <Field id="_1182" name="__val" type="_1336" offset="0" context="_579" access="public" location="f12:143" file="f12" line="143"/>
  <Destructor id="_1183" name="._0" artificial="1" throw="" context="_579" access="public" mangled="_ZN8__fsid_tD1Ev *INTERNAL* " demangled="__fsid_t::~__fsid_t()" location="f12:143" file="f12" line="143" endline="143" inline="1">
  </Destructor>
  <OperatorMethod id="_1184" name="=" returns="_1337" artificial="1" throw="" context="_579" access="public" mangled="_ZN8__fsid_taSERKS_" demangled="__fsid_t::operator=(__fsid_t const&amp;)" location="f12:143" file="f12" line="143" endline="143" inline="1">
    <Argument type="_1338" location="f12:143" file="f12" line="143"/>
  </OperatorMethod>
  <Constructor id="_1185" name="._0" artificial="1" throw="" context="_579" access="public" mangled="_ZN8__fsid_tC1ERKS_ *INTERNAL* " demangled="__fsid_t::__fsid_t(__fsid_t const&amp;)" location="f12:143" file="f12" line="143" endline="143" inline="1">
    <Argument type="_1338" location="f12:143" file="f12" line="143"/>
  </Constructor>
  <Constructor id="_1186" name="._0" artificial="1" throw="" context="_579" access="public" mangled="_ZN8__fsid_tC1Ev *INTERNAL* " demangled="__fsid_t::__fsid_t()" location="f12:143" file="f12" line="143" inline="1"/>
  <Field id="_1187" name="_next" type="_1290" offset="0" context="_593" access="public" location="f11:169" file="f11" line="169"/>
  <Field id="_1188" name="_sbuf" type="_1031" offset="64" context="_593" access="public" location="f11:170" file="f11" line="170"/>
  <Field id="_1189" name="_pos" type="_237" offset="128" context="_593" access="public" location="f11:174" file="f11" line="174"/>
  <Destructor id="_1190" name="_IO_marker" artificial="1" throw="" context="_593" access="public" mangled="_ZN10_IO_markerD1Ev *INTERNAL* " demangled="_IO_marker::~_IO_marker()" location="f11:168" file="f11" line="168" endline="168" inline="1">
  </Destructor>
  <OperatorMethod id="_1191" name="=" returns="_1339" artificial="1" throw="" context="_593" access="public" mangled="_ZN10_IO_markeraSERKS_" demangled="_IO_marker::operator=(_IO_marker const&amp;)" location="f11:168" file="f11" line="168" endline="168" inline="1">
    <Argument type="_1340" location="f11:168" file="f11" line="168"/>
  </OperatorMethod>
  <Constructor id="_1192" name="_IO_marker" artificial="1" throw="" context="_593" access="public" mangled="_ZN10_IO_markerC1ERKS_ *INTERNAL* " demangled="_IO_marker::_IO_marker(_IO_marker const&amp;)" location="f11:168" file="f11" line="168" endline="168" inline="1">
    <Argument type="_1340" location="f11:168" file="f11" line="168"/>
  </Constructor>
  <Constructor id="_1193" name="_IO_marker" artificial="1" throw="" context="_593" access="public" mangled="_ZN10_IO_markerC1Ev *INTERNAL* " demangled="_IO_marker::_IO_marker()" location="f11:168" file="f11" line="168" inline="1"/>
  <PointerType id="_1194" type="_890" size="64" align="64"/>
  <PointerType id="_1195" type="_749c" size="64" align="64"/>
  <Field id="_1196" name="__handle" type="_641" offset="0" context="_617" access="public" location="f16:121" file="f16" line="121"/>
  <Field id="_1197" name="code" type="_999" offset="64" context="_617" access="public" location="f16:123" file="f16" line="123"/>
  <Field id="_1198" name="mean" type="_999" offset="128" context="_617" access="public" location="f16:124" file="f16" line="124"/>
  <Field id="_1199" name="name" type="_999" offset="192" context="_617" access="public" location="f16:125" file="f16" line="125"/>
  <Field id="_1200" name="dataList" type="_755" offset="256" context="_617" access="public" location="f16:126" file="f16" line="126"/>
  <Destructor id="_1201" name="MP4ItmfItem_s" artificial="1" throw="" context="_617" access="public" mangled="_ZN13MP4ItmfItem_sD1Ev *INTERNAL* " demangled="MP4ItmfItem_s::~MP4ItmfItem_s()" location="f16:120" file="f16" line="120" endline="120" inline="1">
  </Destructor>
  <OperatorMethod id="_1202" name="=" returns="_1342" artificial="1" throw="" context="_617" access="public" mangled="_ZN13MP4ItmfItem_saSERKS_" demangled="MP4ItmfItem_s::operator=(MP4ItmfItem_s const&amp;)" location="f16:120" file="f16" line="120" endline="120" inline="1">
    <Argument type="_1343" location="f16:120" file="f16" line="120"/>
  </OperatorMethod>
  <Constructor id="_1203" name="MP4ItmfItem_s" artificial="1" throw="" context="_617" access="public" mangled="_ZN13MP4ItmfItem_sC1ERKS_ *INTERNAL* " demangled="MP4ItmfItem_s::MP4ItmfItem_s(MP4ItmfItem_s const&amp;)" location="f16:120" file="f16" line="120" endline="120" inline="1">
    <Argument type="_1343" location="f16:120" file="f16" line="120"/>
  </Constructor>
  <Constructor id="_1204" name="MP4ItmfItem_s" artificial="1" throw="" context="_617" access="public" mangled="_ZN13MP4ItmfItem_sC1Ev *INTERNAL* " demangled="MP4ItmfItem_s::MP4ItmfItem_s()" location="f16:120" file="f16" line="120" inline="1"/>
  <Field id="_1205" name="__handle" type="_641" offset="0" context="_651" access="public" location="f6:100" file="f6" line="100"/>
  <Field id="_1206" name="name" type="_1002" offset="64" context="_651" access="public" location="f6:102" file="f6" line="102"/>
  <Field id="_1207" name="artist" type="_1002" offset="128" context="_651" access="public" location="f6:103" file="f6" line="103"/>
  <Field id="_1208" name="albumArtist" type="_1002" offset="192" context="_651" access="public" location="f6:104" file="f6" line="104"/>
  <Field id="_1209" name="album" type="_1002" offset="256" context="_651" access="public" location="f6:105" file="f6" line="105"/>
  <Field id="_1210" name="grouping" type="_1002" offset="320" context="_651" access="public" location="f6:106" file="f6" line="106"/>
  <Field id="_1211" name="composer" type="_1002" offset="384" context="_651" access="public" location="f6:107" file="f6" line="107"/>
  <Field id="_1212" name="comments" type="_1002" offset="448" context="_651" access="public" location="f6:108" file="f6" line="108"/>
  <Field id="_1213" name="genre" type="_1002" offset="512" context="_651" access="public" location="f6:109" file="f6" line="109"/>
  <Field id="_1214" name="genreType" type="_1132" offset="576" context="_651" access="public" location="f6:110" file="f6" line="110"/>
  <Field id="_1215" name="releaseDate" type="_1002" offset="640" context="_651" access="public" location="f6:111" file="f6" line="111"/>
  <Field id="_1216" name="track" type="_1195" offset="704" context="_651" access="public" location="f6:112" file="f6" line="112"/>
  <Field id="_1217" name="disk" type="_1179" offset="768" context="_651" access="public" location="f6:113" file="f6" line="113"/>
  <Field id="_1218" name="tempo" type="_1132" offset="832" context="_651" access="public" location="f6:114" file="f6" line="114"/>
  <Field id="_1219" name="compilation" type="_1054" offset="896" context="_651" access="public" location="f6:115" file="f6" line="115"/>
  <Field id="_1220" name="tvShow" type="_1002" offset="960" context="_651" access="public" location="f6:117" file="f6" line="117"/>
  <Field id="_1221" name="tvNetwork" type="_1002" offset="1024" context="_651" access="public" location="f6:118" file="f6" line="118"/>
  <Field id="_1222" name="tvEpisodeID" type="_1002" offset="1088" context="_651" access="public" location="f6:119" file="f6" line="119"/>
  <Field id="_1223" name="tvSeason" type="_1011" offset="1152" context="_651" access="public" location="f6:120" file="f6" line="120"/>
  <Field id="_1224" name="tvEpisode" type="_1011" offset="1216" context="_651" access="public" location="f6:121" file="f6" line="121"/>
  <Field id="_1225" name="description" type="_1002" offset="1280" context="_651" access="public" location="f6:123" file="f6" line="123"/>
  <Field id="_1226" name="longDescription" type="_1002" offset="1344" context="_651" access="public" location="f6:124" file="f6" line="124"/>
  <Field id="_1227" name="lyrics" type="_1002" offset="1408" context="_651" access="public" location="f6:125" file="f6" line="125"/>
  <Field id="_1228" name="sortName" type="_1002" offset="1472" context="_651" access="public" location="f6:127" file="f6" line="127"/>
  <Field id="_1229" name="sortArtist" type="_1002" offset="1536" context="_651" access="public" location="f6:128" file="f6" line="128"/>
  <Field id="_1230" name="sortAlbumArtist" type="_1002" offset="1600" context="_651" access="public" location="f6:129" file="f6" line="129"/>
  <Field id="_1231" name="sortAlbum" type="_1002" offset="1664" context="_651" access="public" location="f6:130" file="f6" line="130"/>
  <Field id="_1232" name="sortComposer" type="_1002" offset="1728" context="_651" access="public" location="f6:131" file="f6" line="131"/>
  <Field id="_1233" name="sortTVShow" type="_1002" offset="1792" context="_651" access="public" location="f6:132" file="f6" line="132"/>
  <Field id="_1234" name="artwork" type="_1344" offset="1856" context="_651" access="public" location="f6:134" file="f6" line="134"/>
  <Field id="_1235" name="artworkCount" type="_392" offset="1920" context="_651" access="public" location="f6:135" file="f6" line="135"/>
  <Field id="_1236" name="copyright" type="_1002" offset="1984" context="_651" access="public" location="f6:137" file="f6" line="137"/>
  <Field id="_1237" name="encodingTool" type="_1002" offset="2048" context="_651" access="public" location="f6:138" file="f6" line="138"/>
  <Field id="_1238" name="encodedBy" type="_1002" offset="2112" context="_651" access="public" location="f6:139" file="f6" line="139"/>
  <Field id="_1239" name="purchaseDate" type="_1002" offset="2176" context="_651" access="public" location="f6:140" file="f6" line="140"/>
  <Field id="_1240" name="podcast" type="_1054" offset="2240" context="_651" access="public" location="f6:142" file="f6" line="142"/>
  <Field id="_1241" name="keywords" type="_1002" offset="2304" context="_651" access="public" location="f6:143" file="f6" line="143"/>
  <Field id="_1242" name="category" type="_1002" offset="2368" context="_651" access="public" location="f6:144" file="f6" line="144"/>
  <Field id="_1243" name="hdVideo" type="_1054" offset="2432" context="_651" access="public" location="f6:146" file="f6" line="146"/>
  <Field id="_1244" name="mediaType" type="_1054" offset="2496" context="_651" access="public" location="f6:147" file="f6" line="147"/>
  <Field id="_1245" name="contentRating" type="_1054" offset="2560" context="_651" access="public" location="f6:148" file="f6" line="148"/>
  <Field id="_1246" name="gapless" type="_1054" offset="2624" context="_651" access="public" location="f6:149" file="f6" line="149"/>
  <Field id="_1247" name="iTunesAccount" type="_1002" offset="2688" context="_651" access="public" location="f6:151" file="f6" line="151"/>
  <Field id="_1248" name="iTunesAccountType" type="_1054" offset="2752" context="_651" access="public" location="f6:152" file="f6" line="152"/>
  <Field id="_1249" name="iTunesCountry" type="_1011" offset="2816" context="_651" access="public" location="f6:153" file="f6" line="153"/>
  <Field id="_1250" name="contentID" type="_1011" offset="2880" context="_651" access="public" location="f6:154" file="f6" line="154"/>
  <Field id="_1251" name="artistID" type="_1011" offset="2944" context="_651" access="public" location="f6:155" file="f6" line="155"/>
  <Field id="_1252" name="playlistID" type="_1098" offset="3008" context="_651" access="public" location="f6:156" file="f6" line="156"/>
  <Field id="_1253" name="genreID" type="_1011" offset="3072" context="_651" access="public" location="f6:157" file="f6" line="157"/>
  <Field id="_1254" name="composerID" type="_1011" offset="3136" context="_651" access="public" location="f6:158" file="f6" line="158"/>
  <Field id="_1255" name="xid" type="_1002" offset="3200" context="_651" access="public" location="f6:159" file="f6" line="159"/>
  <Destructor id="_1256" name="MP4Tags_s" artificial="1" throw="" context="_651" access="public" mangled="_ZN9MP4Tags_sD1Ev *INTERNAL* " demangled="MP4Tags_s::~MP4Tags_s()" location="f6:99" file="f6" line="99" endline="99" inline="1">
  </Destructor>
  <OperatorMethod id="_1257" name="=" returns="_1345" artificial="1" throw="" context="_651" access="public" mangled="_ZN9MP4Tags_saSERKS_" demangled="MP4Tags_s::operator=(MP4Tags_s const&amp;)" location="f6:99" file="f6" line="99" endline="99" inline="1">
    <Argument type="_1346" location="f6:99" file="f6" line="99"/>
  </OperatorMethod>
  <Constructor id="_1258" name="MP4Tags_s" artificial="1" throw="" context="_651" access="public" mangled="_ZN9MP4Tags_sC1ERKS_ *INTERNAL* " demangled="MP4Tags_s::MP4Tags_s(MP4Tags_s const&amp;)" location="f6:99" file="f6" line="99" endline="99" inline="1">
    <Argument type="_1346" location="f6:99" file="f6" line="99"/>
  </Constructor>
  <Constructor id="_1259" name="MP4Tags_s" artificial="1" throw="" context="_651" access="public" mangled="_ZN9MP4Tags_sC1Ev *INTERNAL* " demangled="MP4Tags_s::MP4Tags_s()" location="f6:99" file="f6" line="99" inline="1"/>
  <CvQualifiedType id="_21c" type="_21" const="1"/>
  <PointerType id="_1261" type="_799" size="64" align="64"/>
  <CvQualifiedType id="_641r" type="_641" restrict="1"/>
  <Field id="_1264" name="index" type="_747" offset="0" context="_748" access="public" location="f6:76" file="f6" line="76"/>
  <Field id="_1265" name="total" type="_747" offset="16" context="_748" access="public" location="f6:77" file="f6" line="77"/>
  <Destructor id="_1266" name="MP4TagTrack_s" artificial="1" throw="" context="_748" access="public" mangled="_ZN13MP4TagTrack_sD1Ev *INTERNAL* " demangled="MP4TagTrack_s::~MP4TagTrack_s()" location="f6:75" file="f6" line="75" endline="75" inline="1">
  </Destructor>
  <OperatorMethod id="_1267" name="=" returns="_1347" artificial="1" throw="" context="_748" access="public" mangled="_ZN13MP4TagTrack_saSERKS_" demangled="MP4TagTrack_s::operator=(MP4TagTrack_s const&amp;)" location="f6:75" file="f6" line="75" endline="75" inline="1">
    <Argument type="_1348" location="f6:75" file="f6" line="75"/>
  </OperatorMethod>
  <Constructor id="_1268" name="MP4TagTrack_s" artificial="1" throw="" context="_748" access="public" mangled="_ZN13MP4TagTrack_sC1ERKS_ *INTERNAL* " demangled="MP4TagTrack_s::MP4TagTrack_s(MP4TagTrack_s const&amp;)" location="f6:75" file="f6" line="75" endline="75" inline="1">
    <Argument type="_1348" location="f6:75" file="f6" line="75"/>
  </Constructor>
  <Constructor id="_1269" name="MP4TagTrack_s" artificial="1" throw="" context="_748" access="public" mangled="_ZN13MP4TagTrack_sC1Ev *INTERNAL* " demangled="MP4TagTrack_s::MP4TagTrack_s()" location="f6:75" file="f6" line="75" inline="1"/>
  <PointerType id="_1270" type="_888" size="64" align="64"/>
  <PointerType id="_1271" type="_192" size="64" align="64"/>
  <PointerType id="_1272" type="_357" size="64" align="64"/>
  <CvQualifiedType id="_1272r" type="_1272" restrict="1"/>
  <CvQualifiedType id="_1119r" type="_1119" restrict="1"/>
  <ReferenceType id="_1280" type="_57" size="64" align="64"/>
  <ReferenceType id="_1281" type="_57c" size="64" align="64"/>
  <PointerType id="_1282" type="_974" size="64" align="64"/>
  <PointerType id="_1283" type="_991" size="64" align="64"/>
  <PointerType id="_1284" type="_686" size="64" align="64"/>
  <PointerType id="_1285" type="_181" size="64" align="64"/>
  <ReferenceType id="_1286" type="_68" size="64" align="64"/>
  <ReferenceType id="_1287" type="_68c" size="64" align="64"/>
  <PointerType id="_1290" type="_593" size="64" align="64"/>
  <ArrayType id="_1291" min="0" max="0u" type="_1275" size="8" align="8"/>
  <PointerType id="_1292" type="_99" size="64" align="64"/>
  <ArrayType id="_1293" min="0" max="19u" type="_1275" size="160" align="8"/>
  <ReferenceType id="_1294" type="_132" size="64" align="64"/>
  <ReferenceType id="_1295" type="_132c" size="64" align="64"/>
  <ReferenceType id="_1296" type="_134" size="64" align="64"/>
  <ReferenceType id="_1297" type="_134c" size="64" align="64"/>
  <ArrayType id="_1300" min="0" max="1023u" type="_1275" size="8192" align="8"/>
  <ReferenceType id="_1301" type="_191" size="64" align="64"/>
  <ReferenceType id="_1302" type="_191c" size="64" align="64"/>
  <ReferenceType id="_1304" type="_274" size="64" align="64"/>
  <ReferenceType id="_1305" type="_274c" size="64" align="64"/>
  <PointerType id="_1306" type="_1354" size="64" align="64"/>
  <PointerType id="_1307" type="_1355" size="64" align="64"/>
  <PointerType id="_1308" type="_1356" size="64" align="64"/>
  <PointerType id="_1309" type="_1357" size="64" align="64"/>
  <PointerType id="_1310" type="_180" size="64" align="64"/>
  <ReferenceType id="_1311" type="_317" size="64" align="64"/>
  <ReferenceType id="_1312" type="_317c" size="64" align="64"/>
  <ReferenceType id="_1314" type="_332" size="64" align="64"/>
  <ReferenceType id="_1315" type="_332c" size="64" align="64"/>
  <ReferenceType id="_1316" type="_356" size="64" align="64"/>
  <ReferenceType id="_1317" type="_356c" size="64" align="64"/>
  <ReferenceType id="_1318" type="_421" size="64" align="64"/>
  <ReferenceType id="_1319" type="_421c" size="64" align="64"/>
  <Field id="_1320" name="__wch" type="_105" offset="0" context="_1160" access="public" location="f20:88" file="f20" line="88"/>
  <Field id="_1321" name="__wchb" type="_1362" offset="0" context="_1160" access="public" location="f20:92" file="f20" line="92"/>
  <Destructor id="_1322" name="._2" artificial="1" throw="" context="_1160" access="public" mangled="_ZN11__mbstate_t3._2D1Ev *INTERNAL* " demangled="__mbstate_t::._2::~._2()" location="f20:86" file="f20" line="86" endline="86" inline="1">
  </Destructor>
  <OperatorMethod id="_1323" name="=" returns="_1363" artificial="1" throw="" context="_1160" access="public" mangled="_ZN11__mbstate_t3._2aSERKS0_" demangled="__mbstate_t::._2::operator=(__mbstate_t::._2 const&amp;)" location="f20:86" file="f20" line="86" endline="86" inline="1">
    <Argument type="_1364" location="f20:86" file="f20" line="86"/>
  </OperatorMethod>
  <Constructor id="_1324" artificial="1" throw="" context="_1160" access="public" mangled="_ZN11__mbstate_t3._2C1ERKS0_ *INTERNAL* " demangled="__mbstate_t::._2::._2(__mbstate_t::._2 const&amp;)" location="f20:86" file="f20" line="86" endline="86" inline="1">
    <Argument type="_1364" location="f20:86" file="f20" line="86"/>
  </Constructor>
  <Constructor id="_1325" artificial="1" throw="" context="_1160" access="public" mangled="_ZN11__mbstate_t3._2C1Ev *INTERNAL* " demangled="__mbstate_t::._2::._2()" location="f20:86" file="f20" line="86" inline="1"/>
  <ReferenceType id="_1326" type="_446" size="64" align="64"/>
  <ReferenceType id="_1327" type="_446c" size="64" align="64"/>
  <ReferenceType id="_1328" type="_458" size="64" align="64"/>
  <ReferenceType id="_1329" type="_458c" size="64" align="64"/>
  <PointerType id="_1331" type="_965" size="64" align="64"/>
  <ReferenceType id="_1332" type="_504" size="64" align="64"/>
  <ReferenceType id="_1333" type="_504c" size="64" align="64"/>
  <ArrayType id="_1336" min="0" max="1u" type="_237" size="64" align="32"/>
  <ReferenceType id="_1337" type="_579" size="64" align="64"/>
  <ReferenceType id="_1338" type="_579c" size="64" align="64"/>
  <ReferenceType id="_1339" type="_593" size="64" align="64"/>
  <ReferenceType id="_1340" type="_593c" size="64" align="64"/>
  <ReferenceType id="_1342" type="_617" size="64" align="64"/>
  <ReferenceType id="_1343" type="_617c" size="64" align="64"/>
  <PointerType id="_1344" type="_939c" size="64" align="64"/>
  <ReferenceType id="_1345" type="_651" size="64" align="64"/>
  <ReferenceType id="_1346" type="_651c" size="64" align="64"/>
  <ReferenceType id="_1347" type="_748" size="64" align="64"/>
  <ReferenceType id="_1348" type="_748c" size="64" align="64"/>
  <FundamentalType id="_1275" name="char" size="8" align="8"/>
  <ArrayType id="_1362" min="0" max="3u" type="_1275" size="32" align="8"/>
  <ReferenceType id="_1363" type="_1160" size="64" align="64"/>
  <ReferenceType id="_1364" type="_1160c" size="64" align="64"/>
  <CvQualifiedType id="_1275c" type="_1275" const="1"/>
  <CvQualifiedType id="_98c" type="_98" const="1"/>
  <CvQualifiedType id="_579c" type="_579" const="1"/>
  <CvQualifiedType id="_1160c" type="_1160" const="1"/>
  <CvQualifiedType id="_446c" type="_446" const="1"/>
  <CvQualifiedType id="_274c" type="_274" const="1"/>
  <CvQualifiedType id="_356c" type="_356" const="1"/>
  <CvQualifiedType id="_593c" type="_593" const="1"/>
  <CvQualifiedType id="_132c" type="_132" const="1"/>
  <CvQualifiedType id="_68c" type="_68" const="1"/>
  <CvQualifiedType id="_820c" type="_820" const="1"/>
  <CvQualifiedType id="_357c" type="_357" const="1"/>
  <FunctionType id="_1262" returns="_98">
    <Argument type="_580"/>
    <Argument type="_1002"/>
    <Argument type="_1009"/>
  </FunctionType>
  <FunctionType id="_1181" returns="_392">
    <Argument type="_392"/>
    <Argument type="_392"/>
    <Argument type="_1106"/>
    <Argument type="_1034"/>
    <Argument type="_1033"/>
  </FunctionType>
  <CvQualifiedType id="_788c" type="_788" const="1"/>
  <FunctionType id="_1354" returns="_641">
    <Argument type="_1002"/>
    <Argument type="_114"/>
  </FunctionType>
