<?xml version="1.0"?>
<GCC_XML version="0.9.0" cvs_revision="1.136">

  <Function id="_366" name="VC_SetNumVoices" returns="_395" context="_1" location="f9:847" file="f9" line="847" extern="1" mangled="_Z15VC_SetNumVoices"/>
  <Function id="_367" name="VC_SampleSpace" returns="_189" context="_1" location="f9:848" file="f9" line="848" extern="1" mangled="_Z14VC_SampleSpace">
    <Argument type="_395" location="f9:848" file="f9" line="848"/>
  </Function>
  <Function id="_368" name="VC_SampleLength" returns="_189" context="_1" location="f9:849" file="f9" line="849" extern="1" mangled="_Z15VC_SampleLength">
    <Argument type="_395" location="f9:849" file="f9" line="849"/>
    <Argument type="_537" location="f9:849" file="f9" line="849"/>
  </Function>
  <Function id="_369" name="VC_PlayStart" returns="_395" context="_1" location="f9:851" file="f9" line="851" extern="1" mangled="_Z12VC_PlayStart"/>
  <Function id="_370" name="VC_PlayStop" returns="_437" context="_1" location="f9:852" file="f9" line="852" extern="1" mangled="_Z11VC_PlayStop"/>
  <Function id="_371" name="VC_SampleLoad" returns="_186" context="_1" location="f9:854" file="f9" line="854" extern="1" mangled="_Z13VC_SampleLoad">
    <Argument type="_637" location="f9:854" file="f9" line="854"/>
    <Argument type="_395" location="f9:854" file="f9" line="854"/>
  </Function>
  <Function id="_372" name="VC_SampleUnload" returns="_437" context="_1" location="f9:855" file="f9" line="855" extern="1" mangled="_Z15VC_SampleUnload">
    <Argument type="_186" location="f9:855" file="f9" line="855"/>
  </Function>
  <Function id="_373" name="VC_WriteBytes" returns="_189" context="_1" location="f9:857" file="f9" line="857" extern="1" mangled="_Z13VC_WriteBytes">
    <Argument type="_638" location="f9:857" file="f9" line="857"/>
    <Argument type="_189" location="f9:857" file="f9" line="857"/>
  </Function>
  <Function id="_374" name="VC_SilenceBytes" returns="_189" context="_1" location="f9:858" file="f9" line="858" extern="1" mangled="_Z15VC_SilenceBytes">
    <Argument type="_638" location="f9:858" file="f9" line="858"/>
    <Argument type="_189" location="f9:858" file="f9" line="858"/>
  </Function>
  <Function id="_375" name="VC_VoiceSetVolume" returns="_437" context="_1" location="f9:860" file="f9" line="860" extern="1" mangled="_Z17VC_VoiceSetVolume">
    <Argument type="_185" location="f9:860" file="f9" line="860"/>
    <Argument type="_187" location="f9:860" file="f9" line="860"/>
  </Function>
  <Function id="_376" name="VC_VoiceGetVolume" returns="_187" context="_1" location="f9:861" file="f9" line="861" extern="1" mangled="_Z17VC_VoiceGetVolume">
    <Argument type="_185" location="f9:861" file="f9" line="861"/>
  </Function>
  <Function id="_377" name="VC_VoiceSetFrequency" returns="_437" context="_1" location="f9:862" file="f9" line="862" extern="1" mangled="_Z20VC_VoiceSetFrequency">
    <Argument type="_185" location="f9:862" file="f9" line="862"/>
    <Argument type="_189" location="f9:862" file="f9" line="862"/>
  </Function>
  <Function id="_378" name="VC_VoiceGetFrequency" returns="_189" context="_1" location="f9:863" file="f9" line="863" extern="1" mangled="_Z20VC_VoiceGetFrequency">
    <Argument type="_185" location="f9:863" file="f9" line="863"/>
  </Function>
  <Function id="_379" name="VC_VoiceSetPanning" returns="_437" context="_1" location="f9:864" file="f9" line="864" extern="1" mangled="_Z18VC_VoiceSetPanning">
    <Argument type="_185" location="f9:864" file="f9" line="864"/>
    <Argument type="_189" location="f9:864" file="f9" line="864"/>
  </Function>
  <Function id="_380" name="VC_VoiceGetPanning" returns="_189" context="_1" location="f9:865" file="f9" line="865" extern="1" mangled="_Z18VC_VoiceGetPanning">
    <Argument type="_185" location="f9:865" file="f9" line="865"/>
  </Function>
  <Function id="_381" name="VC_VoicePlay" returns="_437" context="_1" location="f9:866" file="f9" line="866" extern="1" mangled="_Z12VC_VoicePlay">
    <Argument type="_185" location="f9:866" file="f9" line="866"/>
    <Argument type="_186" location="f9:866" file="f9" line="866"/>
    <Argument type="_189" location="f9:866" file="f9" line="866"/>
    <Argument type="_189" location="f9:866" file="f9" line="866"/>
    <Argument type="_189" location="f9:866" file="f9" line="866"/>
    <Argument type="_189" location="f9:866" file="f9" line="866"/>
    <Argument type="_187" location="f9:866" file="f9" line="866"/>
  </Function>
  <Function id="_382" name="VC_VoiceStop" returns="_437" context="_1" location="f9:868" file="f9" line="868" extern="1" mangled="_Z12VC_VoiceStop">
    <Argument type="_185" location="f9:868" file="f9" line="868"/>
  </Function>
  <Function id="_383" name="VC_VoiceStopped" returns="_183" context="_1" location="f9:869" file="f9" line="869" extern="1" mangled="_Z15VC_VoiceStopped">
    <Argument type="_185" location="f9:869" file="f9" line="869"/>
  </Function>
  <Function id="_384" name="VC_VoiceGetPosition" returns="_188" context="_1" location="f9:870" file="f9" line="870" extern="1" mangled="_Z19VC_VoiceGetPosition">
    <Argument type="_185" location="f9:870" file="f9" line="870"/>
  </Function>
  <Function id="_385" name="VC_VoiceRealVolume" returns="_189" context="_1" location="f9:871" file="f9" line="871" extern="1" mangled="_Z18VC_VoiceRealVolume">
    <Argument type="_185" location="f9:871" file="f9" line="871"/>
  </Function>
  <FundamentalType id="_386" name="__int128" size="128" align="128"/>
  <FundamentalType id="_387" name="unsigned __int128" size="128" align="128"/>
  <ArrayType id="_388" min="0" max="0" type="_639"/>
  <FundamentalType id="_389" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_390" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_391" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_392" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_393" name="signed char" size="8" align="8"/>
  <FundamentalType id="_394" name="short int" size="16" align="16"/>
  <FundamentalType id="_395" name="int" size="32" align="32"/>
  <FundamentalType id="_396" name="long int" size="64" align="64"/>
  <Field id="_397" name="__val" type="_640" context="_30" access="public" location="f2:134" file="f2" line="134" offset="0"/>
  <PointerType id="_398" type="_437"/>
  <CvQualifiedType id="_398r" type="_398" restrict="1"/>
  <PointerType id="_399" type="_18"/>
  <PointerType id="_400" type="_464"/>
  <CvQualifiedType id="_400r" type="_400" restrict="1"/>
  <Field id="_401" name="_flags" type="_395" context="_59" access="public" location="f3:242" file="f3" line="242" offset="0"/>
  <Field id="_402" name="_IO_read_ptr" type="_400" context="_59" access="public" location="f3:247" file="f3" line="247" offset="64"/>
  <Field id="_403" name="_IO_read_end" type="_400" context="_59" access="public" location="f3:248" file="f3" line="248" offset="128"/>
  <Field id="_404" name="_IO_read_base" type="_400" context="_59" access="public" location="f3:249" file="f3" line="249" offset="192"/>
  <Field id="_405" name="_IO_write_base" type="_400" context="_59" access="public" location="f3:250" file="f3" line="250" offset="256"/>
  <Field id="_406" name="_IO_write_ptr" type="_400" context="_59" access="public" location="f3:251" file="f3" line="251" offset="320"/>
  <Field id="_407" name="_IO_write_end" type="_400" context="_59" access="public" location="f3:252" file="f3" line="252" offset="384"/>
  <Field id="_408" name="_IO_buf_base" type="_400" context="_59" access="public" location="f3:253" file="f3" line="253" offset="448"/>
  <Field id="_409" name="_IO_buf_end" type="_400" context="_59" access="public" location="f3:254" file="f3" line="254" offset="512"/>
  <Field id="_410" name="_IO_save_base" type="_400" context="_59" access="public" location="f3:256" file="f3" line="256" offset="576"/>
  <Field id="_411" name="_IO_backup_base" type="_400" context="_59" access="public" location="f3:257" file="f3" line="257" offset="640"/>
  <Field id="_412" name="_IO_save_end" type="_400" context="_59" access="public" location="f3:258" file="f3" line="258" offset="704"/>
  <Field id="_413" name="_markers" type="_641" context="_59" access="public" location="f3:260" file="f3" line="260" offset="768"/>
  <Field id="_414" name="_chain" type="_449" context="_59" access="public" location="f3:262" file="f3" line="262" offset="832"/>
  <Field id="_415" name="_fileno" type="_395" context="_59" access="public" location="f3:264" file="f3" line="264" offset="896"/>
  <Field id="_416" name="_flags2" type="_395" context="_59" access="public" location="f3:268" file="f3" line="268" offset="928"/>
  <Field id="_417" name="_old_offset" type="_27" context="_59" access="public" location="f3:270" file="f3" line="270" offset="960"/>
  <Field id="_418" name="_cur_column" type="_391" context="_59" access="public" location="f3:274" file="f3" line="274" offset="1024"/>
  <Field id="_419" name="_vtable_offset" type="_393" context="_59" access="public" location="f3:275" file="f3" line="275" offset="1040"/>
  <Field id="_420" name="_shortbuf" type="_642" context="_59" access="public" location="f3:276" file="f3" line="276" offset="1048"/>
  <Field id="_421" name="_lock" type="_643" context="_59" access="public" location="f3:280" file="f3" line="280" offset="1088"/>
  <Field id="_422" name="_offset" type="_28" context="_59" access="public" location="f3:289" file="f3" line="289" offset="1152"/>
  <Field id="_423" name="__pad1" type="_398" context="_59" access="public" location="f3:297" file="f3" line="297" offset="1216"/>
  <Field id="_424" name="__pad2" type="_398" context="_59" access="public" location="f3:298" file="f3" line="298" offset="1280"/>
  <Field id="_425" name="__pad3" type="_398" context="_59" access="public" location="f3:299" file="f3" line="299" offset="1344"/>
  <Field id="_426" name="__pad4" type="_398" context="_59" access="public" location="f3:300" file="f3" line="300" offset="1408"/>
  <Field id="_427" name="__pad5" type="_5" context="_59" access="public" location="f3:302" file="f3" line="302" offset="1472"/>
  <Field id="_428" name="_mode" type="_395" context="_59" access="public" location="f3:303" file="f3" line="303" offset="1536"/>
  <Field id="_429" name="_unused2" type="_644" context="_59" access="public" location="f3:305" file="f3" line="305" offset="1568"/>
  <Field id="_430" name="__count" type="_395" context="_62" access="public" location="f5:84" file="f5" line="84" offset="0"/>
  <Union id="_431" name="" context="_62" access="public" location="f5:85" file="f5" line="85" members="_645 _646" size="32" align="32"/>
  <Field id="_432" name="__value" type="_431" context="_62" access="public" location="f5:93" file="f5" line="93" offset="32"/>
  <Field id="_433" name="__pos" type="_27" context="_64" access="public" location="f6:23" file="f6" line="23" offset="0"/>
  <Field id="_434" name="__state" type="_63" context="_64" access="public" location="f6:24" file="f6" line="24" offset="64"/>
  <Field id="_435" name="__pos" type="_28" context="_66" access="public" location="f6:28" file="f6" line="28" offset="0"/>
  <Field id="_436" name="__state" type="_63" context="_66" access="public" location="f6:29" file="f6" line="29" offset="64"/>
  <FundamentalType id="_437" name="void" size="0" align="8"/>
  <Field id="_438" name="_next" type="_641" context="_72" access="public" location="f3:157" file="f3" line="157" offset="0"/>
  <Field id="_439" name="_sbuf" type="_449" context="_72" access="public" location="f3:158" file="f3" line="158" offset="64"/>
  <Field id="_440" name="_pos" type="_395" context="_72" access="public" location="f3:162" file="f3" line="162" offset="128"/>
  <FunctionType id="_441" returns="_51">
    <Argument type="_398"/>
    <Argument type="_400"/>
    <Argument type="_5"/>
  </FunctionType>
  <FunctionType id="_442" returns="_51">
    <Argument type="_398"/>
    <Argument type="_446"/>
    <Argument type="_5"/>
  </FunctionType>
  <FunctionType id="_443" returns="_395">
    <Argument type="_398"/>
    <Argument type="_647"/>
    <Argument type="_395"/>
  </FunctionType>
  <FunctionType id="_444" returns="_395">
    <Argument type="_398"/>
  </FunctionType>
  <PointerType id="_445" type="_74"/>
  <CvQualifiedType id="_445r" type="_445" restrict="1"/>
  <PointerType id="_446" type="_464c"/>
  <CvQualifiedType id="_446r" type="_446" restrict="1"/>
  <PointerType id="_447" type="_639"/>
  <PointerType id="_448" type="_395"/>
  <CvQualifiedType id="_448r" type="_448" restrict="1"/>
  <PointerType id="_449" type="_59"/>
  <PointerType id="_450" type="_60"/>
  <CvQualifiedType id="_450r" type="_450" restrict="1"/>
  <PointerType id="_451" type="_437c"/>
  <CvQualifiedType id="_437c" type="_437" const="1"/>
  <CvQualifiedType id="_451r" type="_451" restrict="1"/>
  <PointerType id="_452" type="_101"/>
  <CvQualifiedType id="_452r" type="_452" restrict="1"/>
  <PointerType id="_453" type="_101c"/>
  <CvQualifiedType id="_101c" type="_101" const="1"/>
  <Field id="_454" name="quot" type="_395" context="_147" access="public" location="f8:99" file="f8" line="99" offset="0"/>
  <Field id="_455" name="rem" type="_395" context="_147" access="public" location="f8:100" file="f8" line="100" offset="32"/>
  <Field id="_456" name="quot" type="_396" context="_149" access="public" location="f8:107" file="f8" line="107" offset="0"/>
  <Field id="_457" name="rem" type="_396" context="_149" access="public" location="f8:108" file="f8" line="108" offset="64"/>
  <FundamentalType id="_458" name="double" size="64" align="64"/>
  <PointerType id="_459" type="_400"/>
  <CvQualifiedType id="_459r" type="_459" restrict="1"/>
  <PointerType id="_460" type="_466"/>
  <PointerType id="_461" type="_648"/>
  <PointerType id="_462" type="_146"/>
  <CvQualifiedType id="_462r" type="_462" restrict="1"/>
  <PointerType id="_463" type="_146c"/>
  <CvQualifiedType id="_146c" type="_146" const="1"/>
  <CvQualifiedType id="_463r" type="_463" restrict="1"/>
  <FundamentalType id="_464" name="char" size="8" align="8"/>
  <CvQualifiedType id="_464c" type="_464" const="1"/>
  <ArrayType id="_465" min="0" max="0" type="_395"/>
  <FunctionType id="_466" returns="_437"/>
  <PointerType id="_467" type="_192"/>
  <Field id="_468" name="next" type="_501" context="_198" access="public" location="f9:741" file="f9" line="741" offset="0"/>
  <Field id="_469" name="Name" type="_502" context="_198" access="public" location="f9:742" file="f9" line="742" offset="64"/>
  <Field id="_470" name="Version" type="_502" context="_198" access="public" location="f9:743" file="f9" line="743" offset="128"/>
  <Field id="_471" name="HardVoiceLimit" type="_185" context="_198" access="public" location="f9:745" file="f9" line="745" offset="192"/>
  <Field id="_472" name="SoftVoiceLimit" type="_185" context="_198" access="public" location="f9:746" file="f9" line="746" offset="200"/>
  <Field id="_473" name="Alias" type="_502" context="_198" access="public" location="f9:748" file="f9" line="748" offset="256"/>
  <Field id="_474" name="CmdLineHelp" type="_502" context="_198" access="public" location="f9:749" file="f9" line="749" offset="320"/>
  <Field id="_475" name="CommandLine" type="_649" context="_198" access="public" location="f9:751" file="f9" line="751" offset="384"/>
  <Field id="_476" name="IsPresent" type="_650" context="_198" access="public" location="f9:752" file="f9" line="752" offset="448"/>
  <Field id="_477" name="SampleLoad" type="_651" context="_198" access="public" location="f9:753" file="f9" line="753" offset="512"/>
  <Field id="_478" name="SampleUnload" type="_652" context="_198" access="public" location="f9:754" file="f9" line="754" offset="576"/>
  <Field id="_479" name="FreeSampleSpace" type="_653" context="_198" access="public" location="f9:755" file="f9" line="755" offset="640"/>
  <Field id="_480" name="RealSampleLength" type="_654" context="_198" access="public" location="f9:756" file="f9" line="756" offset="704"/>
  <Field id="_481" name="Init" type="_655" context="_198" access="public" location="f9:757" file="f9" line="757" offset="768"/>
  <Field id="_482" name="Exit" type="_460" context="_198" access="public" location="f9:758" file="f9" line="758" offset="832"/>
  <Field id="_483" name="Reset" type="_655" context="_198" access="public" location="f9:759" file="f9" line="759" offset="896"/>
  <Field id="_484" name="SetNumVoices" type="_655" context="_198" access="public" location="f9:760" file="f9" line="760" offset="960"/>
  <Field id="_485" name="PlayStart" type="_655" context="_198" access="public" location="f9:761" file="f9" line="761" offset="1024"/>
  <Field id="_486" name="PlayStop" type="_460" context="_198" access="public" location="f9:762" file="f9" line="762" offset="1088"/>
  <Field id="_487" name="Update" type="_460" context="_198" access="public" location="f9:763" file="f9" line="763" offset="1152"/>
  <Field id="_488" name="Pause" type="_460" context="_198" access="public" location="f9:764" file="f9" line="764" offset="1216"/>
  <Field id="_489" name="VoiceSetVolume" type="_656" context="_198" access="public" location="f9:765" file="f9" line="765" offset="1280"/>
  <Field id="_490" name="VoiceGetVolume" type="_657" context="_198" access="public" location="f9:766" file="f9" line="766" offset="1344"/>
  <Field id="_491" name="VoiceSetFrequency" type="_658" context="_198" access="public" location="f9:767" file="f9" line="767" offset="1408"/>
  <Field id="_492" name="VoiceGetFrequency" type="_659" context="_198" access="public" location="f9:768" file="f9" line="768" offset="1472"/>
  <Field id="_493" name="VoiceSetPanning" type="_658" context="_198" access="public" location="f9:769" file="f9" line="769" offset="1536"/>
  <Field id="_494" name="VoiceGetPanning" type="_659" context="_198" access="public" location="f9:770" file="f9" line="770" offset="1600"/>
  <Field id="_495" name="VoicePlay" type="_660" context="_198" access="public" location="f9:771" file="f9" line="771" offset="1664"/>
  <Field id="_496" name="VoiceStop" type="_661" context="_198" access="public" location="f9:772" file="f9" line="772" offset="1728"/>
  <Field id="_497" name="VoiceStopped" type="_662" context="_198" access="public" location="f9:773" file="f9" line="773" offset="1792"/>
  <Field id="_498" name="VoiceGetPosition" type="_663" context="_198" access="public" location="f9:774" file="f9" line="774" offset="1856"/>
  <Field id="_499" name="VoiceRealVolume" type="_659" context="_198" access="public" location="f9:775" file="f9" line="775" offset="1920"/>
  <PointerType id="_500" type="_182"/>
  <PointerType id="_501" type="_198"/>
  <PointerType id="_502" type="_182c"/>
  <CvQualifiedType id="_182c" type="_182" const="1"/>
  <Field id="_503" name="Seek" type="_664" context="_220" access="public" location="f9:347" file="f9" line="347" offset="0"/>
  <Field id="_504" name="Tell" type="_665" context="_220" access="public" location="f9:348" file="f9" line="348" offset="64"/>
  <Field id="_505" name="Read" type="_666" context="_220" access="public" location="f9:349" file="f9" line="349" offset="128"/>
  <Field id="_506" name="Get" type="_667" context="_220" access="public" location="f9:350" file="f9" line="350" offset="192"/>
  <Field id="_507" name="Eof" type="_668" context="_220" access="public" location="f9:351" file="f9" line="351" offset="256"/>
  <Field id="_508" name="iobase" type="_396" context="_220" access="public" location="f9:352" file="f9" line="352" offset="320"/>
  <Field id="_509" name="prev_iobase" type="_396" context="_220" access="public" location="f9:353" file="f9" line="353" offset="384"/>
  <Field id="_510" name="Seek" type="_669" context="_222" access="public" location="f9:357" file="f9" line="357" offset="0"/>
  <Field id="_511" name="Tell" type="_670" context="_222" access="public" location="f9:358" file="f9" line="358" offset="64"/>
  <Field id="_512" name="Write" type="_671" context="_222" access="public" location="f9:359" file="f9" line="359" offset="128"/>
  <Field id="_513" name="Put" type="_672" context="_222" access="public" location="f9:360" file="f9" line="360" offset="192"/>
  <Field id="_514" name="panning" type="_186" context="_224" access="public" location="f9:405" file="f9" line="405" offset="0"/>
  <Field id="_515" name="speed" type="_189" context="_224" access="public" location="f9:406" file="f9" line="406" offset="32"/>
  <Field id="_516" name="volume" type="_185" context="_224" access="public" location="f9:407" file="f9" line="407" offset="64"/>
  <Field id="_517" name="inflags" type="_187" context="_224" access="public" location="f9:408" file="f9" line="408" offset="80"/>
  <Field id="_518" name="flags" type="_187" context="_224" access="public" location="f9:409" file="f9" line="409" offset="96"/>
  <Field id="_519" name="length" type="_189" context="_224" access="public" location="f9:410" file="f9" line="410" offset="128"/>
  <Field id="_520" name="loopstart" type="_189" context="_224" access="public" location="f9:411" file="f9" line="411" offset="160"/>
  <Field id="_521" name="loopend" type="_189" context="_224" access="public" location="f9:412" file="f9" line="412" offset="192"/>
  <Field id="_522" name="susbegin" type="_189" context="_224" access="public" location="f9:413" file="f9" line="413" offset="224"/>
  <Field id="_523" name="susend" type="_189" context="_224" access="public" location="f9:414" file="f9" line="414" offset="256"/>
  <Field id="_524" name="globvol" type="_185" context="_224" access="public" location="f9:417" file="f9" line="417" offset="288"/>
  <Field id="_525" name="vibflags" type="_185" context="_224" access="public" location="f9:418" file="f9" line="418" offset="296"/>
  <Field id="_526" name="vibtype" type="_185" context="_224" access="public" location="f9:419" file="f9" line="419" offset="304"/>
  <Field id="_527" name="vibsweep" type="_185" context="_224" access="public" location="f9:420" file="f9" line="420" offset="312"/>
  <Field id="_528" name="vibdepth" type="_185" context="_224" access="public" location="f9:421" file="f9" line="421" offset="320"/>
  <Field id="_529" name="vibrate" type="_185" context="_224" access="public" location="f9:422" file="f9" line="422" offset="328"/>
  <Field id="_530" name="samplename" type="_500" context="_224" access="public" location="f9:423" file="f9" line="423" offset="384"/>
  <Field id="_531" name="avibpos" type="_187" context="_224" access="public" location="f9:426" file="f9" line="426" offset="448"/>
  <Field id="_532" name="divfactor" type="_185" context="_224" access="public" location="f9:427" file="f9" line="427" offset="464"/>
  <Field id="_533" name="seekpos" type="_189" context="_224" access="public" location="f9:428" file="f9" line="428" offset="480"/>
  <Field id="_534" name="handle" type="_186" context="_224" access="public" location="f9:429" file="f9" line="429" offset="512"/>
  <Field id="_535" name="onfree" type="_673" context="_224" access="public" location="f9:430" file="f9" line="430" offset="576"/>
  <Field id="_536" name="ctx" type="_398" context="_224" access="public" location="f9:431" file="f9" line="431" offset="640"/>
  <PointerType id="_537" type="_225"/>
  <PointerType id="_538" type="_221"/>
  <Field id="_539" name="pos" type="_186" context="_247" access="public" location="f9:474" file="f9" line="474" offset="0"/>
  <Field id="_540" name="val" type="_186" context="_247" access="public" location="f9:475" file="f9" line="475" offset="16"/>
  <Field id="_541" name="insname" type="_500" context="_249" access="public" location="f9:483" file="f9" line="483" offset="0"/>
  <Field id="_542" name="flags" type="_185" context="_249" access="public" location="f9:485" file="f9" line="485" offset="64"/>
  <Field id="_543" name="samplenumber" type="_674" context="_249" access="public" location="f9:486" file="f9" line="486" offset="80"/>
  <Field id="_544" name="samplenote" type="_675" context="_249" access="public" location="f9:487" file="f9" line="487" offset="2000"/>
  <Field id="_545" name="nnatype" type="_185" context="_249" access="public" location="f9:489" file="f9" line="489" offset="2960"/>
  <Field id="_546" name="dca" type="_185" context="_249" access="public" location="f9:490" file="f9" line="490" offset="2968"/>
  <Field id="_547" name="dct" type="_185" context="_249" access="public" location="f9:491" file="f9" line="491" offset="2976"/>
  <Field id="_548" name="globvol" type="_185" context="_249" access="public" location="f9:492" file="f9" line="492" offset="2984"/>
  <Field id="_549" name="volfade" type="_187" context="_249" access="public" location="f9:493" file="f9" line="493" offset="2992"/>
  <Field id="_550" name="panning" type="_186" context="_249" access="public" location="f9:494" file="f9" line="494" offset="3008"/>
  <Field id="_551" name="pitpansep" type="_185" context="_249" access="public" location="f9:496" file="f9" line="496" offset="3024"/>
  <Field id="_552" name="pitpancenter" type="_185" context="_249" access="public" location="f9:497" file="f9" line="497" offset="3032"/>
  <Field id="_553" name="rvolvar" type="_185" context="_249" access="public" location="f9:498" file="f9" line="498" offset="3040"/>
  <Field id="_554" name="rpanvar" type="_185" context="_249" access="public" location="f9:499" file="f9" line="499" offset="3048"/>
  <Field id="_555" name="volflg" type="_185" context="_249" access="public" location="f9:502" file="f9" line="502" offset="3056"/>
  <Field id="_556" name="volpts" type="_185" context="_249" access="public" location="f9:503" file="f9" line="503" offset="3064"/>
  <Field id="_557" name="volsusbeg" type="_185" context="_249" access="public" location="f9:504" file="f9" line="504" offset="3072"/>
  <Field id="_558" name="volsusend" type="_185" context="_249" access="public" location="f9:505" file="f9" line="505" offset="3080"/>
  <Field id="_559" name="volbeg" type="_185" context="_249" access="public" location="f9:506" file="f9" line="506" offset="3088"/>
  <Field id="_560" name="volend" type="_185" context="_249" access="public" location="f9:507" file="f9" line="507" offset="3096"/>
  <Field id="_561" name="volenv" type="_676" context="_249" access="public" location="f9:508" file="f9" line="508" offset="3104"/>
  <Field id="_562" name="panflg" type="_185" context="_249" access="public" location="f9:510" file="f9" line="510" offset="4128"/>
  <Field id="_563" name="panpts" type="_185" context="_249" access="public" location="f9:511" file="f9" line="511" offset="4136"/>
  <Field id="_564" name="pansusbeg" type="_185" context="_249" access="public" location="f9:512" file="f9" line="512" offset="4144"/>
  <Field id="_565" name="pansusend" type="_185" context="_249" access="public" location="f9:513" file="f9" line="513" offset="4152"/>
  <Field id="_566" name="panbeg" type="_185" context="_249" access="public" location="f9:514" file="f9" line="514" offset="4160"/>
  <Field id="_567" name="panend" type="_185" context="_249" access="public" location="f9:515" file="f9" line="515" offset="4168"/>
  <Field id="_568" name="panenv" type="_676" context="_249" access="public" location="f9:516" file="f9" line="516" offset="4176"/>
  <Field id="_569" name="pitflg" type="_185" context="_249" access="public" location="f9:518" file="f9" line="518" offset="5200"/>
  <Field id="_570" name="pitpts" type="_185" context="_249" access="public" location="f9:519" file="f9" line="519" offset="5208"/>
  <Field id="_571" name="pitsusbeg" type="_185" context="_249" access="public" location="f9:520" file="f9" line="520" offset="5216"/>
  <Field id="_572" name="pitsusend" type="_185" context="_249" access="public" location="f9:521" file="f9" line="521" offset="5224"/>
  <Field id="_573" name="pitbeg" type="_185" context="_249" access="public" location="f9:522" file="f9" line="522" offset="5232"/>
  <Field id="_574" name="pitend" type="_185" context="_249" access="public" location="f9:523" file="f9" line="523" offset="5240"/>
  <Field id="_575" name="pitenv" type="_676" context="_249" access="public" location="f9:524" file="f9" line="524" offset="5248"/>
  <Field id="_576" name="songname" type="_500" context="_253" access="public" location="f9:555" file="f9" line="555" offset="0"/>
  <Field id="_577" name="modtype" type="_500" context="_253" access="public" location="f9:556" file="f9" line="556" offset="64"/>
  <Field id="_578" name="comment" type="_500" context="_253" access="public" location="f9:557" file="f9" line="557" offset="128"/>
  <Field id="_579" name="flags" type="_187" context="_253" access="public" location="f9:559" file="f9" line="559" offset="192"/>
  <Field id="_580" name="numchn" type="_185" context="_253" access="public" location="f9:560" file="f9" line="560" offset="208"/>
  <Field id="_581" name="numvoices" type="_185" context="_253" access="public" location="f9:561" file="f9" line="561" offset="216"/>
  <Field id="_582" name="numpos" type="_187" context="_253" access="public" location="f9:562" file="f9" line="562" offset="224"/>
  <Field id="_583" name="numpat" type="_187" context="_253" access="public" location="f9:563" file="f9" line="563" offset="240"/>
  <Field id="_584" name="numins" type="_187" context="_253" access="public" location="f9:564" file="f9" line="564" offset="256"/>
  <Field id="_585" name="numsmp" type="_187" context="_253" access="public" location="f9:565" file="f9" line="565" offset="272"/>
  <Field id="_586" name="instruments" type="_677" context="_253" access="public" location="f9:567" file="f9" line="567" offset="320"/>
  <Field id="_587" name="samples" type="_678" context="_253" access="public" location="f9:568" file="f9" line="568" offset="384"/>
  <Field id="_588" name="realchn" type="_185" context="_253" access="public" location="f9:570" file="f9" line="570" offset="448"/>
  <Field id="_589" name="totalchn" type="_185" context="_253" access="public" location="f9:571" file="f9" line="571" offset="456"/>
  <Field id="_590" name="reppos" type="_187" context="_253" access="public" location="f9:574" file="f9" line="574" offset="464"/>
  <Field id="_591" name="initspeed" type="_185" context="_253" access="public" location="f9:575" file="f9" line="575" offset="480"/>
  <Field id="_592" name="inittempo" type="_187" context="_253" access="public" location="f9:576" file="f9" line="576" offset="496"/>
  <Field id="_593" name="initvolume" type="_185" context="_253" access="public" location="f9:577" file="f9" line="577" offset="512"/>
  <Field id="_594" name="panning" type="_679" context="_253" access="public" location="f9:578" file="f9" line="578" offset="528"/>
  <Field id="_595" name="chanvol" type="_680" context="_253" access="public" location="f9:579" file="f9" line="579" offset="1552"/>
  <Field id="_596" name="bpm" type="_187" context="_253" access="public" location="f9:580" file="f9" line="580" offset="2064"/>
  <Field id="_597" name="sngspd" type="_187" context="_253" access="public" location="f9:581" file="f9" line="581" offset="2080"/>
  <Field id="_598" name="volume" type="_186" context="_253" access="public" location="f9:582" file="f9" line="582" offset="2096"/>
  <Field id="_599" name="extspd" type="_183" context="_253" access="public" location="f9:584" file="f9" line="584" offset="2112"/>
  <Field id="_600" name="panflag" type="_183" context="_253" access="public" location="f9:585" file="f9" line="585" offset="2144"/>
  <Field id="_601" name="wrap" type="_183" context="_253" access="public" location="f9:586" file="f9" line="586" offset="2176"/>
  <Field id="_602" name="loop" type="_183" context="_253" access="public" location="f9:587" file="f9" line="587" offset="2208"/>
  <Field id="_603" name="fadeout" type="_183" context="_253" access="public" location="f9:588" file="f9" line="588" offset="2240"/>
  <Field id="_604" name="patpos" type="_187" context="_253" access="public" location="f9:590" file="f9" line="590" offset="2272"/>
  <Field id="_605" name="sngpos" type="_186" context="_253" access="public" location="f9:591" file="f9" line="591" offset="2288"/>
  <Field id="_606" name="sngtime" type="_189" context="_253" access="public" location="f9:592" file="f9" line="592" offset="2304"/>
  <Field id="_607" name="relspd" type="_186" context="_253" access="public" location="f9:594" file="f9" line="594" offset="2336"/>
  <Field id="_608" name="numtrk" type="_187" context="_253" access="public" location="f9:597" file="f9" line="597" offset="2352"/>
  <Field id="_609" name="tracks" type="_681" context="_253" access="public" location="f9:598" file="f9" line="598" offset="2368"/>
  <Field id="_610" name="patterns" type="_682" context="_253" access="public" location="f9:599" file="f9" line="599" offset="2432"/>
  <Field id="_611" name="pattrows" type="_682" context="_253" access="public" location="f9:600" file="f9" line="600" offset="2496"/>
  <Field id="_612" name="positions" type="_682" context="_253" access="public" location="f9:601" file="f9" line="601" offset="2560"/>
  <Field id="_613" name="forbid" type="_183" context="_253" access="public" location="f9:603" file="f9" line="603" offset="2624"/>
  <Field id="_614" name="numrow" type="_187" context="_253" access="public" location="f9:604" file="f9" line="604" offset="2656"/>
  <Field id="_615" name="vbtick" type="_187" context="_253" access="public" location="f9:605" file="f9" line="605" offset="2672"/>
  <Field id="_616" name="sngremainder" type="_187" context="_253" access="public" location="f9:606" file="f9" line="606" offset="2688"/>
  <Field id="_617" name="control" type="_683" context="_253" access="public" location="f9:608" file="f9" line="608" offset="2752"/>
  <Field id="_618" name="voice" type="_684" context="_253" access="public" location="f9:609" file="f9" line="609" offset="2816"/>
  <Field id="_619" name="globalslide" type="_185" context="_253" access="public" location="f9:611" file="f9" line="611" offset="2880"/>
  <Field id="_620" name="pat_repcrazy" type="_185" context="_253" access="public" location="f9:612" file="f9" line="612" offset="2888"/>
  <Field id="_621" name="patbrk" type="_187" context="_253" access="public" location="f9:613" file="f9" line="613" offset="2896"/>
  <Field id="_622" name="patdly" type="_185" context="_253" access="public" location="f9:614" file="f9" line="614" offset="2912"/>
  <Field id="_623" name="patdly2" type="_185" context="_253" access="public" location="f9:615" file="f9" line="615" offset="2920"/>
  <Field id="_624" name="posjmp" type="_186" context="_253" access="public" location="f9:616" file="f9" line="616" offset="2928"/>
  <Field id="_625" name="bpmlimit" type="_187" context="_253" access="public" location="f9:617" file="f9" line="617" offset="2944"/>
  <Field id="_626" name="i" type="_685" context="_255" access="public" location="f9:623" file="f9" line="623" offset="0"/>
  <Field id="_627" name="s" type="_537" context="_255" access="public" location="f9:624" file="f9" line="624" offset="64"/>
  <Field id="_628" name="panning" type="_186" context="_255" access="public" location="f9:625" file="f9" line="625" offset="128"/>
  <Field id="_629" name="volume" type="_184" context="_255" access="public" location="f9:626" file="f9" line="626" offset="144"/>
  <Field id="_630" name="period" type="_187" context="_255" access="public" location="f9:627" file="f9" line="627" offset="160"/>
  <Field id="_631" name="kick" type="_185" context="_255" access="public" location="f9:628" file="f9" line="628" offset="176"/>
  <PointerType id="_632" type="_257"/>
  <PointerType id="_633" type="_254"/>
  <PointerType id="_634" type="_256"/>
  <PointerType id="_635" type="_686"/>
  <PointerType id="_636" type="_318"/>
  <PointerType id="_637" type="_317"/>
  <PointerType id="_638" type="_184"/>
  <Typedef id="_639" name="__va_list_tag" type="_687" context="_1" location="f0:0" file="f0" line="0"/>
  <ArrayType id="_640" min="0" max="1" type="_395"/>
  <PointerType id="_641" type="_72"/>
  <ArrayType id="_642" min="0" max="0" type="_464"/>
  <PointerType id="_643" type="_71"/>
  <ArrayType id="_644" min="0" max="19" type="_464"/>
  <Field id="_645" name="__wch" type="_392" context="_431" access="public" location="f5:88" file="f5" line="88" offset="0"/>
  <Field id="_646" name="__wchb" type="_688" context="_431" access="public" location="f5:92" file="f5" line="92" offset="0"/>
  <PointerType id="_647" type="_28"/>
  <PointerType id="_649" type="_689"/>
  <PointerType id="_650" type="_690"/>
  <PointerType id="_651" type="_691"/>
  <PointerType id="_652" type="_692"/>
  <PointerType id="_653" type="_693"/>
  <PointerType id="_654" type="_694"/>
  <PointerType id="_655" type="_695"/>
  <PointerType id="_656" type="_696"/>
  <PointerType id="_657" type="_697"/>
  <PointerType id="_658" type="_698"/>
  <PointerType id="_659" type="_699"/>
  <PointerType id="_660" type="_700"/>
  <PointerType id="_661" type="_701"/>
  <PointerType id="_662" type="_702"/>
  <PointerType id="_663" type="_703"/>
  <PointerType id="_664" type="_704"/>
  <PointerType id="_665" type="_705"/>
  <PointerType id="_666" type="_706"/>
  <PointerType id="_667" type="_707"/>
  <PointerType id="_668" type="_708"/>
  <PointerType id="_669" type="_709"/>
  <PointerType id="_670" type="_710"/>
  <PointerType id="_671" type="_711"/>
  <PointerType id="_672" type="_712"/>
  <PointerType id="_673" type="_713"/>
  <ArrayType id="_674" min="0" max="119" type="_187"/>
  <ArrayType id="_675" min="0" max="119" type="_185"/>
  <ArrayType id="_676" min="0" max="31" type="_248"/>
  <PointerType id="_677" type="_249"/>
  <PointerType id="_678" type="_224"/>
  <ArrayType id="_679" min="0" max="63" type="_187"/>
  <ArrayType id="_680" min="0" max="63" type="_185"/>
  <PointerType id="_681" type="_714"/>
  <PointerType id="_682" type="_187"/>
  <PointerType id="_683" type="_251"/>
  <PointerType id="_684" type="_252"/>
  <PointerType id="_685" type="_250"/>
  <Struct id="_687" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_715 _716 _717 _718" size="192" align="64"/>
  <ArrayType id="_688" min="0" max="3" type="_464"/>
  <Field id="_715" name="gp_offset" type="_392" context="_687" access="public" offset="0"/>
  <Field id="_716" name="fp_offset" type="_392" context="_687" access="public" offset="32"/>
  <Field id="_717" name="overflow_arg_area" type="_398" context="_687" access="public" offset="64"/>
  <Field id="_718" name="reg_save_area" type="_398" context="_687" access="public" offset="128"/>
  <FunctionType id="_648" returns="_395">
    <Argument type="_451"/>
    <Argument type="_451"/>
  </FunctionType>
  <FunctionType id="_686" returns="_437">
    <Argument type="_719"/>
    <Argument type="_5"/>
  </FunctionType>
  <FunctionType id="_689" returns="_437">
    <Argument type="_502"/>
  </FunctionType>
  <FunctionType id="_690" returns="_183"/>
  <FunctionType id="_691" returns="_186">
    <Argument type="_637"/>
    <Argument type="_395"/>
  </FunctionType>
  <FunctionType id="_692" returns="_437">
    <Argument type="_186"/>
  </FunctionType>
  <FunctionType id="_693" returns="_189">
    <Argument type="_395"/>
  </FunctionType>
  <FunctionType id="_694" returns="_189">
    <Argument type="_395"/>
    <Argument type="_678"/>
  </FunctionType>
  <FunctionType id="_695" returns="_395"/>
  <FunctionType id="_696" returns="_437">
    <Argument type="_185"/>
    <Argument type="_187"/>
  </FunctionType>
  <FunctionType id="_697" returns="_187">
    <Argument type="_185"/>
  </FunctionType>
  <FunctionType id="_698" returns="_437">
    <Argument type="_185"/>
    <Argument type="_189"/>
  </FunctionType>
  <FunctionType id="_699" returns="_189">
    <Argument type="_185"/>
  </FunctionType>
  <FunctionType id="_700" returns="_437">
    <Argument type="_185"/>
    <Argument type="_186"/>
    <Argument type="_189"/>
    <Argument type="_189"/>
    <Argument type="_189"/>
    <Argument type="_189"/>
    <Argument type="_187"/>
  </FunctionType>
  <FunctionType id="_701" returns="_437">
    <Argument type="_185"/>
  </FunctionType>
  <FunctionType id="_702" returns="_183">
    <Argument type="_185"/>
  </FunctionType>
  <FunctionType id="_703" returns="_188">
    <Argument type="_185"/>
  </FunctionType>
  <FunctionType id="_704" returns="_395">
    <Argument type="_720"/>
    <Argument type="_396"/>
    <Argument type="_395"/>
  </FunctionType>
  <FunctionType id="_705" returns="_396">
    <Argument type="_720"/>
  </FunctionType>
  <FunctionType id="_706" returns="_183">
    <Argument type="_720"/>
    <Argument type="_398"/>
    <Argument type="_5"/>
  </FunctionType>
  <FunctionType id="_707" returns="_395">
    <Argument type="_720"/>
  </FunctionType>
  <FunctionType id="_708" returns="_183">
    <Argument type="_720"/>
  </FunctionType>
  <FunctionType id="_709" returns="_395">
    <Argument type="_721"/>
    <Argument type="_396"/>
    <Argument type="_395"/>
  </FunctionType>
  <FunctionType id="_710" returns="_396">
    <Argument type="_721"/>
  </FunctionType>
  <FunctionType id="_711" returns="_183">
    <Argument type="_721"/>
    <Argument type="_451"/>
    <Argument type="_5"/>
  </FunctionType>
  <FunctionType id="_712" returns="_395">
    <Argument type="_721"/>
    <Argument type="_395"/>
  </FunctionType>
  <FunctionType id="_713" returns="_437">
    <Argument type="_398"/>
  </FunctionType>
  <PointerType id="_714" type="_185"/>
  <PointerType id="_719" type="_390"/>
  <PointerType id="_720" type="_220"/>
  <PointerType id="_721" type="_222"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/usr/share/castxml/clang/include/stddef.h"/>
  <File id="f2" name="/usr/include/bits/types.h"/>
  <File id="f3" name="/usr/include/libio.h"/>
  <File id="f4" name="/usr/include/stdio.h"/>
  <File id="f5" name="/usr/include/wchar.h"/>
  <File id="f6" name="/usr/include/_G_config.h"/>
  <File id="f7" name="/usr/share/castxml/clang/include/stdarg.h"/>
  <File id="f8" name="/usr/include/stdlib.h"/>
  <File id="f9" name="/usr/include/mikmod.h"/>
</GCC_XML>
